{"security": 0, "policy": 1, "reporting": 2, "issues": 3, "please": 4, "report": 5, "privately": 6, "using": 7, "vulnerability": 8, "submission": 9, "form": 10, "https": 11, "github": 12, "com": 13, "vllm": 14, "project": 15, "advisories": 16, "new": 17, "issue": 18, "triage": 19, "reports": 20, "triaged": 21, "management": 22, "team": 23, "docs": 24, "ai": 25, "en": 26, "latest": 27, "contributing": 28, "vulnerability_management": 29, "html": 30, "threat": 31, "model": 32, "see": 33, "guide": 34, "documentation": 35, "usage": 36, "more": 37, "information": 38, "assumptions": 39, "recommendations": 40, "pytorch": 41, "blob": 42, "main": 43, "md": 44, "how": 45, "securely": 46, "interact": 47, "models": 48, "severity": 49, "we": 50, "determine": 51, "risk": 52, "each": 53, "taking": 54, "account": 55, "our": 56, "experience": 57, "dealing": 58, "past": 59, "versions": 60, "affected": 61, "common": 62, "defaults": 63, "use": 64, "cases": 65, "following": 66, "categories": 67, "critical": 68, "vulnerabilities": 69, "allow": 70, "remote": 71, "attackers": 72, "execute": 73, "arbitrary": 74, "code": 75, "take": 76, "full": 77, "control": 78, "system": 79, "significantly": 80, "compromise": 81, "confidentiality": 82, "integrity": 83, "availability": 84, "without": 85, "any": 86, "interaction": 87, "privileges": 88, "needed": 89, "examples": 90, "include": 91, "execution": 92, "via": 93, "network": 94, "deserialization": 95, "exploit": 96, "chains": 97, "generally": 98, "those": 99, "which": 100, "rated": 101, "cvss": 102, "high": 103, "serious": 104, "flaws": 105, "elevated": 106, "impact": 107, "like": 108, "rce": 109, "specific": 110, "limited": 111, "contexts": 112, "significant": 113, "data": 114, "loss": 115, "require": 116, "advanced": 117, "conditions": 118, "some": 119, "trust": 120, "deployment": 121, "modes": 122, "multi": 123, "node": 124, "where": 125, "sort": 126, "privileged": 127, "access": 128, "required": 129, "typically": 130, "have": 131, "scores": 132, "between": 133, "moderate": 134, "cause": 135, "denial": 136, "service": 137, "partial": 138, "disruption": 139, "do": 140, "breach": 141, "rating": 142, "low": 143, "minor": 144, "informational": 145, "disclosures": 146, "logging": 147, "errors": 148, "non": 149, "exploitable": 150, "weaknesses": 151, "local": 152, "privilege": 153, "offer": 154, "negligible": 155, "side": 156, "channel": 157, "attacks": 158, "hash": 159, "collisions": 160, "often": 161, "less": 162, "than": 163, "prenotification": 164, "certain": 165, "level": 166, "may": 167, "prenotify": 168, "organizations": 169, "vendors": 170, "ship": 171, "purpose": 172, "coordinated": 173, "release": 174, "fixes": 175, "severe": 176, "private": 177, "email": 178, "notification": 179, "also": 180, "adding": 181, "contacts": 182, "advisory": 183, "few": 184, "days": 185, "before": 186, "you": 187, "wish": 188, "added": 189, "group": 190, "send": 191, "copying": 192, "all": 193, "members": 194, "vendor": 195, "contact": 196, "analyzed": 197, "case": 198, "basis": 199, "withdraw": 200, "from": 201, "receiving": 202, "future": 203, "prenotifications": 204, "other": 205, "about": 206, "public": 207, "membership": 208, "change": 209, "based": 210, "refinements": 211, "who": 212, "included": 213, "spdx": 214, "license": 215, "identifier": 216, "apache": 217, "filecopyrighttext": 218, "copyright": 219, "contributors": 220, "import": 221, "importlib": 222, "traceback": 223, "typing": 224, "callable": 225, "unittest": 226, "mock": 227, "patch": 228, "def": 229, "find_cuda_init": 230, "fn": 231, "object": 232, "none": 233, "helper": 234, "function": 235, "debug": 236, "cuda": 237, "re": 238, "initialization": 239, "initializes": 240, "prints": 241, "stack": 242, "trace": 243, "happens": 244, "torch": 245, "_lazy_init": 246, "wrapper": 247, "nonlocal": 248, "extract_stack": 249, "return": 250, "print": 251, "initialized": 252, "join": 253, "format_list": 254, "strip": 255, "__name__": 256, "__main__": 257, "lambda": 258, "import_module": 259, "model_executor": 260, "llava": 261, "conduct": 262, "pledge": 263, "leaders": 264, "make": 265, "participation": 266, "community": 267, "harassment": 268, "free": 269, "everyone": 270, "regardless": 271, "age": 272, "body": 273, "size": 274, "visible": 275, "invisible": 276, "disability": 277, "ethnicity": 278, "sex": 279, "characteristics": 280, "gender": 281, "identity": 282, "expression": 283, "education": 284, "socioeconomic": 285, "status": 286, "nationality": 287, "personal": 288, "appearance": 289, "race": 290, "caste": 291, "color": 292, "religion": 293, "sexual": 294, "orientation": 295, "act": 296, "ways": 297, "contribute": 298, "open": 299, "welcoming": 300, "diverse": 301, "inclusive": 302, "healthy": 303, "standards": 304, "behavior": 305, "contributes": 306, "positive": 307, "environment": 308, "demonstrating": 309, "empathy": 310, "kindness": 311, "toward": 312, "people": 313, "being": 314, "respectful": 315, "differing": 316, "opinions": 317, "viewpoints": 318, "experiences": 319, "giving": 320, "gracefully": 321, "accepting": 322, "constructive": 323, "feedback": 324, "responsibility": 325, "apologizing": 326, "mistakes": 327, "learning": 328, "focusing": 329, "what": 330, "best": 331, "just": 332, "us": 333, "individuals": 334, "overall": 335, "unacceptable": 336, "sexualized": 337, "language": 338, "imagery": 339, "attention": 340, "advances": 341, "kind": 342, "trolling": 343, "insulting": 344, "derogatory": 345, "comments": 346, "political": 347, "publishing": 348, "others": 349, "physical": 350, "address": 351, "explicit": 352, "permission": 353, "could": 354, "reasonably": 355, "considered": 356, "inappropriate": 357, "professional": 358, "setting": 359, "enforcement": 360, "responsibilities": 361, "responsible": 362, "clarifying": 363, "enforcing": 364, "acceptable": 365, "appropriate": 366, "fair": 367, "corrective": 368, "action": 369, "response": 370, "deem": 371, "threatening": 372, "offensive": 373, "harmful": 374, "right": 375, "remove": 376, "edit": 377, "reject": 378, "commits": 379, "wiki": 380, "edits": 381, "contributions": 382, "aligned": 383, "communicate": 384, "reasons": 385, "moderation": 386, "decisions": 387, "when": 388, "scope": 389, "applies": 390, "within": 391, "spaces": 392, "individual": 393, "officially": 394, "representing": 395, "official": 396, "posting": 397, "social": 398, "media": 399, "acting": 400, "appointed": 401, "representative": 402, "online": 403, "offline": 404, "irl": 405, "event": 406, "instances": 407, "abusive": 408, "harassing": 409, "otherwise": 410, "reported": 411, "slack": 412, "complaints": 413, "reviewed": 414, "investigated": 415, "promptly": 416, "fairly": 417, "obligated": 418, "respect": 419, "privacy": 420, "reporter": 421, "incident": 422, "guidelines": 423, "follow": 424, "determining": 425, "consequences": 426, "violation": 427, "correction": 428, "deemed": 429, "unprofessional": 430, "unwelcome": 431, "consequence": 432, "written": 433, "warning": 434, "providing": 435, "clarity": 436, "around": 437, "nature": 438, "explanation": 439, "why": 440, "apology": 441, "requested": 442, "through": 443, "single": 444, "series": 445, "actions": 446, "continued": 447, "involved": 448, "including": 449, "unsolicited": 450, "specified": 451, "period": 452, "time": 453, "includes": 454, "avoiding": 455, "interactions": 456, "well": 457, "external": 458, "channels": 459, "violating": 460, "terms": 461, "lead": 462, "temporary": 463, "permanent": 464, "ban": 465, "sustained": 466, "communication": 467, "allowed": 468, "during": 469, "pattern": 470, "aggression": 471, "disparagement": 472, "classes": 473, "attribution": 474, "adapted": 475, "contributor": 476, "covenant": 477, "www": 478, "org": 479, "version": 480, "available": 481, "v2": 482, "code_of_conduct": 483, "were": 484, "inspired": 485, "mozilla": 486, "ladder": 487, "inclusion": 488, "answers": 489, "questions": 490, "faq": 491, "translations": 492, "ctypes": 493, "util": 494, "json": 495, "os": 496, "shutil": 497, "subprocess": 498, "sys": 499, "pathlib": 500, "path": 501, "packaging": 502, "parse": 503, "setuptools": 504, "extension": 505, "setup": 506, "command": 507, "build_ext": 508, "setuptools_scm": 509, "get_version": 510, "utils": 511, "cpp_extension": 512, "cuda_home": 513, "rocm_home": 514, "load_module_from_path": 515, "module_name": 516, "spec": 517, "spec_from_file_location": 518, "module": 519, "module_from_spec": 520, "modules": 521, "loader": 522, "exec_module": 523, "root_dir": 524, "__file__": 525, "parent": 526, "logger": 527, "getlogger": 528, "envs": 529, "py": 530, "vllm_target_device": 531, "main_cuda_version": 532, "12": 533, "is_sccache_available": 534, "bool": 535, "sccache": 536, "int": 537, "getenv": 538, "vllm_disable_sccache": 539, "is_ccache_available": 540, "ccache": 541, "is_ninja_available": 542, "ninja": 543, "is_url_available": 544, "url": 545, "str": 546, "urllib": 547, "request": 548, "urlopen": 549, "try": 550, "except": 551, "exception": 552, "false": 553, "200": 554, "class": 555, "cmakeextension": 556, "__init__": 557, "self": 558, "name": 559, "cmake_lists_dir": 560, "kwa": 561, "super": 562, "sources": 563, "py_limited_api": 564, "true": 565, "abspath": 566, "cmake_build_ext": 567, "dict": 568, "directories": 569, "been": 570, "configured": 571, "did_config": 572, "number": 573, "compilation": 574, "jobs": 575, "optionally": 576, "nvcc": 577, "compile": 578, "threads": 579, "compute_num_jobs": 580, "num_jobs": 581, "either": 582, "value": 583, "max_jobs": 584, "variable": 585, "defined": 586, "cpus": 587, "info": 588, "else": 589, "sched_getaffinity": 590, "isn": 591, "universally": 592, "so": 593, "fall": 594, "back": 595, "cpu_count": 596, "get": 597, "error": 598, "here": 599, "len": 600, "attributeerror": 601, "nvcc_threads": 602, "_is_cuda": 603, "get_nvcc_cuda_version": 604, "11": 605, "set": 606, "reduce": 607, "avoid": 608, "overloading": 609, "max": 610, "perform": 611, "cmake": 612, "configuration": 613, "configure": 614, "ext": 615, "ve": 616, "already": 617, "cmakelists": 618, "txt": 619, "exit": 620, "early": 621, "select": 622, "build": 623, "type": 624, "note": 625, "optimization": 626, "default_cfg": 627, "relwithdebinfo": 628, "cfg": 629, "cmake_build_type": 630, "cmake_args": 631, "dcmake_build_type": 632, "format": 633, "dvllm_target_device": 634, "verbose": 635, "dcmake_verbose_makefile": 636, "dcmake_c_compiler_launcher": 637, "dcmake_cxx_compiler_launcher": 638, "dcmake_cuda_compiler_launcher": 639, "dcmake_hip_compiler_launcher": 640, "elif": 641, "pass": 642, "python": 643, "executable": 644, "can": 645, "find": 646, "exact": 647, "match": 648, "dvllm_python_executable": 649, "reuse": 650, "dependencies": 651, "subsequent": 652, "calls": 653, "dvllm_python_path": 654, "override": 655, "base": 656, "directory": 657, "fetchcontent": 658, "downloads": 659, "root": 660, "deps": 661, "allows": 662, "sharing": 663, "profiles": 664, "plays": 665, "nicely": 666, "fetchcontent_base_dir": 667, "fc_base_dir": 668, "environ": 669, "dfetchcontent_base_dir": 670, "parallelism": 671, "tool": 672, "num_jo": 673, "obs": 674, "dnvcc_threads": 675, "build_tool": 676, "dcmake_job_pool_compile": 677, "string": 678, "dcmake_job_pools": 679, "default": 680, "whatever": 681, "picks": 682, "sure": 683, "dcmake_cuda_compiler": 684, "bin": 685, "check_call": 686, "cwd": 687, "build_temp": 688, "build_extensions": 689, "ensure": 690, "present": 691, "working": 692, "check_output": 693, "oserror": 694, "raise": 695, "runtimeerror": 696, "cannot": 697, "create": 698, "does": 699, "exist": 700, "exists": 701, "makedirs": 702, "targets": 703, "target_name": 704, "removeprefix": 705, "vllm_flash_attn": 706, "extensions": 707, "append": 708, "build_args": 709, "target": 710, "install": 711, "libraries": 712, "proper": 713, "location": 714, "outdir": 715, "get_ext_fullpath": 716, "absolute": 717, "skip": 718, "direc": 719, "ctory": 720, "same": 721, "continue": 722, "appends": 723, "prefix": 724, "contains": 725, "need": 726, "range": 727, "count": 728, "should": 729, "actually": 730, "components": 731, "install_args": 732, "component": 733, "run": 734, "first": 735, "standard": 736, "copy": 737, "build_lib": 738, "current": 739, "editable": 740, "glob": 741, "files": 742, "recursive": 743, "file": 744, "dst_file": 745, "split": 746, "dirname": 747, "exist_ok": 748, "copy_file": 749, "precompiled_build_ext": 750, "disables": 751, "building": 752, "precompiled": 753, "binaries": 754, "assert": 755, "vllm_use_precompiled": 756, "only": 757, "supported": 758, "builds": 759, "skipping": 760, "precompiled_wheel_utils": 761, "extracts": 762, "existing": 763, "wheel": 764, "staticmethod": 765, "extract_precompiled_and_patch_package": 766, "wheel_url_or_path": 767, "tempfile": 768, "zipfile": 769, "temp_dir": 770, "isfile": 771, "wheel_filename": 772, "mkdtemp": 773, "wheels": 774, "wheel_path": 775, "downloading": 776, "urlretrieve": 777, "filename": 778, "package_data_patch": 779, "files_to_copy": 780, "_c": 781, "abi3": 782, "_moe_c": 783, "_flashmla_c": 784, "_vllm_fa2_c": 785, "_vllm_fa3_c": 786, "cumem_allocator": 787, "compiled_regex": 788, "file_members": 789, "list": 790, "filter": 791, "filelist": 792, "extract": 793, "target_path": 794, "target_pa": 795, "ath": 796, "src": 797, "wb": 798, "dst": 799, "copyfileobj": 800, "pkg": 801, "replace": 802, "setdefault": 803, "basename": 804, "finally": 805, "removing": 806, "rmtree": 807, "get_base_commit_in_main_branch": 808, "force": 809, "nightly": 810, "mainly": 811, "used": 812, "ci": 813, "testing": 814, "vllm_test_use_precompiled_nightly_wheel": 815, "commit": 816, "upstream": 817, "branch": 818, "resp_json": 819, "curl": 820, "api": 821, "repos": 822, "decode": 823, "utf": 824, "upstream_main_commit": 825, "loads": 826, "sha": 827, "docker": 828, "context": 829, "git": 830, "immutable": 831, "missing": 832, "vllm_docker_build_context": 833, "check": 834, "repo": 835, "cat": 836, "calledprocesserror": 837, "fetch": 838, "repository": 839, "update": 840, "branches": 841, "ensures": 842, "ref": 843, "its": 844, "history": 845, "current_branch": 846, "show": 847, "base_commit": 848, "merge": 849, "valueerror": 850, "err": 851, "failed": 852, "compatible": 853, "your": 854, "dev": 855, "_no_device": 856, "empty": 857, "has_cuda": 858, "_is_neuron": 859, "_is_tpu": 860, "_is_hip": 861, "rocm": 862, "hip": 863, "neuron": 864, "tpu": 865, "_is_cpu": 866, "cpu": 867, "_is_xpu": 868, "xpu": 869, "_build_custom_ops": 870, "get_rocm_version": 871, "librocm": 872, "core": 873, "d11f5c20d500f729c393680a01fa902ebf92094b": 874, "rocm_version": 875, "cpp": 876, "l21": 877, "librocm_core_file": 878, "lib": 879, "is_file": 880, "librocm_core": 881, "cdll": 882, "vererrors": 883, "c_uint32": 884, "get_rocm_core_version": 885, "getrocmversion": 886, "restype": 887, "argtypes": 888, "pointer": 889, "major": 890, "byref": 891, "get_neuronxcc_version": 892, "sysconfig": 893, "site_dir": 894, "get_paths": 895, "purelib": 896, "version_file": 897, "neuronxcc": 898, "executed": 899, "successfully": 900, "fp": 901, "content": 902, "read": 903, "regular": 904, "search": 905, "__version__": 906, "output": 907, "nvidia": 908, "apex": 909, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 910, "nvcc_output": 911, "universal_newlines": 912, "release_idx": 913, "index": 914, "nvcc_cuda_version": 915, "get_gaudi_sw_version": 916, "returns": 917, "driver": 918, "enable": 919, "console": 920, "printing": 921, "hl": 922, "smi": 923, "shell": 924, "text": 925, "capture_output": 926, "env": 927, "enable_console": 928, "returncode": 929, "stdout": 930, "get_vllm_version": 931, "write_to": 932, "_version": 933, "sep": 934, "might": 935, "contain": 936, "cuda_version": 937, "cuda_version_str": 938, "source": 939, "tarball": 940, "pypi": 941, "sdist": 942, "argv": 943, "cu": 944, "neuron_version": 945, "neuron_version_str": 946, "unknown": 947, "runtime": 948, "get_requirements": 949, "package": 950, "requirements": 951, "requirements_dir": 952, "_read_requirements": 953, "resolved_requirements": 954, "line": 955, "startswith": 956, "cuda_major": 957, "cuda_minor": 958, "modified_requirements": 959, "req": 960, "flash": 961, "attn": 962, "built": 963, "unsupported": 964, "platform": 965, "ext_modules": 966, "package_data": 967, "typed": 968, "layers": 969, "fused_moe": 970, "configs": 971, "quantization": 972, "releasing": 973, "releases": 974, "reliable": 975, "packaged": 976, "binary": 977, "conveniently": 978, "accessed": 979, "serve": 980, "key": 981, "milestones": 982, "development": 983, "newly": 984, "features": 985, "improvements": 986, "upcoming": 987, "changes": 988, "affect": 989, "users": 990, "potential": 991, "breaking": 992, "versioning": 993, "uses": 994, "shifted": 995, "scheme": 996, "out": 997, "every": 998, "weeks": 999, "bug": 1000, "opposed": 1001, "semver": 1002, "backwards": 1003, "made": 1004, "special": 1005, "post1": 1006, "released": 1007, "_major_": 1008, "architectural": 1009, "milestone": 1010, "incompatible": 1011, "similar": 1012, "_minor_": 1013, "_patch_": 1014, "_post1_": 1015, "_patch": 1016, "1_": 1017, "implicit": 1018, "post": 1019, "cadence": 1020, "bi": 1021, "weekly": 1022, "after": 1023, "year": 1024, "2025": 1025, "dates": 1026, "below": 1027, "tentative": 1028, "optional": 1029, "date": 1030, "jan": 1031, "feb": 1032, "mar": 1033, "apr": 1034, "jun": 1035, "10": 1036, "jul": 1037, "13": 1038, "aug": 1039, "14": 1040, "15": 1041, "16": 1042, "17": 1043, "oct": 1044, "18": 1045, "19": 1046, "nov": 1047, "20": 1048, "21": 1049, "dec": 1050, "22": 1051, "23": 1052, "dedicated": 1053, "cut": 1054, "performed": 1055, "live": 1056, "previously": 1057, "reused": 1058, "triggered": 1059, "push": 1060, "rc": 1061, "tag": 1062, "vx": 1063, "rc1": 1064, "enables": 1065, "test": 1066, "multiple": 1067, "rcs": 1068, "final": 1069, "trigger": 1070, "notes": 1071, "assets": 1072, "created": 1073, "monitor": 1074, "reverts": 1075, "apply": 1076, "cherry": 1077, "pick": 1078, "criteria": 1079, "approach": 1080, "finalizing": 1081, "clear": 1082, "process": 1083, "land": 1084, "pr": 1085, "has": 1086, "sufficient": 1087, "complete": 1088, "thorough": 1089, "round": 1090, "stable": 1091, "regression": 1092, "functional": 1093, "performance": 1094, "against": 1095, "most": 1096, "recent": 1097, "silent": 1098, "incorrectness": 1099, "compatibility": 1100, "crashes": 1101, "deadlocks": 1102, "large": 1103, "memory": 1104, "leaks": 1105, "introduced": 1106, "identifiers": 1107, "feature": 1108, "work": 1109, "prs": 1110, "merged": 1111, "trunk": 1112, "manual": 1113, "validations": 1114, "e2e": 1115, "validation": 1116, "end": 1117, "regressions": 1118, "benchmark": 1119, "workflow": 1120, "integration": 1121, "workflows": 1122, "yml": 1123, "coverage": 1124, "llama3": 1125, "llama4": 1126, "mixtral": 1127, "hardware": 1128, "h100": 1129, "amd": 1130, "mi300x": 1131, "_note": 1132, "availability_": 1133, "step": 1134, "write": 1135, "review": 1136, "familiarize": 1137, "yourself": 1138, "configurations": 1139, "tree": 1140, "benchmarks": 1141, "navigate": 1142, "v0": 1143, "results": 1144, "once": 1145, "completes": 1146, "dashboard": 1147, "hud": 1148, "llms": 1149, "reponame": 1150, "2fvllm": 1151, "under": 1152, "corresponding": 1153, "comparison": 1154, "compare": 1155, "previous": 1156, "verify": 1157, "occurred": 1158, "example": 1159, "vs": 1160, "starttime": 1161, "thu": 1162, "2c": 1163, "2017": 1164, "20apr": 1165, "202025": 1166, "2021": 1167, "3a43": 1168, "3a50": 1169, "20gmt": 1170, "stoptime": 1171, "wed": 1172, "2016": 1173, "20jul": 1174, "granularity": 1175, "week": 1176, "lbranch": 1177, "lcommit": 1178, "b6553be1bc75f046b00046a4ad7576364d03c835": 1179, "rbranch": 1180, "rcommit": 1181, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 1182, "benchmarkname": 1183, "modelname": 1184, "20models": 1185, "backendname": 1186, "20backends": 1187, "modename": 1188, "20modes": 1189, "dtypename": 1190, "20dtype": 1191, "devicename": 1192, "20devices": 1193, "archname": 1194, "20platforms": 1195, "markdownlint": 1196, "disable": 1197, "md001": 1198, "md041": 1199, "align": 1200, "center": 1201, "picture": 1202, "prefers": 1203, "dark": 1204, "srcset": 1205, "raw": 1206, "githubusercontent": 1207, "logos": 1208, "logo": 1209, "png": 1210, "img": 1211, "alt": 1212, "light": 1213, "width": 1214, "55": 1215, "h3": 1216, "easy": 1217, "fast": 1218, "cheap": 1219, "llm": 1220, "serving": 1221, "href": 1222, "blog": 1223, "arxiv": 1224, "abs": 1225, "2309": 1226, "06180": 1227, "paper": 1228, "vllm_project": 1229, "twitter": 1230, "discuss": 1231, "user": 1232, "forum": 1233, "developer": 1234, "news": 1235, "08": 1236, "hosted": 1237, "beijing": 1238, "meetup": 1239, "mp": 1240, "weixin": 1241, "qq": 1242, "dgkwg1wfpwgo2jcdtqqhxa": 1243, "scale": 1244, "slides": 1245, "drive": 1246, "google": 1247, "folders": 1248, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 1249, "recording": 1250, "chaspark": 1251, "1166916873711665152": 1252, "05": 1253, "nyc": 1254, "lu": 1255, "ma": 1256, "c1rqyf1f": 1257, "presentation": 1258, "1_q_aw_iomjwuimf1s1ym": 1259, "zhjxz8cuel0ijvaquoybea": 1260, "usp": 1261, "now": 1262, "foundation": 1263, "announcement": 1264, "welcomes": 1265, "01": 1266, "excited": 1267, "announce": 1268, "alpha": 1269, "v1": 1270, "upgrade": 1271, "7x": 1272, "speedup": 1273, "clean": 1274, "optimized": 1275, "loop": 1276, "zero": 1277, "overhead": 1278, "caching": 1279, "enhanced": 1280, "multimodal": 1281, "support": 1282, "27": 1283, "details": 1284, "summary": 1285, "04": 1286, "asia": 1287, "day": 1288, "sginnovate": 1289, "morning": 1290, "evening": 1291, "slots": 1292, "remaining": 1293, "inaugural": 1294, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 1295, "03": 1296, "ollama": 1297, "inference": 1298, "night": 1299, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 1300, "china": 1301, "n77gibl2coratqhtveazfg": 1302, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 1303, "east": 1304, "coast": 1305, "7mu4k4xx": 1306, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 1307, "slide": 1308, "id": 1309, "g31441846c39_0_0": 1310, "02": 1311, "ninth": 1312, "h7g3kuj9": 1313, "meta": 1314, "1jzc_pzvxrvnsfvcw": 1315, "v4cfxb6pn7zz2cyp_flwo05aqg": 1316, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 1317, "view": 1318, "posted": 1319, "eighth": 1320, "zep56hui": 1321, "cloud": 1322, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 1323, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 1324, "2024": 1325, "joins": 1326, "ecosystem": 1327, "seventh": 1328, "h0qvrajz": 1329, "snowflake": 1330, "1e3cxqbv3jsfgp30swyvs3em_tw": 1331, "ghohj9pajgk6kr54": 1332, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 1333, "coordinating": 1334, "discussing": 1335, "feel": 1336, "ray": 1337, "summit": 1338, "held": 1339, "track": 1340, "opening": 1341, "talk": 1342, "1b_kqxphbtra_mdf": 1343, "tr6i8rwdou5qotznceg2mkzxehm": 1344, "learn": 1345, "talks": 1346, "youtube": 1347, "playlist": 1348, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 1349, "09": 1350, "sixth": 1351, "87q3nvnh": 1352, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 1353, "9wqyp7ny93xrs": 1354, "07": 1355, "fifth": 1356, "lp0gyjqr": 1357, "aws": 1358, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 1359, "partnership": 1360, "supports": 1361, "llama": 1362, "fp8": 1363, "pipeline": 1364, "llama31": 1365, "06": 1366, "fourth": 1367, "agivllm": 1368, "cloudflare": 1369, "bentoml": 1370, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 1371, "third": 1372, "robloxandvllmmeetup2024": 1373, "splashthat": 1374, "roblox": 1375, "1a": 1376, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 1377, "second": 1378, "ygxbpzhl": 1379, "ibm": 1380, "12mi2skabnuw5rbwxdyy": 1381, "hthth4imsnceoq10jdqbxga": 1382, "2023": 1383, "a16z": 1384, "1ql": 1385, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 1386, "would": 1387, "express": 1388, "sincere": 1389, "gratitude": 1390, "andreessen": 1391, "horowitz": 1392, "30": 1393, "supporting": 1394, "generous": 1395, "grant": 1396, "research": 1397, "fastchat": 1398, "powered": 1399, "lmsys": 1400, "vicuna": 1401, "chatbot": 1402, "arena": 1403, "chat": 1404, "since": 1405, "mid": 1406, "april": 1407, "library": 1408, "originally": 1409, "developed": 1410, "sky": 1411, "computing": 1412, "lab": 1413, "cs": 1414, "berkeley": 1415, "edu": 1416, "uc": 1417, "evolved": 1418, "driven": 1419, "both": 1420, "academia": 1421, "industry": 1422, "state": 1423, "art": 1424, "throughput": 1425, "efficient": 1426, "pagedattention": 1427, "continuous": 1428, "batching": 1429, "incoming": 1430, "requests": 1431, "graph": 1432, "quantizations": 1433, "gptq": 1434, "2210": 1435, "17323": 1436, "awq": 1437, "2306": 1438, "00978": 1439, "autoround": 1440, "05516": 1441, "int4": 1442, "int8": 1443, "kernels": 1444, "flashattention": 1445, "flashinfer": 1446, "speculative": 1447, "decoding": 1448, "chunked": 1449, "prefill": 1450, "flexible": 1451, "seamless": 1452, "popular": 1453, "hugging": 1454, "face": 1455, "various": 1456, "algorithms": 1457, "parallel": 1458, "sampling": 1459, "beam": 1460, "tensor": 1461, "expert": 1462, "distributed": 1463, "streaming": 1464, "outputs": 1465, "openai": 1466, "server": 1467, "gpus": 1468, "intel": 1469, "powerpc": 1470, "lora": 1471, "seamlessly": 1472, "huggingface": 1473, "transformer": 1474, "mixture": 1475, "deepseek": 1476, "v3": 1477, "embedding": 1478, "e5": 1479, "mistral": 1480, "modal": 1481, "supported_models": 1482, "getting": 1483, "started": 1484, "pip": 1485, "getting_started": 1486, "installation": 1487, "gpu": 1488, "bash": 1489, "visit": 1490, "quickstart": 1491, "welcome": 1492, "collaborations": 1493, "sponsors": 1494, "compute": 1495, "resources": 1496, "thank": 1497, "them": 1498, "alphabetical": 1499, "order": 1500, "keep": 1501, "consistent": 1502, "cash": 1503, "donations": 1504, "dropbox": 1505, "sequoia": 1506, "capital": 1507, "skywork": 1508, "zhenfund": 1509, "alibaba": 1510, "anyscale": 1511, "crusoe": 1512, "databricks": 1513, "deepinfra": 1514, "nebius": 1515, "novita": 1516, "replicate": 1517, "runpod": 1518, "trainy": 1519, "san": 1520, "diego": 1521, "sponsor": 1522, "fundraising": 1523, "venue": 1524, "opencollective": 1525, "plan": 1526, "fund": 1527, "maintenance": 1528, "adoption": 1529, "citation": 1530, "cite": 1531, "bibtex": 1532, "inproceedings": 1533, "kwon2023efficient": 1534, "title": 1535, "author": 1536, "woosuk": 1537, "kwon": 1538, "zhuohan": 1539, "li": 1540, "siyuan": 1541, "zhuang": 1542, "ying": 1543, "sheng": 1544, "lianmin": 1545, "zheng": 1546, "cody": 1547, "hao": 1548, "yu": 1549, "joseph": 1550, "gonzalez": 1551, "zhang": 1552, "ion": 1553, "stoica": 1554, "booktitle": 1555, "proceedings": 1556, "acm": 1557, "sigops": 1558, "29th": 1559, "symposium": 1560, "operating": 1561, "systems": 1562, "principles": 1563, "start": 1564, "technical": 1565, "fellow": 1566, "partnerships": 1567, "lists": 1568, "mailto": 1569, "kit": 1570, "refer": 1571, "requires_files": 1572, "pyproject": 1573, "toml": 1574, "cleaning": 1575, "lines": 1576, "readlines": 1577, "lower": 1578, "removed": 1579, "done": 1580, "dataclasses": 1581, "random": 1582, "transformers": 1583, "pretrainedtokenizerbase": 1584, "samplingparams": 1585, "engine": 1586, "arg_utils": 1587, "engineargs": 1588, "flexibleargumentparser": 1589, "prompt": 1590, "helpful": 1591, "assistant": 1592, "recognizes": 1593, "tables": 1594, "markdown": 1595, "table": 1596, "fellows": 1597, "answer": 1598, "my": 1599, "question": 1600, "sl": 1601, "film": 1602, "cast": 1603, "director": 1604, "music": 1605, "agni": 1606, "pushpam": 1607, "jayabharathi": 1608, "kamalahasan": 1609, "jeassy": 1610, "arjunan": 1611, "priyamvada": 1612, "mohan": 1613, "sharma": 1614, "lakshmi": 1615, "kpac": 1616, "lalitha": 1617, "sethumadhavan": 1618, "dakshinamoorthy": 1619, "yakshagaanam": 1620, "madhu": 1621, "sheela": 1622, "viswanathan": 1623, "paalkkadal": 1624, "sharada": 1625, "prasad": 1626, "ummer": 1627, "amma": 1628, "srividya": 1629, "krishnan": 1630, "nair": 1631, "appooppan": 1632, "thikkurissi": 1633, "sukumaran": 1634, "kamal": 1635, "haasan": 1636, "bhaskaran": 1637, "baburaj": 1638, "srishti": 1639, "chowalloor": 1640, "krishnankutty": 1641, "ravi": 1642, "alummoodu": 1643, "muhammad": 1644, "vanadevatha": 1645, "prem": 1646, "nazir": 1647, "madhubala": 1648, "yusufali": 1649, "kechery": 1650, "devarajan": 1651, "samasya": 1652, "kamalahaasan": 1653, "thankappan": 1654, "shyam": 1655, "yudhabhoomi": 1656, "vidhubala": 1657, "crossbelt": 1658, "mani": 1659, "shekhar": 1660, "seemantha": 1661, "puthran": 1662, "raj": 1663, "swapnadanam": 1664, "rani": 1665, "chandra": 1666, "dr": 1667, "mohandas": 1668, "george": 1669, "bhaskar": 1670, "chandavarkar": 1671, "thulavarsham": 1672, "sreedevi": 1673, "sudheer": 1674, "sankaran": 1675, "aruthu": 1676, "kaviyoor": 1677, "ponnamma": 1678, "26": 1679, "swimming": 1680, "pool": 1681, "soman": 1682, "sasikumar": 1683, "nwhat": 1684, "cells": 1685, "test_prefix": 1686, "sampling_params": 1687, "prompts": 1688, "start_time": 1689, "generate": 1690, "end_time": 1691, "cost": 1692, "prompt_len": 1693, "output_len": 1694, "sample_tokens": 1695, "tokenizer": 1696, "length": 1697, "vocab": 1698, "get_vocab": 1699, "all_special_ids": 1700, "tokens": 1701, "choices": 1702, "items": 1703, "sample_requests_from_dataset": 1704, "dataset_path": 1705, "num_requests": 1706, "input_length_range": 1707, "tuple": 1708, "fixed_output_len": 1709, "too": 1710, "small": 1711, "load": 1712, "dataset": 1713, "conversations": 1714, "turns": 1715, "two": 1716, "conversation": 1717, "shuffle": 1718, "min_len": 1719, "max_len": 1720, "sequences": 1721, "long": 1722, "short": 1723, "filtered_requests": 1724, "break": 1725, "tokenize": 1726, "completions": 1727, "prompt_token_ids": 1728, "input_ids": 1729, "completion": 1730, "completion_token_ids": 1731, "sample_requests_from_random": 1732, "prefix_len": 1733, "prefix_token_ids": 1734, "unique_part_token_ids": 1735, "randint": 1736, "repeat_and_sort_requests": 1737, "repeat_count": 1738, "repeated_requests": 1739, "args": 1740, "get_tokenizer": 1741, "trust_remote_code": 1742, "map": 1743, "seed": 1744, "provided": 1745, "sample": 1746, "num_prompts": 1747, "stats": 1748, "sampled": 1749, "prompt_lens": 1750, "average": 1751, "input": 1752, "sum": 1753, "p50": 1754, "sorted": 1755, "min": 1756, "engine_args": 1757, "from_cli_args": 1758, "asdict": 1759, "temperature": 1760, "max_tokens": 1761, "detokenize": 1762, "disable_detokenize": 1763, "filtered": 1764, "generating": 1765, "test_": 1766, "_prefix": 1767, "create_argument_parser": 1768, "parser": 1769, "description": 1770, "automatic": 1771, "add_argument": 1772, "help": 1773, "num": 1774, "repeat": 1775, "times": 1776, "store_true": 1777, "lengths": 1778, "128": 1779, "256": 1780, "specifies": 1781, "subtract": 1782, "filtering": 1783, "responses": 1784, "detokenization": 1785, "latency": 1786, "measurement": 1787, "add_cli_args": 1788, "io": 1789, "dataclass": 1790, "field": 1791, "union": 1792, "aiohttp": 1793, "huggingface_hub": 1794, "constants": 1795, "tqdm": 1796, "asyncio": 1797, "autotokenizer": 1798, "pretrainedtokenizer": 1799, "pretrainedtokenizerfast": 1800, "aiohttp_timeout": 1801, "clienttimeout": 1802, "total": 1803, "60": 1804, "requestfuncinput": 1805, "api_url": 1806, "model_name": 1807, "logprobs": 1808, "extra_body": 1809, "multi_modal_content": 1810, "ignore_eos": 1811, "requestfuncoutput": 1812, "generated_text": 1813, "success": 1814, "float": 1815, "output_tokens": 1816, "ttft": 1817, "token": 1818, "itl": 1819, "default_factory": 1820, "inter": 1821, "latencies": 1822, "tpot": 1823, "avg": 1824, "next": 1825, "get_model": 1826, "pretrained_model_name_or_path": 1827, "vllm_use_modelscope": 1828, "modelscope": 1829, "snapshot_download": 1830, "model_loader": 1831, "weight_utils": 1832, "get_lock": 1833, "lock": 1834, "prevent": 1835, "processes": 1836, "weights": 1837, "model_path": 1838, "model_id": 1839, "local_files_only": 1840, "hf_hub_offline": 1841, "ignore_file_pattern": 1842, "pt": 1843, "safetensors": 1844, "tokenizer_mode": 1845, "auto": 1846, "kwargs": 1847, "slow": 1848, "use_fast": 1849, "mode": 1850, "transformers_utils": 1851, "mistraltokenizer": 1852, "importerror": 1853, "requires": 1854, "from_pretrained": 1855, "async_request_funcs": 1856, "tgi": 1857, "async_request_tgi": 1858, "async_request_openai_completions": 1859, "lmdeploy": 1860, "deepspeed": 1861, "mii": 1862, "async_request_deepspeed_mii": 1863, "async_request_openai_chat_completions": 1864, "audio": 1865, "async_request_openai_audio": 1866, "tensorrt": 1867, "async_request_trt_llm": 1868, "scalellm": 1869, "sglang": 1870, "openai_compatible_backends": 1871, "base64": 1872, "abc": 1873, "abstractmethod": 1874, "collections": 1875, "mapping": 1876, "functools": 1877, "cache": 1878, "bytesio": 1879, "numpy": 1880, "np": 1881, "pandas": 1882, "pd": 1883, "datasets": 1884, "load_dataset": 1885, "pil": 1886, "image": 1887, "lorarequest": 1888, "get_adapter_absolute_path": 1889, "multimodaldatadict": 1890, "convert_image_mode": 1891, "anytokenizer": 1892, "get_lora_tokenizer": 1893, "samplerequest": 1894, "represents": 1895, "benchmarking": 1896, "expected_output_len": 1897, "multi_modal_data": 1898, "lora_request": 1899, "benchmarkdataset": 1900, "default_seed": 1901, "is_multimodal": 1902, "random_seed": 1903, "initialize": 1904, "indicates": 1905, "reproducible": 1906, "shuffling": 1907, "ensuring": 1908, "replaced": 1909, "apply_multimodal_chat_transformation": 1910, "mm_content": 1911, "transform": 1912, "method": 1913, "expect": 1914, "role": 1915, "load_data": 1916, "must": 1917, "overridden": 1918, "subclasses": 1919, "vary": 1920, "depending": 1921, "raises": 1922, "notimplementederror": 1923, "subclass": 1924, "implement": 1925, "todo": 1926, "jenniferzhao": 1927, "add": 1928, "implemented": 1929, "get_random_lora_request": 1930, "max_loras": 1931, "option": 1932, "nal": 1933, "lora_path": 1934, "associated": 1935, "parameters": 1936, "randomly": 1937, "selects": 1938, "retrieves": 1939, "cached": 1940, "selected": 1941, "maximum": 1942, "loras": 1943, "disk": 1944, "element": 1945, "applicable": 1946, "lora_id": 1947, "lora_name": 1948, "lora_int_id": 1949, "lora_path_on_disk": 1950, "lora_tokenizer_cache": 1951, "abstract": 1952, "subc": 1953, "logic": 1954, "objects": 1955, "processing": 1956, "generated": 1957, "maybe_oversample_requests": 1958, "oversamples": 1959, "desired": 1960, "additional": 1961, "extend": 1962, "oversampled": 1963, "reach": 1964, "samples": 1965, "is_valid_sequence": 1966, "max_prompt_len": 1967, "1024": 1968, "max_total_len": 1969, "2048": 1970, "skip_min_output_len_check": 1971, "validate": 1972, "sequence": 1973, "pruning": 1974, "copied": 1975, "original": 1976, "sample_hf_requests": 1977, "sample_sharegpt_requests": 1978, "functions": 1979, "benchmark_serving": 1980, "sample_requests": 1981, "benchmark_throughput": 1982, "invalid": 1983, "prompt_too_short": 1984, "output_too_short": 1985, "prompt_too_long": 1986, "combined_too_long": 1987, "met": 1988, "process_image": 1989, "multimedia": 1990, "dictionary": 1991, "three": 1992, "types": 1993, "bytes": 1994, "expects": 1995, "containing": 1996, "converts": 1997, "rgb": 1998, "saves": 1999, "jpeg": 2000, "encodes": 2001, "treats": 2002, "prepends": 2003, "doesn": 2004, "http": 2005, "isinstance": 2006, "image_data": 2007, "save": 2008, "image_base64": 2009, "b64encode": 2010, "getvalue": 2011, "image_url": 2012, "randomdataset": 2013, "values": 2014, "default_prefix_len": 2015, "default_range_ratio": 2016, "default_input_len": 2017, "default_output_len": 2018, "range_ratio": 2019, "input_len": 2020, "enforce": 2021, "random_range_ratio": 2022, "valid": 2023, "vocab_size": 2024, "num_special_tokens": 2025, "num_special_tokens_to_add": 2026, "real_input_len": 2027, "tolist": 2028, "input_low": 2029, "input_high": 2030, "output_low": 2031, "bound": 2032, "least": 2033, "failures": 2034, "output_high": 2035, "debugging": 2036, "input_lens": 2037, "output_lens": 2038, "offsets": 2039, "inner_seq": 2040, "arange": 2041, "token_sequence": 2042, "encode": 2043, "again": 2044, "because": 2045, "consecutive": 2046, "give": 2047, "tokenized": 2048, "gpt2tokenizer": 2049, "6880": 2050, "6881": 2051, "ġcalls": 2052, "1650": 2053, "939": 2054, "486": 2055, "ġcall": 2056, "sh": 2057, "ere": 2058, "uncontrolled": 2059, "encoded": 2060, "truncated": 2061, "total_input_len": 2062, "re_encoded_sequence": 2063, "add_special_tokens": 2064, "sharegptdataset": 2065, "implements": 2066, "sharegpt": 2067, "generates": 2068, "loading": 2069, "encoding": 2070, "entries": 2071, "entry": 2072, "enable_multimodal_chat": 2073, "prompt_ids": 2074, "completion_ids": 2075, "new_output_len": 2076, "sharegpt4video": 2077, "image_path": 2078, "customdataset": 2079, "custom": 2080, "jsonl": 2081, "india": 2082, "iran": 2083, "dictionaries": 2084, "standardized": 2085, "convert": 2086, "filetype": 2087, "assume": 2088, "endswith": 2089, "jsonl_data": 2090, "read_json": 2091, "path_or_buf": 2092, "column": 2093, "columns": 2094, "row": 2095, "dataframe": 2096, "corresponds": 2097, "want": 2098, "iterrows": 2099, "to_dict": 2100, "skip_chat_template": 2101, "sampled_requests": 2102, "item": 2103, "template": 2104, "apply_chat_template": 2105, "add_generation_prompt": 2106, "sonnetdataset": 2107, "simplified": 2108, "implementation": 2109, "sonnet": 2110, "poem": 2111, "550": 2112, "150": 2113, "return_prompt_formatted": 2114, "calculate": 2115, "tokenized_lines": 2116, "avg_len": 2117, "base_prompt": 2118, "many": 2119, "base_msg": 2120, "base_fmt": 2121, "base_offset": 2122, "higher": 2123, "num_input_lines": 2124, "num_prefix_lines": 2125, "prefix_lines": 2126, "while": 2127, "extra_lines": 2128, "msg": 2129, "prompt_formatted": 2130, "burstgptdataset": 2131, "burstgpt": 2132, "csv": 2133, "synthetic": 2134, "generation": 2135, "rows": 2136, "gpt": 2137, "df": 2138, "read_csv": 2139, "gpt4_df": 2140, "_sample_loaded_data": 2141, "random_state": 2142, "lora_req": 2143, "ids": 2144, "computed": 2145, "modulo": 2146, "token_ids": 2147, "huggingfacedataset": 2148, "supported_dataset_paths": 2149, "dataset_split": 2150, "no_stream": 2151, "dataset_subset": 2152, "load_stream": 2153, "conversationdataset": 2154, "lmms": 2155, "onevision": 2156, "aeala": 2157, "sharegpt_vicuna_unfiltered": 2158, "filtered_data": 2159, "dynamic_output": 2160, "conv": 2161, "completion_len": 2162, "enabled": 2163, "longer": 2164, "accurate": 2165, "actual": 2166, "visionarenadataset": 2167, "vision": 2168, "lmarena": 2169, "visionarena": 2170, "bench": 2171, "parser_fn": 2172, "images": 2173, "instructcoderdataset": 2174, "instructcoder": 2175, "co": 2176, "likaixin": 2177, "designed": 2178, "general": 2179, "editing": 2180, "consists": 2181, "114": 2182, "239": 2183, "instruction": 2184, "triplets": 2185, "covers": 2186, "distinct": 2187, "scenario": 2188, "mtbenchdataset": 2189, "mt": 2190, "philschmid": 2191, "turn": 2192, "9d98ab5ec": 2193, "offline_inference": 2194, "eagle": 2195, "l14": 2196, "l18": 2197, "noqa": 2198, "e501": 2199, "sd": 2200, "aimodataset": 2201, "aimo": 2202, "reasoning": 2203, "mo": 2204, "aime": 2205, "numinamath": 2206, "cot": 2207, "problem": 2208, "solution": 2209, "32000": 2210, "zeta_prompt": 2211, "task": 2212, "analyze": 2213, "rewrite": 2214, "excerpt": 2215, "provides": 2216, "suggesting": 2217, "cursor": 2218, "_format_zeta_prompt": 2219, "original_start_marker": 2220, "editable_region_start": 2221, "zeta": 2222, "prediction": 2223, "nep": 2224, "formats": 2225, "expected": 2226, "further": 2227, "extended": 2228, "events": 2229, "inputs": 2230, "marker": 2231, "indicating": 2232, "region": 2233, "formatted": 2234, "focused": 2235, "output_start_index": 2236, "output_focused_region": 2237, "expected_output": 2238, "nexteditpredictiondataset": 2239, "zed": 2240, "industries": 2241, "mapping_prompt_funcs": 2242, "formatting_prompt_func": 2243, "asrdataset": 2244, "asr": 2245, "transcription": 2246, "tested": 2247, "domain": 2248, "speaking": 2249, "style": 2250, "hf": 2251, "subset": 2252, "ted": 2253, "lium": 2254, "oratory": 2255, "release1": 2256, "release2": 2257, "release3": 2258, "speaker": 2259, "adaptation": 2260, "voxpopuli": 2261, "european": 2262, "parliament": 2263, "de": 2264, "fr": 2265, "librispeech": 2266, "audiobook": 2267, "narrated": 2268, "tedlium": 2269, "gigaspeech": 2270, "podcast": 2271, "spontaneous": 2272, "xs": 2273, "xl": 2274, "spgispeech": 2275, "financial": 2276, "meetings": 2277, "ami": 2278, "ihm": 2279, "sdm": 2280, "openslr": 2281, "librispeech_asr": 2282, "facebook": 2283, "edinburghcstr": 2284, "speechcolab": 2285, "kensho": 2286, "whisper": 2287, "interface": 2288, "transcription_preamble": 2289, "startoftranscript": 2290, "transcribe": 2291, "notimestamps": 2292, "skip_long_audios": 2293, "librosa": 2294, "skipped": 2295, "sr": 2296, "array": 2297, "sampling_rate": 2298, "duration_s": 2299, "get_duration": 2300, "duration": 2301, "discarded": 2302, "due": 2303, "greater": 2304, "argparse": 2305, "get_random_flag": 2306, "filtered_dataset": 2307, "prune": 2308, "priority": 2309, "run_vllm": 2310, "llm_engine": 2311, "model_config": 2312, "max_model_len": 2313, "_priority": 2314, "top_p": 2315, "perf_counter": 2316, "use_tqdm": 2317, "namespace": 2318, "synthesize": 2319, "given": 2320, "hi": 2321, "backend": 2322, "elapsed_time": 2323, "total_num_tokens": 2324, "2f": 2325, "output_json": 2326, "requests_per_second": 2327, "tokens_per_second": 2328, "dump": 2329, "indent": 2330, "overrides": 2331, "per": 2332, "gc": 2333, "warnings": 2334, "iterable": 2335, "datetime": 2336, "literal": 2337, "typing_extensions": 2338, "deprecated": 2339, "backend_request_func": 2340, "benchmark_dataset": 2341, "benchmark_utils": 2342, "convert_to_pytorch_benchmark_format": 2343, "write_to_json": 2344, "get_request": 2345, "milliseconds_to_seconds_conversion": 2346, "1000": 2347, "benchmarkmetrics": 2348, "completed": 2349, "total_input": 2350, "total_output": 2351, "request_throughput": 2352, "request_goodput": 2353, "output_throughput": 2354, "total_token_throughput": 2355, "mean_ttft_ms": 2356, "median_ttft_ms": 2357, "std_ttft_ms": 2358, "percentiles_ttft_ms": 2359, "mean_tpot_ms": 2360, "median_tpot_ms": 2361, "std_tpot_ms": 2362, "percentiles_tpot_ms": 2363, "mean_itl_ms": 2364, "median_itl_ms": 2365, "std_itl_ms": 2366, "percentiles_itl_ms": 2367, "e2el": 2368, "stands": 2369, "taken": 2370, "client": 2371, "sending": 2372, "mean_e2el_ms": 2373, "median_e2el_ms": 2374, "std_e2el_ms": 2375, "percentiles_e2el_ms": 2376, "calculate_metrics": 2377, "input_requests": 2378, "dur_s": 2379, "selected_percentile_metrics": 2380, "selected_percentiles": 2381, "goodput_config_dict": 2382, "actual_output_lens": 2383, "good_completed": 2384, "itls": 2385, "tpots": 2386, "all_tpots": 2387, "ttfts": 2388, "e2els": 2389, "backends": 2390, "instead": 2391, "looking": 2392, "bundled": 2393, "together": 2394, "inflate": 2395, "slightly": 2396, "latency_minus_ttft": 2397, "regard": 2398, "goodput": 2399, "valid_metrics": 2400, "slo_values": 2401, "req_metric": 2402, "zip": 2403, "is_good_req": 2404, "warn": 2405, "likely": 2406, "misconfiguration": 2407, "arguments": 2408, "stacklevel": 2409, "metrics": 2410, "mean": 2411, "std": 2412, "median": 2413, "percentile": 2414, "check_goodput_args": 2415, "valid_names": 2416, "parse_goodput": 2417, "slo_name": 2418, "slo_val": 2419, "metric": 2420, "found": 2421, "objective": 2422, "one": 2423, "negative": 2424, "slo_pairs": 2425, "slo_pair": 2426, "argumenttypeerror": 2427, "objectives": 2428, "specify": 2429, "pairs": 2430, "milliseconds": 2431, "save_to_pytorch_benchmark_format": 2432, "file_name": 2433, "p99_ttft_ms": 2434, "p99_tpot_ms": 2435, "p99_itl_ms": 2436, "useful": 2437, "rather": 2438, "big": 2439, "later": 2440, "ignored_metrics": 2441, "generated_texts": 2442, "pt_records": 2443, "extra_info": 2444, "don": 2445, "suffix": 2446, "up": 2447, "pt_file": 2448, "splitext": 2449, "served_model_name": 2450, "tokenizer_id": 2451, "ramp": 2452, "ramp_up_strategy": 2453, "request_rate": 2454, "inf": 2455, "rate": 2456, "controlled": 2457, "argument": 2458, "ramp_up_start_rps": 2459, "ramp_up_end_rps": 2460, "strategy": 2461, "rps": 2462, "exponential": 2463, "base_url": 2464, "endpoint": 2465, "host": 2466, "port": 2467, "dataset_name": 2468, "custom_output_len": 2469, "custom_skip_chat_template": 2470, "formatting": 2471, "depends": 2472, "sonnet_input_len": 2473, "sonnet_output_len": 2474, "sonnet_prefix_len": 2475, "chat_template": 2476, "default_chat_template": 2477, "dataset_class": 2478, "hf_split": 2479, "train": 2480, "hf_subset": 2481, "dataset_": 2482, "_class": 2483, "supported_datasets": 2484, "cls": 2485, "__subclasses__": 2486, "consider": 2487, "tokeni": 2488, "izer": 2489, "hf_output_len": 2490, "structure": 2491, "dataset_mapping": 2492, "sharegpt_output_len": 2493, "random_prefix_len": 2494, "random_input_len": 2495, "random_output_len": 2496, "keyerror": 2497, "collect": 2498, "top_k": 2499, "min_p": 2500, "greedy": 2501, "arg": 2502, "gs": 2503, "cache_prompt": 2504, "static": 2505, "pause": 2506, "freeze": 2507, "benchmark_result": 2508, "burstiness": 2509, "disable_tqdm": 2510, "profile": 2511, "percentile_metrics": 2512, "metric_percentiles": 2513, "max_concurrency": 2514, "lora_modules": 2515, "config": 2516, "save_result": 2517, "append_result": 2518, "result_json": 2519, "current_dt": 2520, "strftime": 2521, "metadata": 2522, "kvstring": 2523, "val": 2524, "lueerror": 2525, "traffic": 2526, "result": 2527, "save_detailed": 2528, "fields": 2529, "points": 2530, "del": 2531, "base_model_id": 2532, "max_concurrency_str": 2533, "concurrency": 2534, "qps": 2535, "result_filename": 2536, "result_dir": 2537, "outfile": 2538, "newline": 2539, "tell": 2540, "keys": 2541, "127": 2542, "localhost": 2543, "ipv4": 2544, "8000": 2545, "stream": 2546, "concurrent": 2547, "simulate": 2548, "controls": 2549, "initiated": 2550, "means": 2551, "combination": 2552, "enough": 2553, "part": 2554, "unspecified": 2555, "disabled": 2556, "dummy": 2557, "logprob": 2558, "returned": 2559, "sent": 2560, "poisson": 2561, "gamma": 2562, "distribution": 2563, "arrival": 2564, "factor": 2565, "effect": 2566, "follows": 2567, "intervals": 2568, "bursty": 2569, "uniform": 2570, "progress": 2571, "bar": 2572, "profiler": 2573, "launched": 2574, "vllm_torch_profiler_dir": 2575, "detailed": 2576, "saving": 2577, "whether": 2578, "ttfs": 2579, "etc": 2580, "metavar": 2581, "nargs": 2582, "tp": 2583, "saved": 2584, "record": 2585, "keeping": 2586, "purposes": 2587, "dir": 2588, "ignore": 2589, "eos": 2590, "flag": 2591, "deepspeed_mii": 2592, "comma": 2593, "separated": 2594, "percentils": 2595, "percentiles": 2596, "names": 2597, "99": 2598, "25": 2599, "th": 2600, "50": 2601, "75": 2602, "definition": 2603, "distserve": 2604, "pdf": 2605, "2401": 2606, "09670": 2607, "blogs": 2608, "custom_group": 2609, "add_argument_group": 2610, "options": 2611, "applying": 2612, "sonnet_group": 2613, "sharegpt_group": 2614, "random_group": 2615, "ratio": 2616, "define": 2617, "symmetric": 2618, "fixed": 2619, "ed": 2620, "hf_group": 2621, "sampling_group": 2622, "top": 2623, "parameter": 2624, "always": 2625, "mistral_common": 2626, "preregistered": 2627, "served": 2628, "passed": 2629, "launching": 2630, "script": 2631, "chooses": 2632, "linear": 2633, "initial": 2634, "over": 2635, "starting": 2636, "needs": 2637, "ending": 2638, "math": 2639, "tracebacktype": 2640, "oss": 2641, "integrate": 2642, "database": 2643, "records": 2644, "benchmark_values": 2645, "vars": 2646, "tensor_parallel_size": 2647, "infencoder": 2648, "jsonencoder": 2649, "clear_inf": 2650, "isinf": 2651, "iterencode": 2652, "serializable": 2653, "timecollector": 2654, "ns": 2655, "ms": 2656, "cnt": 2657, "_sum": 2658, "_max": 2659, "monotonic_ns": 2660, "dump_avg_max": 2661, "__enter__": 2662, "__exit__": 2663, "exc_type": 2664, "baseexception": 2665, "exc_value": 2666, "exc_traceback": 2667, "prompttype": 2668, "beamsearchparams": 2669, "avg_latency": 2670, "processed": 2671, "batch": 2672, "automatically": 2673, "batches": 2674, "dummy_prompt_token_ids": 2675, "10000": 2676, "batch_size": 2677, "dummy_prompts": 2678, "llm_generate": 2679, "use_beam_search": 2680, "beam_search": 2681, "beam_width": 2682, "run_to_completion": 2683, "profile_dir": 2684, "start_profile": 2685, "stop_profile": 2686, "warming": 2687, "num_iters_warmup": 2688, "desc": 2689, "warmup": 2690, "iterations": 2691, "vllm_torc": 2692, "ch_profiler_dir": 2693, "profiling": 2694, "num_iters": 2695, "percentages": 2696, "90": 2697, "seconds": 2698, "percentage": 2699, "till": 2700, "32": 2701, "iters": 2702, "skews": 2703, "numbers": 2704, "set_defaults": 2705, "enable_prefix_caching": 2706, "uuid": 2707, "asyncgenerator": 2708, "structured_output": 2709, "backend_xgrammar": 2710, "has_xgrammar_unsupported_json_features": 2711, "attributes": 2712, "schema": 2713, "structure_type": 2714, "unique": 2715, "json_schema_path": 2716, "dir_path": 2717, "realpath": 2718, "structured_schemas": 2719, "structured_schema_1": 2720, "json_schemas": 2721, "deepcopy": 2722, "properties": 2723, "__optional_field_": 2724, "uuid4": 2725, "schemas": 2726, "gen_prompt": 2727, "brief": 2728, "dumps": 2729, "get_schema": 2730, "grammar": 2731, "select_statement": 2732, "condition": 2733, "col_1": 2734, "col_2": 2735, "table_1": 2736, "table_2": 2737, "sql": 2738, "query": 2739, "username": 2740, "regex": 2741, "alan": 2742, "turing": 2743, "works": 2744, "enigma": 2745, "choice": 2746, "classify": 2747, "sentiment": 2748, "wonderful": 2749, "aset": 2750, "xgrammar_bench": 2751, "nousresearch": 2752, "eval": 2753, "full_dataset_len": 2754, "_filter_func": 2755, "num_filtered_out": 2756, "len_dataset": 2757, "data_point_idx": 2758, "idx": 2759, 