{"vllm": 0, "code": 1, "conduct": 2, "our": 3, "pledge": 4, "we": 5, "members": 6, "contributors": 7, "leaders": 8, "make": 9, "participation": 10, "community": 11, "harassment": 12, "free": 13, "experience": 14, "everyone": 15, "regardless": 16, "age": 17, "body": 18, "size": 19, "visible": 20, "invisible": 21, "disability": 22, "ethnicity": 23, "sex": 24, "characteristics": 25, "gender": 26, "identity": 27, "expression": 28, "level": 29, "education": 30, "socioeconomic": 31, "status": 32, "nationality": 33, "personal": 34, "appearance": 35, "race": 36, "caste": 37, "color": 38, "religion": 39, "sexual": 40, "orientation": 41, "act": 42, "interact": 43, "ways": 44, "contribute": 45, "open": 46, "welcoming": 47, "diverse": 48, "inclusive": 49, "healthy": 50, "standards": 51, "examples": 52, "behavior": 53, "contributes": 54, "positive": 55, "environment": 56, "include": 57, "demonstrating": 58, "empathy": 59, "kindness": 60, "toward": 61, "other": 62, "people": 63, "being": 64, "respectful": 65, "differing": 66, "opinions": 67, "viewpoints": 68, "experiences": 69, "giving": 70, "gracefully": 71, "accepting": 72, "constructive": 73, "feedback": 74, "responsibility": 75, "apologizing": 76, "those": 77, "affected": 78, "mistakes": 79, "learning": 80, "from": 81, "focusing": 82, "what": 83, "best": 84, "just": 85, "us": 86, "individuals": 87, "overall": 88, "unacceptable": 89, "use": 90, "sexualized": 91, "language": 92, "imagery": 93, "attention": 94, "advances": 95, "any": 96, "kind": 97, "trolling": 98, "insulting": 99, "derogatory": 100, "comments": 101, "political": 102, "attacks": 103, "public": 104, "private": 105, "publishing": 106, "others": 107, "information": 108, "physical": 109, "email": 110, "address": 111, "without": 112, "explicit": 113, "permission": 114, "which": 115, "could": 116, "reasonably": 117, "considered": 118, "inappropriate": 119, "professional": 120, "setting": 121, "enforcement": 122, "responsibilities": 123, "responsible": 124, "clarifying": 125, "enforcing": 126, "acceptable": 127, "take": 128, "appropriate": 129, "fair": 130, "corrective": 131, "action": 132, "response": 133, "deem": 134, "threatening": 135, "offensive": 136, "harmful": 137, "have": 138, "right": 139, "remove": 140, "edit": 141, "reject": 142, "commits": 143, "wiki": 144, "edits": 145, "issues": 146, "contributions": 147, "aligned": 148, "communicate": 149, "reasons": 150, "moderation": 151, "decisions": 152, "when": 153, "scope": 154, "applies": 155, "within": 156, "all": 157, "spaces": 158, "also": 159, "individual": 160, "officially": 161, "representing": 162, "using": 163, "official": 164, "posting": 165, "via": 166, "social": 167, "media": 168, "account": 169, "acting": 170, "appointed": 171, "representative": 172, "online": 173, "offline": 174, "irl": 175, "event": 176, "instances": 177, "abusive": 178, "harassing": 179, "otherwise": 180, "may": 181, "reported": 182, "channel": 183, "slack": 184, "https": 185, "ai": 186, "complaints": 187, "reviewed": 188, "investigated": 189, "promptly": 190, "fairly": 191, "obligated": 192, "respect": 193, "privacy": 194, "security": 195, "reporter": 196, "incident": 197, "guidelines": 198, "follow": 199, "impact": 200, "determining": 201, "consequences": 202, "violation": 203, "correction": 204, "deemed": 205, "unprofessional": 206, "unwelcome": 207, "consequence": 208, "written": 209, "warning": 210, "providing": 211, "clarity": 212, "around": 213, "nature": 214, "explanation": 215, "why": 216, "apology": 217, "requested": 218, "through": 219, "single": 220, "series": 221, "actions": 222, "continued": 223, "interaction": 224, "involved": 225, "including": 226, "unsolicited": 227, "specified": 228, "period": 229, "time": 230, "includes": 231, "avoiding": 232, "interactions": 233, "well": 234, "external": 235, "channels": 236, "like": 237, "violating": 238, "terms": 239, "lead": 240, "temporary": 241, "permanent": 242, "ban": 243, "serious": 244, "sustained": 245, "sort": 246, "communication": 247, "allowed": 248, "during": 249, "pattern": 250, "aggression": 251, "disparagement": 252, "classes": 253, "attribution": 254, "adapted": 255, "contributor": 256, "covenant": 257, "www": 258, "org": 259, "version": 260, "available": 261, "v2": 262, "code_of_conduct": 263, "html": 264, "were": 265, "inspired": 266, "mozilla": 267, "ladder": 268, "github": 269, "com": 270, "inclusion": 271, "answers": 272, "common": 273, "questions": 274, "about": 275, "see": 276, "faq": 277, "translations": 278, "contributing": 279, "you": 280, "find": 281, "docs": 282, "en": 283, "latest": 284, "markdownlint": 285, "disable": 286, "md001": 287, "md041": 288, "align": 289, "center": 290, "picture": 291, "source": 292, "prefers": 293, "scheme": 294, "dark": 295, "srcset": 296, "raw": 297, "githubusercontent": 298, "project": 299, "main": 300, "assets": 301, "logos": 302, "logo": 303, "text": 304, "png": 305, "img": 306, "alt": 307, "src": 308, "light": 309, "width": 310, "55": 311, "h3": 312, "easy": 313, "fast": 314, "cheap": 315, "llm": 316, "serving": 317, "href": 318, "documentation": 319, "blog": 320, "arxiv": 321, "abs": 322, "2309": 323, "06180": 324, "paper": 325, "vllm_project": 326, "twitter": 327, "discuss": 328, "user": 329, "forum": 330, "developer": 331, "news": 332, "2025": 333, "08": 334, "hosted": 335, "beijing": 336, "meetup": 337, "mp": 338, "weixin": 339, "qq": 340, "dgkwg1wfpwgo2jcdtqqhxa": 341, "large": 342, "scale": 343, "deployment": 344, "please": 345, "slides": 346, "here": 347, "drive": 348, "google": 349, "folders": 350, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 351, "recording": 352, "chaspark": 353, "live": 354, "1166916873711665152": 355, "05": 356, "nyc": 357, "lu": 358, "ma": 359, "c1rqyf1f": 360, "presentation": 361, "1_q_aw_iomjwuimf1s1ym": 362, "zhjxz8cuel0ijvaquoybea": 363, "usp": 364, "sharing": 365, "now": 366, "under": 367, "pytorch": 368, "foundation": 369, "announcement": 370, "welcomes": 371, "01": 372, "excited": 373, "announce": 374, "alpha": 375, "release": 376, "v1": 377, "major": 378, "architectural": 379, "upgrade": 380, "7x": 381, "speedup": 382, "clean": 383, "optimized": 384, "execution": 385, "loop": 386, "zero": 387, "overhead": 388, "prefix": 389, "caching": 390, "enhanced": 391, "multimodal": 392, "support": 393, "more": 394, "check": 395, "out": 396, "post": 397, "27": 398, "details": 399, "summary": 400, "previous": 401, "04": 402, "asia": 403, "day": 404, "sginnovate": 405, "limited": 406, "availability": 407, "morning": 408, "evening": 409, "slots": 410, "remaining": 411, "inaugural": 412, "team": 413, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 414, "03": 415, "ollama": 416, "inference": 417, "night": 418, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 419, "first": 420, "china": 421, "n77gibl2coratqhtveazfg": 422, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 423, "east": 424, "coast": 425, "7mu4k4xx": 426, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 427, "slide": 428, "id": 429, "g31441846c39_0_0": 430, "02": 431, "ninth": 432, "h7g3kuj9": 433, "meta": 434, "1jzc_pzvxrvnsfvcw": 435, "v4cfxb6pn7zz2cyp_flwo05aqg": 436, "amd": 437, "file": 438, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 439, "view": 440, "posted": 441, "eighth": 442, "zep56hui": 443, "cloud": 444, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 445, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 446, "2024": 447, "12": 448, "joins": 449, "ecosystem": 450, "11": 451, "seventh": 452, "h0qvrajz": 453, "snowflake": 454, "1e3cxqbv3jsfgp30swyvs3em_tw": 455, "ghohj9pajgk6kr54": 456, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 457, "10": 458, "created": 459, "coordinating": 460, "discussing": 461, "features": 462, "feel": 463, "join": 464, "ray": 465, "summit": 466, "held": 467, "special": 468, "track": 469, "opening": 470, "talk": 471, "1b_kqxphbtra_mdf": 472, "tr6i8rwdou5qotznceg2mkzxehm": 473, "learn": 474, "talks": 475, "youtube": 476, "playlist": 477, "list": 478, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 479, "users": 480, "09": 481, "sixth": 482, "87q3nvnh": 483, "nvidia": 484, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 485, "9wqyp7ny93xrs": 486, "07": 487, "fifth": 488, "lp0gyjqr": 489, "aws": 490, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 491, "partnership": 492, "supports": 493, "llama": 494, "fp8": 495, "quantization": 496, "pipeline": 497, "parallelism": 498, "23": 499, "llama31": 500, "06": 501, "fourth": 502, "agivllm": 503, "cloudflare": 504, "bentoml": 505, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 506, "third": 507, "robloxandvllmmeetup2024": 508, "splashthat": 509, "roblox": 510, "1a": 511, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 512, "second": 513, "ygxbpzhl": 514, "ibm": 515, "12mi2skabnuw5rbwxdyy": 516, "hthth4imsnceoq10jdqbxga": 517, "2023": 518, "a16z": 519, "1ql": 520, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 521, "would": 522, "express": 523, "sincere": 524, "gratitude": 525, "andreessen": 526, "horowitz": 527, "30": 528, "supporting": 529, "generous": 530, "grant": 531, "development": 532, "research": 533, "released": 534, "fastchat": 535, "integration": 536, "has": 537, "powered": 538, "lmsys": 539, "vicuna": 540, "chatbot": 541, "arena": 542, "chat": 543, "since": 544, "mid": 545, "april": 546, "library": 547, "originally": 548, "developed": 549, "sky": 550, "computing": 551, "lab": 552, "cs": 553, "berkeley": 554, "edu": 555, "uc": 556, "evolved": 557, "driven": 558, "both": 559, "academia": 560, "industry": 561, "state": 562, "art": 563, "throughput": 564, "efficient": 565, "management": 566, "key": 567, "value": 568, "memory": 569, "pagedattention": 570, "20": 571, "continuous": 572, "batching": 573, "incoming": 574, "requests": 575, "model": 576, "cuda": 577, "hip": 578, "graph": 579, "quantizations": 580, "gptq": 581, "2210": 582, "17323": 583, "awq": 584, "2306": 585, "00978": 586, "autoround": 587, "05516": 588, "int4": 589, "int8": 590, "kernels": 591, "flashattention": 592, "flashinfer": 593, "speculative": 594, "decoding": 595, "chunked": 596, "prefill": 597, "flexible": 598, "seamless": 599, "popular": 600, "hugging": 601, "face": 602, "models": 603, "high": 604, "various": 605, "algorithms": 606, "parallel": 607, "sampling": 608, "beam": 609, "search": 610, "tensor": 611, "data": 612, "expert": 613, "distributed": 614, "streaming": 615, "outputs": 616, "openai": 617, "compatible": 618, "api": 619, "server": 620, "gpus": 621, "cpus": 622, "intel": 623, "powerpc": 624, "tpu": 625, "neuron": 626, "multi": 627, "lora": 628, "seamlessly": 629, "most": 630, "huggingface": 631, "transformer": 632, "llms": 633, "mixture": 634, "mixtral": 635, "deepseek": 636, "v3": 637, "embedding": 638, "e5": 639, "mistral": 640, "modal": 641, "llava": 642, "full": 643, "supported": 644, "supported_models": 645, "getting": 646, "started": 647, "install": 648, "pip": 649, "getting_started": 650, "installation": 651, "gpu": 652, "index": 653, "build": 654, "wheel": 655, "bash": 656, "visit": 657, "quickstart": 658, "welcome": 659, "collaborations": 660, "how": 661, "get": 662, "sponsors": 663, "compute": 664, "resources": 665, "testing": 666, "following": 667, "organizations": 668, "thank": 669, "your": 670, "note": 671, "them": 672, "alphabetical": 673, "order": 674, "keep": 675, "consistent": 676, "md": 677, "cash": 678, "donations": 679, "dropbox": 680, "sequoia": 681, "capital": 682, "skywork": 683, "zhenfund": 684, "alibaba": 685, "anyscale": 686, "crusoe": 687, "databricks": 688, "deepinfra": 689, "lambda": 690, "nebius": 691, "novita": 692, "replicate": 693, "runpod": 694, "trainy": 695, "san": 696, "diego": 697, "sponsor": 698, "fundraising": 699, "venue": 700, "opencollective": 701, "plan": 702, "fund": 703, "maintenance": 704, "adoption": 705, "citation": 706, "cite": 707, "bibtex": 708, "inproceedings": 709, "kwon2023efficient": 710, "title": 711, "author": 712, "woosuk": 713, "kwon": 714, "zhuohan": 715, "li": 716, "siyuan": 717, "zhuang": 718, "ying": 719, "sheng": 720, "lianmin": 721, "zheng": 722, "cody": 723, "hao": 724, "yu": 725, "joseph": 726, "gonzalez": 727, "zhang": 728, "ion": 729, "stoica": 730, "booktitle": 731, "proceedings": 732, "acm": 733, "sigops": 734, "29th": 735, "symposium": 736, "operating": 737, "systems": 738, "principles": 739, "year": 740, "contact": 741, "start": 742, "technical": 743, "feature": 744, "fellow": 745, "disclosures": 746, "advisories": 747, "partnerships": 748, "lists": 749, "mailto": 750, "end": 751, "kit": 752, "wish": 753, "refer": 754, "repo": 755, "releasing": 756, "releases": 757, "offer": 758, "reliable": 759, "base": 760, "packaged": 761, "binary": 762, "format": 763, "can": 764, "conveniently": 765, "accessed": 766, "pypi": 767, "serve": 768, "milestones": 769, "newly": 770, "improvements": 771, "upcoming": 772, "changes": 773, "affect": 774, "potential": 775, "breaking": 776, "versioning": 777, "uses": 778, "shifted": 779, "where": 780, "new": 781, "patch": 782, "every": 783, "weeks": 784, "contain": 785, "bug": 786, "fixes": 787, "opposed": 788, "semver": 789, "contains": 790, "only": 791, "backwards": 792, "critical": 793, "need": 794, "made": 795, "post1": 796, "_major_": 797, "milestone": 798, "incompatible": 799, "similar": 800, "_minor_": 801, "_patch_": 802, "_post1_": 803, "_patch": 804, "1_": 805, "either": 806, "implicit": 807, "cadence": 808, "bi": 809, "weekly": 810, "basis": 811, "days": 812, "after": 813, "same": 814, "branch": 815, "future": 816, "dates": 817, "below": 818, "tentative": 819, "optional": 820, "date": 821, "versions": 822, "jan": 823, "feb": 824, "mar": 825, "apr": 826, "jun": 827, "jul": 828, "13": 829, "aug": 830, "14": 831, "15": 832, "sep": 833, "16": 834, "17": 835, "oct": 836, "18": 837, "19": 838, "nov": 839, "21": 840, "dec": 841, "22": 842, "each": 843, "built": 844, "dedicated": 845, "cut": 846, "performed": 847, "before": 848, "previously": 849, "reused": 850, "builds": 851, "triggered": 852, "push": 853, "rc": 854, "tag": 855, "vx": 856, "rc1": 857, "enables": 858, "test": 859, "multiple": 860, "rcs": 861, "final": 862, "does": 863, "trigger": 864, "used": 865, "notes": 866, "monitor": 867, "reverts": 868, "apply": 869, "cherry": 870, "pick": 871, "criteria": 872, "approach": 873, "finalizing": 874, "clear": 875, "picks": 876, "process": 877, "land": 878, "pr": 879, "typically": 880, "ensure": 881, "sufficient": 882, "complete": 883, "thorough": 884, "round": 885, "stable": 886, "regression": 887, "functional": 888, "performance": 889, "against": 890, "recent": 891, "severe": 892, "issue": 893, "silent": 894, "incorrectness": 895, "compatibility": 896, "crashes": 897, "deadlocks": 898, "leaks": 899, "introduced": 900, "specific": 901, "change": 902, "identifiers": 903, "ci": 904, "work": 905, "prs": 906, "merged": 907, "trunk": 908, "exception": 909, "manual": 910, "validations": 911, "e2e": 912, "validation": 913, "perform": 914, "regressions": 915, "benchmark": 916, "workflow": 917, "workflows": 918, "yml": 919, "current": 920, "coverage": 921, "llama3": 922, "llama4": 923, "hardware": 924, "h100": 925, "mi300x": 926, "_note": 927, "based": 928, "availability_": 929, "step": 930, "access": 931, "request": 932, "write": 933, "repository": 934, "run": 935, "review": 936, "setup": 937, "familiarize": 938, "yourself": 939, "configurations": 940, "tree": 941, "benchmarks": 942, "rocm": 943, "navigate": 944, "configure": 945, "set": 946, "v0": 947, "commit": 948, "hash": 949, "results": 950, "once": 951, "completes": 952, "dashboard": 953, "hud": 954, "reponame": 955, "2fvllm": 956, "corresponding": 957, "comparison": 958, "compare": 959, "verify": 960, "occurred": 961, "example": 962, "vs": 963, "starttime": 964, "thu": 965, "2c": 966, "2017": 967, "20apr": 968, "202025": 969, "2021": 970, "3a43": 971, "3a50": 972, "20gmt": 973, "stoptime": 974, "wed": 975, "2016": 976, "20jul": 977, "granularity": 978, "week": 979, "lbranch": 980, "lcommit": 981, "b6553be1bc75f046b00046a4ad7576364d03c835": 982, "rbranch": 983, "rcommit": 984, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 985, "benchmarkname": 986, "modelname": 987, "20models": 988, "backendname": 989, "20backends": 990, "modename": 991, "20modes": 992, "dtypename": 993, "20dtype": 994, "devicename": 995, "20devices": 996, "archname": 997, "20platforms": 998, "policy": 999, "reporting": 1000, "report": 1001, "privately": 1002, "vulnerability": 1003, "submission": 1004, "form": 1005, "triage": 1006, "reports": 1007, "triaged": 1008, "vulnerability_management": 1009, "threat": 1010, "guide": 1011, "usage": 1012, "assumptions": 1013, "recommendations": 1014, "blob": 1015, "securely": 1016, "severity": 1017, "determine": 1018, "risk": 1019, "taking": 1020, "dealing": 1021, "past": 1022, "defaults": 1023, "cases": 1024, "categories": 1025, "vulnerabilities": 1026, "allow": 1027, "remote": 1028, "attackers": 1029, "execute": 1030, "arbitrary": 1031, "control": 1032, "system": 1033, "significantly": 1034, "compromise": 1035, "confidentiality": 1036, "integrity": 1037, "privileges": 1038, "needed": 1039, "network": 1040, "deserialization": 1041, "exploit": 1042, "chains": 1043, "generally": 1044, "rated": 1045, "cvss": 1046, "flaws": 1047, "elevated": 1048, "rce": 1049, "contexts": 1050, "significant": 1051, "loss": 1052, "require": 1053, "advanced": 1054, "conditions": 1055, "some": 1056, "trust": 1057, "modes": 1058, "node": 1059, "privileged": 1060, "required": 1061, "scores": 1062, "between": 1063, "moderate": 1064, "cause": 1065, "denial": 1066, "service": 1067, "partial": 1068, "disruption": 1069, "do": 1070, "breach": 1071, "rating": 1072, "low": 1073, "minor": 1074, "informational": 1075, "logging": 1076, "errors": 1077, "non": 1078, "exploitable": 1079, "weaknesses": 1080, "local": 1081, "privilege": 1082, "negligible": 1083, "side": 1084, "collisions": 1085, "often": 1086, "less": 1087, "than": 1088, "prenotification": 1089, "certain": 1090, "prenotify": 1091, "vendors": 1092, "ship": 1093, "purpose": 1094, "coordinated": 1095, "notification": 1096, "adding": 1097, "contacts": 1098, "advisory": 1099, "few": 1100, "added": 1101, "group": 1102, "send": 1103, "copying": 1104, "vendor": 1105, "analyzed": 1106, "case": 1107, "withdraw": 1108, "receiving": 1109, "prenotifications": 1110, "membership": 1111, "refinements": 1112, "who": 1113, "included": 1114, "spdx": 1115, "license": 1116, "identifier": 1117, "apache": 1118, "filecopyrighttext": 1119, "copyright": 1120, "import": 1121, "importlib": 1122, "traceback": 1123, "typing": 1124, "callable": 1125, "unittest": 1126, "mock": 1127, "def": 1128, "find_cuda_init": 1129, "fn": 1130, "object": 1131, "none": 1132, "helper": 1133, "function": 1134, "debug": 1135, "re": 1136, "initialization": 1137, "initializes": 1138, "prints": 1139, "stack": 1140, "trace": 1141, "happens": 1142, "torch": 1143, "_lazy_init": 1144, "wrapper": 1145, "nonlocal": 1146, "extract_stack": 1147, "return": 1148, "print": 1149, "initialized": 1150, "format_list": 1151, "strip": 1152, "__name__": 1153, "__main__": 1154, "import_module": 1155, "model_executor": 1156, "ctypes": 1157, "util": 1158, "json": 1159, "os": 1160, "shutil": 1161, "subprocess": 1162, "sys": 1163, "pathlib": 1164, "path": 1165, "packaging": 1166, "parse": 1167, "setuptools": 1168, "extension": 1169, "command": 1170, "build_ext": 1171, "setuptools_scm": 1172, "get_version": 1173, "utils": 1174, "cpp_extension": 1175, "cuda_home": 1176, "rocm_home": 1177, "load_module_from_path": 1178, "module_name": 1179, "spec": 1180, "spec_from_file_location": 1181, "module": 1182, "module_from_spec": 1183, "modules": 1184, "loader": 1185, "exec_module": 1186, "root_dir": 1187, "__file__": 1188, "parent": 1189, "logger": 1190, "getlogger": 1191, "envs": 1192, "py": 1193, "vllm_target_device": 1194, "main_cuda_version": 1195, "is_sccache_available": 1196, "bool": 1197, "sccache": 1198, "int": 1199, "getenv": 1200, "vllm_disable_sccache": 1201, "is_ccache_available": 1202, "ccache": 1203, "is_ninja_available": 1204, "ninja": 1205, "is_url_available": 1206, "url": 1207, "str": 1208, "urllib": 1209, "urlopen": 1210, "try": 1211, "except": 1212, "false": 1213, "200": 1214, "class": 1215, "cmakeextension": 1216, "__init__": 1217, "self": 1218, "name": 1219, "cmake_lists_dir": 1220, "kwa": 1221, "super": 1222, "sources": 1223, "py_limited_api": 1224, "true": 1225, "abspath": 1226, "cmake_build_ext": 1227, "dict": 1228, "directories": 1229, "been": 1230, "configured": 1231, "did_config": 1232, "number": 1233, "compilation": 1234, "jobs": 1235, "optionally": 1236, "nvcc": 1237, "compile": 1238, "threads": 1239, "compute_num_jobs": 1240, "num_jobs": 1241, "max_jobs": 1242, "variable": 1243, "defined": 1244, "info": 1245, "else": 1246, "sched_getaffinity": 1247, "isn": 1248, "universally": 1249, "so": 1250, "fall": 1251, "back": 1252, "cpu_count": 1253, "error": 1254, "len": 1255, "attributeerror": 1256, "nvcc_threads": 1257, "_is_cuda": 1258, "get_nvcc_cuda_version": 1259, "reduce": 1260, "avoid": 1261, "overloading": 1262, "max": 1263, "cmake": 1264, "configuration": 1265, "ext": 1266, "ve": 1267, "already": 1268, "cmakelists": 1269, "txt": 1270, "exit": 1271, "early": 1272, "select": 1273, "type": 1274, "optimization": 1275, "default_cfg": 1276, "relwithdebinfo": 1277, "cfg": 1278, "cmake_build_type": 1279, "cmake_args": 1280, "dcmake_build_type": 1281, "dvllm_target_device": 1282, "verbose": 1283, "dcmake_verbose_makefile": 1284, "dcmake_c_compiler_launcher": 1285, "dcmake_cxx_compiler_launcher": 1286, "dcmake_cuda_compiler_launcher": 1287, "dcmake_hip_compiler_launcher": 1288, "elif": 1289, "pass": 1290, "python": 1291, "executable": 1292, "exact": 1293, "match": 1294, "dvllm_python_executable": 1295, "reuse": 1296, "dependencies": 1297, "subsequent": 1298, "calls": 1299, "dvllm_python_path": 1300, "override": 1301, "directory": 1302, "fetchcontent": 1303, "downloads": 1304, "root": 1305, "deps": 1306, "allows": 1307, "profiles": 1308, "plays": 1309, "nicely": 1310, "fetchcontent_base_dir": 1311, "fc_base_dir": 1312, "environ": 1313, "dfetchcontent_base_dir": 1314, "tool": 1315, "num_jo": 1316, "obs": 1317, "dnvcc_threads": 1318, "build_tool": 1319, "dcmake_job_pool_compile": 1320, "string": 1321, "dcmake_job_pools": 1322, "default": 1323, "whatever": 1324, "sure": 1325, "dcmake_cuda_compiler": 1326, "bin": 1327, "check_call": 1328, "cwd": 1329, "build_temp": 1330, "build_extensions": 1331, "present": 1332, "working": 1333, "check_output": 1334, "oserror": 1335, "raise": 1336, "runtimeerror": 1337, "cannot": 1338, "create": 1339, "exist": 1340, "exists": 1341, "makedirs": 1342, "targets": 1343, "target_name": 1344, "removeprefix": 1345, "vllm_flash_attn": 1346, "extensions": 1347, "append": 1348, "build_args": 1349, "target": 1350, "libraries": 1351, "proper": 1352, "location": 1353, "outdir": 1354, "get_ext_fullpath": 1355, "absolute": 1356, "skip": 1357, "direc": 1358, "ctory": 1359, "continue": 1360, "appends": 1361, "range": 1362, "count": 1363, "should": 1364, "actually": 1365, "components": 1366, "install_args": 1367, "component": 1368, "standard": 1369, "copy": 1370, "build_lib": 1371, "editable": 1372, "glob": 1373, "files": 1374, "recursive": 1375, "dst_file": 1376, "split": 1377, "dirname": 1378, "exist_ok": 1379, "copy_file": 1380, "precompiled_build_ext": 1381, "disables": 1382, "building": 1383, "precompiled": 1384, "binaries": 1385, "assert": 1386, "vllm_use_precompiled": 1387, "skipping": 1388, "precompiled_wheel_utils": 1389, "extracts": 1390, "existing": 1391, "staticmethod": 1392, "extract_precompiled_and_patch_package": 1393, "wheel_url_or_path": 1394, "tempfile": 1395, "zipfile": 1396, "temp_dir": 1397, "isfile": 1398, "wheel_filename": 1399, "mkdtemp": 1400, "wheels": 1401, "wheel_path": 1402, "downloading": 1403, "urlretrieve": 1404, "filename": 1405, "package_data_patch": 1406, "files_to_copy": 1407, "_c": 1408, "abi3": 1409, "_moe_c": 1410, "_flashmla_c": 1411, "_vllm_fa2_c": 1412, "_vllm_fa3_c": 1413, "cumem_allocator": 1414, "compiled_regex": 1415, "file_members": 1416, "filter": 1417, "filelist": 1418, "extract": 1419, "target_path": 1420, "target_pa": 1421, "ath": 1422, "wb": 1423, "dst": 1424, "copyfileobj": 1425, "pkg": 1426, "replace": 1427, "setdefault": 1428, "basename": 1429, "finally": 1430, "removing": 1431, "rmtree": 1432, "get_base_commit_in_main_branch": 1433, "force": 1434, "nightly": 1435, "mainly": 1436, "vllm_test_use_precompiled_nightly_wheel": 1437, "upstream": 1438, "resp_json": 1439, "curl": 1440, "repos": 1441, "decode": 1442, "utf": 1443, "upstream_main_commit": 1444, "loads": 1445, "sha": 1446, "docker": 1447, "context": 1448, "git": 1449, "immutable": 1450, "missing": 1451, "vllm_docker_build_context": 1452, "cat": 1453, "calledprocesserror": 1454, "fetch": 1455, "update": 1456, "branches": 1457, "ensures": 1458, "ref": 1459, "its": 1460, "history": 1461, "current_branch": 1462, "show": 1463, "base_commit": 1464, "merge": 1465, "valueerror": 1466, "err": 1467, "failed": 1468, "dev": 1469, "_no_device": 1470, "empty": 1471, "has_cuda": 1472, "_is_neuron": 1473, "_is_tpu": 1474, "_is_hip": 1475, "_is_cpu": 1476, "cpu": 1477, "_is_xpu": 1478, "xpu": 1479, "_build_custom_ops": 1480, "get_rocm_version": 1481, "librocm": 1482, "core": 1483, "d11f5c20d500f729c393680a01fa902ebf92094b": 1484, "rocm_version": 1485, "cpp": 1486, "l21": 1487, "librocm_core_file": 1488, "lib": 1489, "is_file": 1490, "librocm_core": 1491, "cdll": 1492, "vererrors": 1493, "c_uint32": 1494, "get_rocm_core_version": 1495, "getrocmversion": 1496, "restype": 1497, "argtypes": 1498, "pointer": 1499, "byref": 1500, "get_neuronxcc_version": 1501, "sysconfig": 1502, "site_dir": 1503, "get_paths": 1504, "purelib": 1505, "version_file": 1506, "neuronxcc": 1507, "executed": 1508, "successfully": 1509, "fp": 1510, "content": 1511, "read": 1512, "regular": 1513, "__version__": 1514, "output": 1515, "apex": 1516, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 1517, "nvcc_output": 1518, "universal_newlines": 1519, "release_idx": 1520, "nvcc_cuda_version": 1521, "get_gaudi_sw_version": 1522, "returns": 1523, "driver": 1524, "enable": 1525, "console": 1526, "printing": 1527, "hl": 1528, "smi": 1529, "shell": 1530, "capture_output": 1531, "env": 1532, "enable_console": 1533, "returncode": 1534, "stdout": 1535, "get_vllm_version": 1536, "write_to": 1537, "_version": 1538, "might": 1539, "cuda_version": 1540, "cuda_version_str": 1541, "tarball": 1542, "sdist": 1543, "argv": 1544, "cu": 1545, "neuron_version": 1546, "neuron_version_str": 1547, "unknown": 1548, "runtime": 1549, "get_requirements": 1550, "package": 1551, "requirements": 1552, "requirements_dir": 1553, "_read_requirements": 1554, "resolved_requirements": 1555, "line": 1556, "startswith": 1557, "cuda_major": 1558, "cuda_minor": 1559, "modified_requirements": 1560, "req": 1561, "flash": 1562, "attn": 1563, "unsupported": 1564, "platform": 1565, "ext_modules": 1566, "package_data": 1567, "typed": 1568, "layers": 1569, "fused_moe": 1570, "configs": 1571, "requires_files": 1572, "pyproject": 1573, "toml": 1574, "cleaning": 1575, "lines": 1576, "readlines": 1577, "lower": 1578, "removed": 1579, "done": 1580, "__version_tuple__": 1581, "env_override": 1582, "module_attrs": 1583, "asyncengineargs": 1584, "engine": 1585, "arg_utils": 1586, "engineargs": 1587, "asyncllmengine": 1588, "async_llm_engine": 1589, "llmengine": 1590, "llm_engine": 1591, "entrypoints": 1592, "initialize_ray_cluster": 1593, "executor": 1594, "ray_utils": 1595, "prompttype": 1596, "inputs": 1597, "textprompt": 1598, "tokensprompt": 1599, "modelregistry": 1600, "samplingparams": 1601, "sampling_params": 1602, "poolingparams": 1603, "pooling_params": 1604, "classificationoutput": 1605, "classificationrequestoutput": 1606, "completionoutput": 1607, "embeddingoutput": 1608, "embeddingrequestoutput": 1609, "poolingoutput": 1610, "poolingrequestoutput": 1611, "requestoutput": 1612, "scoringoutput": 1613, "scoringrequestoutput": 1614, "__all__": 1615, "contextlib": 1616, "type_checking": 1617, "union": 1618, "init_logger": 1619, "platforms": 1620, "current_platform": 1621, "scalar_type": 1622, "scalartype": 1623, "supports_moe_ops": 1624, "paged_attention_v1": 1625, "query": 1626, "key_cache": 1627, "value_cache": 1628, "num_kv_heads": 1629, "float": 1630, "block_tables": 1631, "seq_lens": 1632, "block_size": 1633, "max_seq_len": 1634, "alibi_slopes": 1635, "kv_cache_dtype": 1636, "k_scale": 1637, "v_scale": 1638, "tp_rank": 1639, "blocksparse_local_blocks": 1640, "blocksparse_vert_stride": 1641, "blocksparse_block_size": 1642, "64": 1643, "blocksparse_head_sliding_step": 1644, "ops": 1645, "paged_attention_v2": 1646, "exp_sum": 1647, "max_logits": 1648, "tmp_out": 1649, "paged_attention_rocm": 1650, "query_start_loc": 1651, "fp8_out_scale": 1652, "_rocm_c": 1653, "paged_attention": 1654, "mla_decode_kvcache_cpu": 1655, "kv_cache": 1656, "_c_cpu": 1657, "mla_decode_kvcache": 1658, "merge_attn_states": 1659, "prefix_output": 1660, "prefix_lse": 1661, "suffix_output": 1662, "suffix_lse": 1663, "output_lse": 1664, "convert_vertical_slash_indexes": 1665, "q_seqlens": 1666, "batch": 1667, "kv_seqlens": 1668, "vertical_indexes": 1669, "n_heads": 1670, "nnz_v": 1671, "slash_indexes": 1672, "nnz_s": 1673, "context_size": 1674, "block_size_m": 1675, "block_size_n": 1676, "causal": 1677, "tuple": 1678, "batch_size": 1679, "num_heads": 1680, "nnz_slash": 1681, "nnz_vertical": 1682, "num_rows": 1683, "block_count": 1684, "zeros": 1685, "dtype": 1686, "device": 1687, "block_offset": 1688, "column_count": 1689, "column_index": 1690, "convert_vertical_slash_indexes_mergehead": 1691, "different": 1692, "head": 1693, "indices": 1694, "vertical_indices_count": 1695, "slash_indices_count": 1696, "rotary_embedding": 1697, "positions": 1698, "head_size": 1699, "cos_sin_cache": 1700, "is_neox": 1701, "batched_rotary_embedding": 1702, "rot_dim": 1703, "cos_sin_cache_offsets": 1704, "rms_norm": 1705, "input": 1706, "weight": 1707, "epsilon": 1708, "todo": 1709, "contiguous": 1710, "call": 1711, "kernel": 1712, "updated": 1713, "input_contiguous": 1714, "fused_add_rms_norm": 1715, "residual": 1716, "apply_repetition_penalties_torch": 1717, "logits": 1718, "prompt_mask": 1719, "output_mask": 1720, "repetition_penalties": 1721, "unsqueeze": 1722, "dim": 1723, "repeat": 1724, "token": 1725, "appears": 1726, "prompt": 1727, "op": 1728, "penalties": 1729, "divide": 1730, "penalty": 1731, "multiply": 1732, "scaling": 1733, "apply_repetition_penalties_cuda": 1734, "apply_repetition_penalties_": 1735, "apply_repetition_penalties": 1736, "repetition": 1737, "place": 1738, "args": 1739, "shape": 1740, "num_seqs": 1741, "vocab_size": 1742, "boolean": 1743, "indicating": 1744, "tokens": 1745, "appear": 1746, "is_cuda": 1747, "is_contiguous": 1748, "rms_norm_dynamic_per_token_quant": 1749, "quant_dtype": 1750, "scale_ub": 1751, "empty_like": 1752, "scales": 1753, "numel": 1754, "float32": 1755, "awq_dequantize": 1756, "qweight": 1757, "split_k_iters": 1758, "thx": 1759, "thy": 1760, "vllm_use_triton_awq": 1761, "awq_triton": 1762, "awq_dequantize_triton": 1763, "awq_gemm": 1764, "qzeros": 1765, "awq_gemm_triton": 1766, "gptq_gemm": 1767, "b_q_weight": 1768, "b_gptq_qzeros": 1769, "b_gptq_scales": 1770, "b_g_idx": 1771, "use_exllama": 1772, "bit": 1773, "gptq_shuffle": 1774, "q_weight": 1775, "q_perm": 1776, "marlin_gemm": 1777, "b_scales": 1778, "workspace": 1779, "size_m": 1780, "size_n": 1781, "size_k": 1782, "gptq_marlin_24_gemm": 1783, "b_meta": 1784, "b_q_type": 1785, "cutlass_scaled_mm_supports_fp4": 1786, "cuda_device_capability": 1787, "cutlass_blockwise_scaled_grouped_mm": 1788, "scales_a": 1789, "scales_b": 1790, "problem_sizes": 1791, "expert_offsets": 1792, "cutlass_scaled_fp4_mm": 1793, "block_scale_a": 1794, "block_scale_b": 1795, "out_dtype": 1796, "ndim": 1797, "cutlass_scaled_mm_supports_fp8": 1798, "cutlass_scaled_mm_supports_block_fp8": 1799, "cutlass_scaled_mm": 1800, "scale_a": 1801, "scale_b": 1802, "bias": 1803, "implements": 1804, "fused": 1805, "mm": 1806, "implemented": 1807, "numpy": 1808, "style": 1809, "broadcasting": 1810, "blockwise": 1811, "found": 1812, "extended": 1813, "broadcast": 1814, "rules": 1815, "extend": 1816, "rule": 1817, "extent": 1818, "dimension": 1819, "element": 1820, "along": 1821, "src_shape": 1822, "target_shape": 1823, "times": 1824, "consecutively": 1825, "expand": 1826, "currently": 1827, "128": 1828, "bfloat16": 1829, "float16": 1830, "massage": 1831, "2d": 1832, "cutlass_compatible_b": 1833, "is_rocm": 1834, "compressed_tensors": 1835, "triton_scaled_mm": 1836, "noqa": 1837, "cutlass_scaled_mm_azp": 1838, "azp_adj": 1839, "azp": 1840, "param": 1841, "per": 1842, "always": 1843, "cutlass_sparse_scaled_mm_supported": 1844, "cutlass_group_gemm_supported": 1845, "cutlass_sparse_compress": 1846, "compresses": 1847, "sparse": 1848, "matrix": 1849, "cutlass": 1850, "operations": 1851, "takes": 1852, "dense": 1853, "two": 1854, "elements": 1855, "metadata": 1856, "compressed": 1857, "representation": 1858, "must": 1859, "one": 1860, "types": 1861, "float8_e4m3fn": 1862, "containing": 1863, "a_nzs": 1864, "a_meta": 1865, "raises": 1866, "compression": 1867, "operation": 1868, "fails": 1869, "uint8": 1870, "encodes": 1871, "sparsity": 1872, "elemspermetaelem": 1873, "dimensions": 1874, "8b": 1875, "2b_per_nz": 1876, "cutlass_scaled_sparse_mm": 1877, "bt_nzs": 1878, "bt_meta": 1879, "performs": 1880, "scaled": 1881, "multiplication": 1882, "steps": 1883, "randn": 1884, "prune": 1885, "prune_to_2_4": 1886, "compress": 1887, "transposed": 1888, "applying": 1889, "factors": 1890, "result": 1891, "get_cutlass_moe_mm_data": 1892, "topk_ids": 1893, "problem_sizes1": 1894, "problem_sizes2": 1895, "input_permutation": 1896, "output_permutation": 1897, "num_experts": 1898, "blockscale_offsets": 1899, "prepare": 1900, "necessary": 1901, "grouped": 1902, "multiplications": 1903, "moe": 1904, "mapping": 1905, "mark": 1906, "begins": 1907, "computation": 1908, "sorted": 1909, "computed": 1910, "mxnxk": 1911, "sizes": 1912, "mms": 1913, "permutation": 1914, "shuffle": 1915, "executing": 1916, "argument": 1917, "passed": 1918, "fp4": 1919, "block": 1920, "rows": 1921, "shuffle_rows": 1922, "input_tensor": 1923, "dst2src_map": 1924, "according": 1925, "store": 1926, "output_tensor": 1927, "permute": 1928, "performing": 1929, "num_tokens_permuted": 1930, "get_cutlass_pplx_moe_mm_data": 1931, "expert_num_tokens": 1932, "num_local_experts": 1933, "padded_m": 1934, "non_zero_expert_idxs": 1935, "consecutive": 1936, "experts": 1937, "counts": 1938, "cutlass_moe_mm": 1939, "out_tensors": 1940, "a_tensors": 1941, "b_tensors": 1942, "a_scales": 1943, "a_strides": 1944, "b_strides": 1945, "c_strides": 1946, "per_act_token": 1947, "per_out_ch": 1948, "executes": 1949, "quantized": 1950, "ab": 1951, "strides": 1952, "cutlass_fp4_moe_mm": 1953, "alphas": 1954, "sf_offsets": 1955, "blockscaled": 1956, "gemm": 1957, "runs": 1958, "gemms": 1959, "combination": 1960, "problem": 1961, "nvfp4": 1962, "fusedmoe": 1963, "forward": 1964, "a_ptrs": 1965, "b_ptrs": 1966, "tensors": 1967, "weights": 1968, "a_": 1969, "blockscales": 1970, "e4m3": 1971, "precision": 1972, "sf_size": 1973, "sf_offset": 1974, "cutlass_fp4_group_mm": 1975, "gptq_marlin_repack": 1976, "perm": 1977, "num_bits": 1978, "awq_marlin_repack": 1979, "gptq_marlin_moe_repack": 1980, "awq_marlin_moe_repack": 1981, "gptq_marlin_gemm": 1982, "b_bias": 1983, "global_scale": 1984, "b_zeros": 1985, "g_idx": 1986, "is_k_full": 1987, "use_atomic_add": 1988, "use_fp32_reduce": 1989, "is_zp_float": 1990, "machete_supported_schedules": 1991, "a_type": 1992, "b_type": 1993, "group_scales_type": 1994, "group_zeros_type": 1995, "channel_scales_type": 1996, "token_scales_type": 1997, "out_type": 1998, "machete_mm": 1999, "b_q": 2000, "returned": 2001, "machete_prepack_b": 2002, "b_group_scales": 2003, "b_group_zeros": 2004, "b_group_size": 2005, "b_channel_scales": 2006, "a_token_scales": 2007, "schedule": 2008, "permute_cols": 2009, "scaled_fp4_quant": 2010, "input_global_scale": 2011, "quantize": 2012, "quantizes": 2013, "last": 2014, "given": 2015, "dynamically": 2016, "factor": 2017, "shared": 2018, "stored": 2019, "swizzled": 2020, "layout": 2021, "thread": 2022, "tcgen05": 2023, "mma": 2024, "4x": 2025, "scalar": 2026, "entire": 2027, "values": 2028, "packed": 2029, "float8_e4m3": 2030, "sizzled": 2031, "needs": 2032, "got": 2033, "other_dims": 2034, "reshape": 2035, "fp16": 2036, "bf16": 2037, "rounded": 2038, "due": 2039, "requirement": 2040, "minimum": 2041, "tile": 2042, "128x4": 2043, "pad": 2044, "multiples": 2045, "int32": 2046, "round_up": 2047, "rounded_m": 2048, "scale_n": 2049, "rounded_n": 2050, "output_scale": 2051, "scaled_fp4_experts_quant": 2052, "topk": 2053, "offsets": 2054, "blockscale": 2055, "output_scales": 2056, "maximum": 2057, "prevent": 2058, "running": 2059, "increased": 2060, "larger": 2061, "max_tokens_per_expert": 2062, "vllm_max_tokens_per_expert_fp4_moe": 2063, "m_numtopk": 2064, "cutlass_moe_fp4": 2065, "observed": 2066, "scales_k": 2067, "padded_k": 2068, "orch": 2069, "scaled_fp8_quant": 2070, "num_token_padding": 2071, "use_per_token_if_dynamic": 2072, "static": 2073, "dynamic": 2074, "provide": 2075, "omit": 2076, "determined": 2077, "padding": 2078, "downstream": 2079, "benefit": 2080, "upper": 2081, "bound": 2082, "least": 2083, "whether": 2084, "per_tensor": 2085, "per_token": 2086, "assumes": 2087, "batch_dim": 2088, "num_tokens": 2089, "flattened": 2090, "mi300": 2091, "float_e3m3fnuz": 2092, "fp8_dtype": 2093, "ape": 2094, "dynamic_per_token_scaled_fp8_quant": 2095, "dynamic_scaled_fp8_quant": 2096, "static_scaled_fp8_quant": 2097, "allspark_repack_weight": 2098, "zero_point": 2099, "has_zp": 2100, "rearrange": 2101, "asymmetric": 2102, "n32k16": 2103, "ampere": 2104, "w8a16": 2105, "original": 2106, "provided": 2107, "symmetric": 2108, "rearranged": 2109, "n_32align": 2110, "32": 2111, "qweight_reorder": 2112, "scale_reorder": 2113, "zero_point_reorder": 2114, "rearrange_kn_weight_as_n32k16_order": 2115, "allspark_w8a16_gemm": 2116, "b_qweight": 2117, "b_qzeros": 2118, "group_size": 2119, "sm_count": 2120, "sm_version": 2121, "cublas_m_threshold": 2122, "n32k16_reorder": 2123, "scaled_int8_quant": 2124, "maybe": 2125, "invoke": 2126, "point": 2127, "ignored": 2128, "static_scaled_int8_quant": 2129, "input_scales": 2130, "input_azp": 2131, "dynamic_scaled_int8_quant": 2132, "marlin_qqq_gemm": 2133, "s_tok": 2134, "s_ch": 2135, "s_group": 2136, "ggml_dequantize": 2137, "quant_type": 2138, "ggml_mul_mat_vec_a8": 2139, "row": 2140, "ggml_mul_mat_a8": 2141, "ggml_moe_a8": 2142, "sorted_token_ids": 2143, "expert_ids": 2144, "num_tokens_post_padded": 2145, "top_k": 2146, "ggml_moe_a8_vec": 2147, "symint": 2148, "ggml_moe_get_block_size": 2149, "selective_scan_fwd": 2150, "delta": 2151, "d_": 2152, "z_": 2153, "delta_bias_": 2154, "delta_softplus": 2155, "cache_indices": 2156, "has_initial_state": 2157, "ssm_states": 2158, "pad_slot_id": 2159, "llmm1": 2160, "rows_per_block": 2161, "wvsplitk": 2162, "cu_count": 2163, "wvsplitkq": 2164, "moe_sum": 2165, "moe_align_block_size": 2166, "experts_ids": 2167, "num_tokens_post_pad": 2168, "moe_wna16_gemm": 2169, "topk_weights": 2170, "block_size_k": 2171, "notimplementederror": 2172, "topk_softmax": 2173, "token_expert_indices": 2174, "gating_output": 2175, "moe_wna16_marlin_gemm": 2176, "num_tokens_past_padded": 2177, "moe_block_size": 2178, "mul_topk_weights": 2179, "is_ep": 2180, "reshape_and_cache": 2181, "slot_mapping": 2182, "_c_cache_ops": 2183, "reshape_and_cache_flash": 2184, "concat_and_cache_mla": 2185, "kv_c": 2186, "k_pe": 2187, "copy_blocks": 2188, "key_caches": 2189, "value_caches": 2190, "block_mapping": 2191, "copy_blocks_mla": 2192, "kv_caches": 2193, "swap_blocks": 2194, "convert_fp8": 2195, "kv_dtype": 2196, "gather_cache": 2197, "src_cache": 2198, "block_table": 2199, "cu_seq_lens": 2200, "seq_starts": 2201, "get_device_attribute": 2202, "attribute": 2203, "_c_cuda_utils": 2204, "get_max_shared_memory_per_block_device_attribute": 2205, "ruff": 2206, "e501": 2207, "init_custom_ar": 2208, "ipc_tensors": 2209, "rank_data": 2210, "rank": 2211, "fully_connected": 2212, "_c_custom_ar": 2213, "all_reduce": 2214, "fa": 2215, "inp": 2216, "reg_buffer": 2217, "reg_buffer_sz_bytes": 2218, "dispose": 2219, "meta_size": 2220, "register_buffer": 2221, "get_graph_buffer_ipc_meta": 2222, "register_graph_buffers": 2223, "handles": 2224, "allocate_shared_buffer_and_handle": 2225, "open_mem_handle": 2226, "mem_handle": 2227, "free_shared_buffer": 2228, "ptr": 2229, "init_custom_qr": 2230, "world_size": 2231, "qr_max_size": 2232, "qr_destroy": 2233, "qr_all_reduce": 2234, "quant_level": 2235, "cast_bf2half": 2236, "qr_get_handle": 2237, "qr_open_handles": 2238, "get_flash_mla_metadata": 2239, "cache_seqlens": 2240, "num_heads_per_head_k": 2241, "num_heads_k": 2242, "arguments": 2243, "equals": 2244, "seq_len_q": 2245, "num_heads_q": 2246, "tile_scheduler_metadata": 2247, "num_sm_parts": 2248, "tileschedulermetadatasize": 2249, "num_splits": 2250, "flash_mla_with_kvcache": 2251, "k_cache": 2252, "head_dim_v": 2253, "softmax_scale": 2254, "head_dim": 2255, "num_blocks": 2256, "page_block_size": 2257, "max_num_blocks_per_seq": 2258, "get_mla_metadata": 2259, "qk": 2260, "softmax": 2261, "sqrt": 2262, "mask": 2263, "softmax_lse": 2264, "flash_mla_fwd_kvcache": 2265, "cutlass_mla_decode": 2266, "q_nope": 2267, "q_pe": 2268, "kv_c_and_k_pe_cache": 2269, "page_table": 2270, "sm100_cutlass_mla_decode": 2271, "num_kv_splits": 2272, "sm100_cutlass_mla_get_workspace_size": 2273, "num_batches": 2274, "ipex_ops": 2275, "_reshape_activation_tensor": 2276, "num": 2277, "x1": 2278, "x2": 2279, "chunk": 2280, "chunks": 2281, "silu_and_mul": 2282, "ipex": 2283, "gelu_and_mul": 2284, "gelu_tanh_and_mul": 2285, "gelu_fast": 2286, "nn": 2287, "gelu": 2288, "gelu_new": 2289, "gelu_quick": 2290, "context_lens": 2291, "max_context_len": 2292, "auto": 2293, "num_queries_per_tokens": 2294, "single_query_kv_attent": 2295, "tion": 2296, "view_as": 2297, "single_query_kv_attention": 2298, "seq_len": 2299, "cos_sin_dim": 2300, "rotary_embedding_batched": 2301, "tmp": 2302, "add_rms_norm": 2303, "copy_": 2304, "varlen_attention": 2305, "seqlen_q": 2306, "seqlen_k": 2307, "max_seqlen_q": 2308, "max_seqlen_k": 2309, "pdropout": 2310, "zero_tensors": 2311, "is_causal": 2312, "return_softmax": 2313, "gen_": 2314, "generator": 2315, "window_size_left": 2316, "window_size": 2317, "e_right": 2318, "logits_soft_cap": 2319, "endswith": 2320, "window_size_right": 2321, "e_cache": 2322, "k_scale_float": 2323, "v_scale_float": 2324, "kv": 2325, "cache": 2326, "flash_attn_varlen_func": 2327, "cu_seqlens_q": 2328, "seqused_k": 2329, "don": 2330, "softcap": 2331, "cu_seqlens_k": 2332, "parameters": 2333, "scheduler_metadata": 2334, "fa_version": 2335, "q_descale": 2336, "k_descale": 2337, "v_descale": 2338, "s_aux": 2339, "cumsum": 2340, "real_window_size": 2341, "get_scheduler_metadata": 2342, "num_heads_kv": 2343, "headdim": 2344, "qkv_dtype": 2345, "headdim_v": 2346, "cu_seqlens_k_new": 2347, "cache_leftpad": 2348, "page_size": 2349, "max_seqlen_k_new": 2350, "means": 2351, "infinite": 2352, "window": 2353, "has_softcap": 2354, "tuned": 2355, "speed": 2356, "pack_gqa": 2357, "sm_margin": 2358, "sms": 2359, "warning_once": 2360, "returning": 2361, "ignore": 2362, "sw": 2363, "wap_blocks": 2364, "dataclasses": 2365, "dataclass": 2366, "lorarequest": 2367, "sequence": 2368, "logprob": 2369, "beamsearchsequence": 2370, "keeps": 2371, "log": 2372, "probability": 2373, "field": 2374, "filled": 2375, "logprobs": 2376, "lora_request": 2377, "cum_logprob": 2378, "finish_reason": 2379, "stop_reason": 2380, "multi_modal_data": 2381, "multimodaldatadict": 2382, "mm_processor_kwargs": 2383, "beamsearchoutput": 2384, "sequences": 2385, "length": 2386, "equal": 2387, "beamsearchinstance": 2388, "prompt_tokens": 2389, "kwargs": 2390, "beams": 2391, "completed": 2392, "get_beam_search_score": 2393, "cumulative_logprob": 2394, "eos_token_id": 2395, "length_penalty": 2396, "calculate": 2397, "score": 2398, "transformers": 2399, "ccb92be23def445f2afdea94c31286f84b89eb5b": 2400, "generation": 2401, "beam_search": 2402, "l938": 2403, "create_sort_beams_key_function": 2404, "sort_beams_key": 2405, "datetime": 2406, "locale": 2407, "collections": 2408, "namedtuple": 2409, "regex": 2410, "environment_variables": 2411, "systemenv": 2412, "torch_version": 2413, "is_debug_build": 2414, "cuda_compiled_version": 2415, "gcc_version": 2416, "clang_version": 2417, "cmake_version": 2418, "libc_version": 2419, "python_version": 2420, "python_platform": 2421, "is_cuda_available": 2422, "cuda_runtime_version": 2423, "cuda_module_loading": 2424, "nvidia_driver_version": 2425, "nvidia_gpu_models": 2426, "cudnn_version": 2427, "pip_version": 2428, "pip3": 2429, "pip_packages": 2430, "conda_packages": 2431, "hip_compiled_version": 2432, "hip_runtime_version": 2433, "miopen_runtime_version": 2434, "caching_allocator_config": 2435, "is_xnnpack_available": 2436, "cpu_info": 2437, "neuron_sdk_version": 2438, "vllm_version": 2439, "vllm_build_flags": 2440, "gpu_topo": 2441, "env_vars": 2442, "default_conda_patterns": 2443, "cudatoolkit": 2444, "soumith": 2445, "mkl": 2446, "magma": 2447, "triton": 2448, "optree": 2449, "nccl": 2450, "zmq": 2451, "pynvml": 2452, "default_pip_patterns": 2453, "mypy": 2454, "flake8": 2455, "onnx": 2456, "stderr": 2457, "popen": 2458, "pipe": 2459, "raw_output": 2460, "raw_err": 2461, "get_platform": 2462, "win32": 2463, "enc": 2464, "oem": 2465, "getpreferredencoding": 2466, "topo": 2467, "leading": 2468, "whitespace": 2469, "because": 2470, "meaningful": 2471, "rstrip": 2472, "filenotfounderror": 2473, "cmd_str": 2474, "isinstance": 2475, "127": 2476, "run_and_read_all": 2477, "run_lambda": 2478, "reads": 2479, "run_and_parse_first_match": 2480, "run_and_return_first_line": 2481, "get_conda_packages": 2482, "patterns": 2483, "conda": 2484, "conda_exe": 2485, "splitlines": 2486, "get_gcc_version": 2487, "gcc": 2488, "get_clang_version": 2489, "clang": 2490, "get_cmake_version": 2491, "get_nvidia_driver_version": 2492, "darwin": 2493, "cmd": 2494, "kextstat": 2495, "grep": 2496, "get_nvidia_smi": 2497, "get_gpu_info": 2498, "torch_available": 2499, "hasattr": 2500, "is_available": 2501, "prop": 2502, "get_device_properties": 2503, "gcnarchname": 2504, "gcnarch": 2505, "nogcnarchnameonoldpytorch": 2506, "get_device_name": 2507, "uuid_regex": 2508, "uuid": 2509, "anonymize": 2510, "sub": 2511, "get_running_cuda_version": 2512, "get_cudnn_version": 2513, "libcudnn": 2514, "hard": 2515, "tell": 2516, "system_root": 2517, "systemroot": 2518, "windows": 2519, "cuda_path": 2520, "where_cmd": 2521, "system32": 2522, "cudnn_cmd": 2523, "cudnn": 2524, "dll": 2525, "drivers": 2526, "usr": 2527, "mac": 2528, "deeplearning": 2529, "sdk": 2530, "installmac": 2531, "cudnn_library": 2532, "installed": 2533, "elsewhere": 2534, "ls": 2535, "ldconfig": 2536, "rev": 2537, "f1": 2538, "realpath": 2539, "files_set": 2540, "eliminate": 2541, "symbolic": 2542, "links": 2543, "add": 2544, "alphabetize": 2545, "deterministic": 2546, "probably": 2547, "linux": 2548, "program_files_root": 2549, "programfiles": 2550, "program": 2551, "legacy_path": 2552, "corporation": 2553, "nvsmi": 2554, "new_path": 2555, "smis": 2556, "candidate_smi": 2557, "break": 2558, "hipcc": 2559, "get_neuron_sdk_version": 2560, "script": 2561, "version_str": 2562, "git_sha": 2563, "summarize_vllm_build_flags": 2564, "method": 2565, "flags": 2566, "constant": 2567, "variables": 2568, "etc": 2569, "archs": 2570, "torch_cuda_arch_list": 2571, "enabled": 2572, "disabled": 2573, "neuron_cores": 2574, "get_gpu_topo": 2575, "showtopo": 2576, "get_cpu_info": 2577, "lscpu": 2578, "wmic": 2579, "manufacturer": 2580, "family": 2581, "architecture": 2582, "processortype": 2583, "deviceid": 2584, "currentclockspeed": 2585, "maxclockspeed": 2586, "l2cachesize": 2587, "l2cachespeed": 2588, "revision": 2589, "sysctl": 2590, "machdep": 2591, "brand_string": 2592, "cygwin": 2593, "get_mac_version": 2594, "sw_vers": 2595, "productversion": 2596, "get_windows_version": 2597, "wmic_cmd": 2598, "wbem": 2599, "findstr_cmd": 2600, "findstr": 2601, "caption": 2602, "get_lsb_version": 2603, "lsb_release": 2604, "description": 2605, "check_release_file": 2606, "pretty_name": 2607, "get_os": 2608, "machine": 2609, "macos": 2610, "ubuntu": 2611, "debian": 2612, "desc": 2613, "reading": 2614, "get_python_platform": 2615, "get_libc_version": 2616, "libc_ver": 2617, "get_pip_packages": 2618, "packages": 2619, "run_with_pip": 2620, "pip_spec": 2621, "find_spec": 2622, "pip_available": 2623, "importerror": 2624, "mpip": 2625, "freeze": 2626, "uv": 2627, "collect": 2628, "get_cachingallocator_config": 2629, "ca_config": 2630, "pytorch_cuda_alloc_conf": 2631, "get_cuda_module_loading_config": 2632, "init": 2633, "config": 2634, "backends": 2635, "xnnpack": 2636, "attr": 2637, "get_env_vars": 2638, "secret_terms": 2639, "secret": 2640, "password": 2641, "report_prefix": 2642, "cublas": 2643, "omp_": 2644, "mkl_": 2645, "items": 2646, "term": 2647, "get_env_info": 2648, "pip_list_output": 2649, "debug_mode_str": 2650, "cuda_available_str": 2651, "get_version_or_na": 2652, "_lst": 2653, "rsplit": 2654, "_show_config": 2655, "miopen": 2656, "sys_version": 2657, "maxsize": 2658, "bit_length": 2659, "get_cud": 2660, "da_module_loading_config": 2661, "env_info_fmt": 2662, "libc": 2663, "relevant": 2664, "pretty_str": 2665, "envinfo": 2666, "replace_nones": 2667, "dct": 2668, "replacement": 2669, "keys": 2670, "replace_bools": 2671, "yes": 2672, "prepend": 2673, "updated_lines": 2674, "replace_if_empty": 2675, "maybe_start_on_next_line": 2676, "multiline": 2677, "mutable_dict": 2678, "_asdict": 2679, "next": 2680, "doesn": 2681, "fields": 2682, "dynamic_cuda_fields": 2683, "all_cuda_fields": 