{"contributing": 0, "vllm": 1, "you": 2, "may": 3, "find": 4, "information": 5, "about": 6, "docs": 7, "ai": 8, "https": 9, "en": 10, "latest": 11, "markdownlint": 12, "disable": 13, "md001": 14, "md041": 15, "align": 16, "center": 17, "picture": 18, "source": 19, "media": 20, "prefers": 21, "color": 22, "scheme": 23, "dark": 24, "srcset": 25, "raw": 26, "githubusercontent": 27, "com": 28, "project": 29, "main": 30, "assets": 31, "logos": 32, "logo": 33, "text": 34, "png": 35, "img": 36, "alt": 37, "src": 38, "light": 39, "width": 40, "55": 41, "h3": 42, "easy": 43, "fast": 44, "cheap": 45, "llm": 46, "serving": 47, "everyone": 48, "href": 49, "documentation": 50, "blog": 51, "arxiv": 52, "org": 53, "abs": 54, "2309": 55, "06180": 56, "paper": 57, "vllm_project": 58, "twitter": 59, "discuss": 60, "user": 61, "forum": 62, "slack": 63, "developer": 64, "news": 65, "2025": 66, "08": 67, "we": 68, "hosted": 69, "beijing": 70, "meetup": 71, "mp": 72, "weixin": 73, "qq": 74, "dgkwg1wfpwgo2jcdtqqhxa": 75, "focusing": 76, "large": 77, "scale": 78, "deployment": 79, "please": 80, "slides": 81, "here": 82, "drive": 83, "google": 84, "folders": 85, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 86, "recording": 87, "www": 88, "chaspark": 89, "live": 90, "1166916873711665152": 91, "05": 92, "nyc": 93, "lu": 94, "ma": 95, "c1rqyf1f": 96, "presentation": 97, "1_q_aw_iomjwuimf1s1ym": 98, "zhjxz8cuel0ijvaquoybea": 99, "edit": 100, "usp": 101, "sharing": 102, "now": 103, "under": 104, "pytorch": 105, "foundation": 106, "announcement": 107, "welcomes": 108, "01": 109, "excited": 110, "announce": 111, "alpha": 112, "release": 113, "v1": 114, "major": 115, "architectural": 116, "upgrade": 117, "7x": 118, "speedup": 119, "clean": 120, "code": 121, "optimized": 122, "execution": 123, "loop": 124, "zero": 125, "overhead": 126, "prefix": 127, "caching": 128, "enhanced": 129, "multimodal": 130, "support": 131, "more": 132, "check": 133, "out": 134, "our": 135, "post": 136, "27": 137, "html": 138, "details": 139, "summary": 140, "previous": 141, "04": 142, "asia": 143, "day": 144, "sginnovate": 145, "event": 146, "limited": 147, "availability": 148, "morning": 149, "evening": 150, "slots": 151, "remaining": 152, "inaugural": 153, "from": 154, "team": 155, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 156, "03": 157, "ollama": 158, "inference": 159, "night": 160, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 161, "first": 162, "china": 163, "n77gibl2coratqhtveazfg": 164, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 165, "east": 166, "coast": 167, "7mu4k4xx": 168, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 169, "slide": 170, "id": 171, "g31441846c39_0_0": 172, "02": 173, "ninth": 174, "h7g3kuj9": 175, "meta": 176, "1jzc_pzvxrvnsfvcw": 177, "v4cfxb6pn7zz2cyp_flwo05aqg": 178, "amd": 179, "file": 180, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 181, "view": 182, "posted": 183, "eighth": 184, "zep56hui": 185, "cloud": 186, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 187, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 188, "2024": 189, "12": 190, "joins": 191, "ecosystem": 192, "11": 193, "seventh": 194, "h0qvrajz": 195, "snowflake": 196, "1e3cxqbv3jsfgp30swyvs3em_tw": 197, "ghohj9pajgk6kr54": 198, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 199, "10": 200, "have": 201, "just": 202, "created": 203, "coordinating": 204, "contributions": 205, "discussing": 206, "features": 207, "feel": 208, "free": 209, "join": 210, "us": 211, "ray": 212, "summit": 213, "held": 214, "special": 215, "track": 216, "opening": 217, "talk": 218, "1b_kqxphbtra_mdf": 219, "tr6i8rwdou5qotznceg2mkzxehm": 220, "learn": 221, "talks": 222, "youtube": 223, "playlist": 224, "list": 225, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 226, "other": 227, "contributors": 228, "users": 229, "09": 230, "sixth": 231, "87q3nvnh": 232, "nvidia": 233, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 234, "9wqyp7ny93xrs": 235, "07": 236, "fifth": 237, "lp0gyjqr": 238, "aws": 239, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 240, "partnership": 241, "officially": 242, "supports": 243, "llama": 244, "fp8": 245, "quantization": 246, "pipeline": 247, "parallelism": 248, "23": 249, "llama31": 250, "06": 251, "fourth": 252, "agivllm": 253, "cloudflare": 254, "bentoml": 255, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 256, "third": 257, "robloxandvllmmeetup2024": 258, "splashthat": 259, "roblox": 260, "1a": 261, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 262, "second": 263, "ygxbpzhl": 264, "ibm": 265, "12mi2skabnuw5rbwxdyy": 266, "hthth4imsnceoq10jdqbxga": 267, "2023": 268, "a16z": 269, "1ql": 270, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 271, "would": 272, "like": 273, "express": 274, "sincere": 275, "gratitude": 276, "andreessen": 277, "horowitz": 278, "30": 279, "supporting": 280, "open": 281, "community": 282, "providing": 283, "generous": 284, "grant": 285, "development": 286, "research": 287, "released": 288, "fastchat": 289, "integration": 290, "has": 291, "powered": 292, "lmsys": 293, "vicuna": 294, "chatbot": 295, "arena": 296, "chat": 297, "since": 298, "mid": 299, "april": 300, "use": 301, "library": 302, "originally": 303, "developed": 304, "sky": 305, "computing": 306, "lab": 307, "cs": 308, "berkeley": 309, "edu": 310, "uc": 311, "evolved": 312, "driven": 313, "both": 314, "academia": 315, "industry": 316, "state": 317, "art": 318, "throughput": 319, "efficient": 320, "management": 321, "attention": 322, "key": 323, "value": 324, "memory": 325, "pagedattention": 326, "20": 327, "continuous": 328, "batching": 329, "incoming": 330, "requests": 331, "model": 332, "cuda": 333, "hip": 334, "graph": 335, "quantizations": 336, "gptq": 337, "2210": 338, "17323": 339, "awq": 340, "2306": 341, "00978": 342, "autoround": 343, "05516": 344, "int4": 345, "int8": 346, "kernels": 347, "including": 348, "flashattention": 349, "flashinfer": 350, "speculative": 351, "decoding": 352, "chunked": 353, "prefill": 354, "flexible": 355, "seamless": 356, "popular": 357, "hugging": 358, "face": 359, "models": 360, "high": 361, "various": 362, "algorithms": 363, "parallel": 364, "sampling": 365, "beam": 366, "search": 367, "tensor": 368, "data": 369, "expert": 370, "distributed": 371, "streaming": 372, "outputs": 373, "openai": 374, "compatible": 375, "api": 376, "server": 377, "gpus": 378, "cpus": 379, "intel": 380, "powerpc": 381, "tpu": 382, "neuron": 383, "multi": 384, "lora": 385, "seamlessly": 386, "most": 387, "huggingface": 388, "transformer": 389, "llms": 390, "mixture": 391, "mixtral": 392, "deepseek": 393, "v2": 394, "v3": 395, "embedding": 396, "e5": 397, "mistral": 398, "modal": 399, "llava": 400, "full": 401, "supported": 402, "supported_models": 403, "getting": 404, "started": 405, "install": 406, "pip": 407, "getting_started": 408, "installation": 409, "gpu": 410, "index": 411, "build": 412, "wheel": 413, "bash": 414, "visit": 415, "quickstart": 416, "welcome": 417, "any": 418, "collaborations": 419, "how": 420, "get": 421, "involved": 422, "sponsors": 423, "compute": 424, "resources": 425, "testing": 426, "following": 427, "organizations": 428, "thank": 429, "your": 430, "note": 431, "sort": 432, "them": 433, "alphabetical": 434, "order": 435, "keep": 436, "consistent": 437, "md": 438, "cash": 439, "donations": 440, "dropbox": 441, "sequoia": 442, "capital": 443, "skywork": 444, "zhenfund": 445, "alibaba": 446, "anyscale": 447, "crusoe": 448, "databricks": 449, "deepinfra": 450, "lambda": 451, "nebius": 452, "novita": 453, "replicate": 454, "runpod": 455, "trainy": 456, "san": 457, "diego": 458, "sponsor": 459, "also": 460, "official": 461, "fundraising": 462, "venue": 463, "through": 464, "opencollective": 465, "plan": 466, "fund": 467, "maintenance": 468, "adoption": 469, "citation": 470, "cite": 471, "bibtex": 472, "inproceedings": 473, "kwon2023efficient": 474, "title": 475, "language": 476, "author": 477, "woosuk": 478, "kwon": 479, "zhuohan": 480, "li": 481, "siyuan": 482, "zhuang": 483, "ying": 484, "sheng": 485, "lianmin": 486, "zheng": 487, "cody": 488, "hao": 489, "yu": 490, "joseph": 491, "gonzalez": 492, "zhang": 493, "ion": 494, "stoica": 495, "booktitle": 496, "proceedings": 497, "acm": 498, "sigops": 499, "29th": 500, "symposium": 501, "operating": 502, "systems": 503, "principles": 504, "year": 505, "contact": 506, "start": 507, "technical": 508, "questions": 509, "feature": 510, "github": 511, "issues": 512, "fellow": 513, "security": 514, "disclosures": 515, "advisories": 516, "partnerships": 517, "lists": 518, "mailto": 519, "end": 520, "kit": 521, "wish": 522, "refer": 523, "repo": 524, "import": 525, "ctypes": 526, "importlib": 527, "util": 528, "json": 529, "logging": 530, "os": 531, "re": 532, "shutil": 533, "subprocess": 534, "sys": 535, "pathlib": 536, "path": 537, "which": 538, "torch": 539, "packaging": 540, "version": 541, "parse": 542, "setuptools": 543, "extension": 544, "setup": 545, "command": 546, "build_ext": 547, "setuptools_scm": 548, "get_version": 549, "utils": 550, "cpp_extension": 551, "cuda_home": 552, "rocm_home": 553, "def": 554, "load_module_from_path": 555, "module_name": 556, "spec": 557, "spec_from_file_location": 558, "module": 559, "module_from_spec": 560, "modules": 561, "loader": 562, "exec_module": 563, "return": 564, "root_dir": 565, "__file__": 566, "parent": 567, "logger": 568, "getlogger": 569, "__name__": 570, "envs": 571, "py": 572, "vllm_target_device": 573, "main_cuda_version": 574, "is_sccache_available": 575, "bool": 576, "sccache": 577, "none": 578, "int": 579, "getenv": 580, "vllm_disable_sccache": 581, "is_ccache_available": 582, "ccache": 583, "is_ninja_available": 584, "ninja": 585, "is_url_available": 586, "url": 587, "str": 588, "urllib": 589, "request": 590, "urlopen": 591, "status": 592, "try": 593, "except": 594, "exception": 595, "false": 596, "200": 597, "class": 598, "cmakeextension": 599, "__init__": 600, "self": 601, "name": 602, "cmake_lists_dir": 603, "kwa": 604, "super": 605, "sources": 606, "py_limited_api": 607, "true": 608, "abspath": 609, "cmake_build_ext": 610, "dict": 611, "directories": 612, "been": 613, "configured": 614, "did_config": 615, "determine": 616, "number": 617, "compilation": 618, "jobs": 619, "optionally": 620, "nvcc": 621, "compile": 622, "threads": 623, "compute_num_jobs": 624, "num_jobs": 625, "either": 626, "max_jobs": 627, "environment": 628, "variable": 629, "defined": 630, "available": 631, "info": 632, "using": 633, "else": 634, "sched_getaffinity": 635, "isn": 636, "universally": 637, "so": 638, "fall": 639, "back": 640, "cpu_count": 641, "error": 642, "len": 643, "attributeerror": 644, "nvcc_threads": 645, "_is_cuda": 646, "get_nvcc_cuda_version": 647, "when": 648, "set": 649, "reduce": 650, "avoid": 651, "overloading": 652, "system": 653, "max": 654, "perform": 655, "cmake": 656, "configuration": 657, "single": 658, "configure": 659, "ext": 660, "ve": 661, "already": 662, "cmakelists": 663, "txt": 664, "exit": 665, "early": 666, "select": 667, "type": 668, "optimization": 669, "level": 670, "debug": 671, "default_cfg": 672, "relwithdebinfo": 673, "cfg": 674, "cmake_build_type": 675, "cmake_args": 676, "dcmake_build_type": 677, "format": 678, "dvllm_target_device": 679, "verbose": 680, "dcmake_verbose_makefile": 681, "dcmake_c_compiler_launcher": 682, "dcmake_cxx_compiler_launcher": 683, "dcmake_cuda_compiler_launcher": 684, "dcmake_hip_compiler_launcher": 685, "elif": 686, "pass": 687, "python": 688, "executable": 689, "can": 690, "exact": 691, "match": 692, "dvllm_python_executable": 693, "reuse": 694, "dependencies": 695, "subsequent": 696, "calls": 697, "dvllm_python_path": 698, "override": 699, "base": 700, "directory": 701, "fetchcontent": 702, "downloads": 703, "root": 704, "deps": 705, "allows": 706, "between": 707, "profiles": 708, "plays": 709, "nicely": 710, "fetchcontent_base_dir": 711, "fc_base_dir": 712, "environ": 713, "dfetchcontent_base_dir": 714, "tool": 715, "num_job": 716, "dnvcc_threads": 717, "build_tool": 718, "dcmake_job_pool_compile": 719, "string": 720, "dcmake_job_pools": 721, "default": 722, "whatever": 723, "picks": 724, "make": 725, "sure": 726, "dcmake_cuda_compiler": 727, "bin": 728, "check_call": 729, "cwd": 730, "build_temp": 731, "build_extensions": 732, "ensure": 733, "present": 734, "working": 735, "check_output": 736, "oserror": 737, "raise": 738, "runtimeerror": 739, "cannot": 740, "create": 741, "does": 742, "exist": 743, "exists": 744, "makedirs": 745, "targets": 746, "target_name": 747, "removeprefix": 748, "vllm_flash_attn": 749, "all": 750, "extensions": 751, "append": 752, "build_args": 753, "target": 754, "libraries": 755, "proper": 756, "location": 757, "outdir": 758, "get_ext_fullpath": 759, "absolute": 760, "skip": 761, "directo": 762, "ry": 763, "same": 764, "continue": 765, "appends": 766, "contains": 767, "need": 768, "remove": 769, "range": 770, "count": 771, "should": 772, "actually": 773, "components": 774, "install_args": 775, "component": 776, "run": 777, "standard": 778, "copy": 779, "build_lib": 780, "current": 781, "included": 782, "editable": 783, "glob": 784, "files": 785, "recursive": 786, "dst_file": 787, "split": 788, "print": 789, "copying": 790, "dirname": 791, "exist_ok": 792, "copy_file": 793, "precompiled_build_ext": 794, "disables": 795, "building": 796, "precompiled": 797, "binaries": 798, "assert": 799, "vllm_use_precompiled": 800, "only": 801, "builds": 802, "skipping": 803, "precompiled_wheel_utils": 804, "extracts": 805, "existing": 806, "staticmethod": 807, "extract_precompiled_and_patch_package": 808, "wheel_url_or_path": 809, "tempfile": 810, "zipfile": 811, "temp_dir": 812, "isfile": 813, "wheel_filename": 814, "mkdtemp": 815, "wheels": 816, "wheel_path": 817, "downloading": 818, "urlretrieve": 819, "filename": 820, "package_data_patch": 821, "files_to_copy": 822, "_c": 823, "abi3": 824, "_moe_c": 825, "_flashmla_c": 826, "_vllm_fa2_c": 827, "_vllm_fa3_c": 828, "cumem_allocator": 829, "compiled_regex": 830, "file_members": 831, "filter": 832, "filelist": 833, "extract": 834, "target_path": 835, "target_pa": 836, "th": 837, "wb": 838, "dst": 839, "copyfileobj": 840, "pkg": 841, "replace": 842, "setdefault": 843, "basename": 844, "finally": 845, "removing": 846, "temporary": 847, "rmtree": 848, "get_base_commit_in_main_branch": 849, "force": 850, "nightly": 851, "mainly": 852, "used": 853, "ci": 854, "vllm_test_use_precompiled_nightly_wheel": 855, "commit": 856, "hash": 857, "upstream": 858, "branch": 859, "resp_json": 860, "curl": 861, "repos": 862, "commits": 863, "decode": 864, "utf": 865, "upstream_main_commit": 866, "loads": 867, "sha": 868, "docker": 869, "context": 870, "git": 871, "immutable": 872, "missing": 873, "vllm_docker_build_context": 874, "local": 875, "cat": 876, "calledprocesserror": 877, "fetch": 878, "remote": 879, "repository": 880, "update": 881, "branches": 882, "ensures": 883, "ref": 884, "its": 885, "history": 886, "current_branch": 887, "show": 888, "strip": 889, "base_commit": 890, "merge": 891, "valueerror": 892, "err": 893, "warning": 894, "failed": 895, "dev": 896, "_no_device": 897, "empty": 898, "has_cuda": 899, "_is_neuron": 900, "_is_tpu": 901, "_is_hip": 902, "rocm": 903, "_is_cpu": 904, "cpu": 905, "_is_xpu": 906, "xpu": 907, "_build_custom_ops": 908, "get_rocm_version": 909, "librocm": 910, "core": 911, "see": 912, "blob": 913, "d11f5c20d500f729c393680a01fa902ebf92094b": 914, "rocm_version": 915, "cpp": 916, "l21": 917, "librocm_core_file": 918, "lib": 919, "is_file": 920, "librocm_core": 921, "cdll": 922, "vererrors": 923, "c_uint32": 924, "get_rocm_core_version": 925, "getrocmversion": 926, "restype": 927, "argtypes": 928, "pointer": 929, "minor": 930, "patch": 931, "byref": 932, "get_neuronxcc_version": 933, "sysconfig": 934, "site_dir": 935, "get_paths": 936, "purelib": 937, "version_file": 938, "neuronxcc": 939, "executed": 940, "successfully": 941, "fp": 942, "content": 943, "read": 944, "regular": 945, "expression": 946, "__version__": 947, "group": 948, "could": 949, "output": 950, "adapted": 951, "apex": 952, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 953, "nvcc_output": 954, "universal_newlines": 955, "release_idx": 956, "nvcc_cuda_version": 957, "get_gaudi_sw_version": 958, "returns": 959, "driver": 960, "enable": 961, "console": 962, "printing": 963, "hl": 964, "smi": 965, "shell": 966, "capture_output": 967, "env": 968, "enable_console": 969, "returncode": 970, "stdout": 971, "get_vllm_version": 972, "write_to": 973, "_version": 974, "sep": 975, "versions": 976, "might": 977, "contain": 978, "cuda_version": 979, "cuda_version_str": 980, "tarball": 981, "required": 982, "pypi": 983, "sdist": 984, "argv": 985, "cu": 986, "neuron_version": 987, "neuron_version_str": 988, "unknown": 989, "runtime": 990, "get_requirements": 991, "package": 992, "requirements": 993, "requirements_dir": 994, "_read_requirements": 995, "resolved_requirements": 996, "line": 997, "startswith": 998, "common": 999, "cuda_major": 1000, "cuda_minor": 1001, "modified_requirements": 1002, "req": 1003, "flash": 1004, "attn": 1005, "built": 1006, "unsupported": 1007, "platform": 1008, "ext_modules": 1009, "package_data": 1010, "typed": 1011, "model_executor": 1012, "layers": 1013, "fused_moe": 1014, "configs": 1015, "spdx": 1016, "license": 1017, "identifier": 1018, "apache": 1019, "filecopyrighttext": 1020, "copyright": 1021, "requires_files": 1022, "pyproject": 1023, "toml": 1024, "cleaning": 1025, "lines": 1026, "readlines": 1027, "lower": 1028, "removed": 1029, "write": 1030, "done": 1031, "releasing": 1032, "releases": 1033, "offer": 1034, "reliable": 1035, "packaged": 1036, "binary": 1037, "conveniently": 1038, "accessed": 1039, "via": 1040, "serve": 1041, "milestones": 1042, "communicate": 1043, "newly": 1044, "improvements": 1045, "upcoming": 1046, "changes": 1047, "affect": 1048, "potential": 1049, "breaking": 1050, "versioning": 1051, "uses": 1052, "right": 1053, "shifted": 1054, "where": 1055, "new": 1056, "every": 1057, "weeks": 1058, "bug": 1059, "fixes": 1060, "opposed": 1061, "semver": 1062, "backwards": 1063, "critical": 1064, "made": 1065, "post1": 1066, "_major_": 1067, "milestone": 1068, "incompatible": 1069, "similar": 1070, "_minor_": 1071, "_patch_": 1072, "_post1_": 1073, "_patch": 1074, "1_": 1075, "explicit": 1076, "implicit": 1077, "cadence": 1078, "bi": 1079, "weekly": 1080, "basis": 1081, "days": 1082, "after": 1083, "future": 1084, "dates": 1085, "below": 1086, "tentative": 1087, "optional": 1088, "date": 1089, "jan": 1090, "feb": 1091, "mar": 1092, "apr": 1093, "jun": 1094, "jul": 1095, "13": 1096, "aug": 1097, "14": 1098, "15": 1099, "16": 1100, "17": 1101, "oct": 1102, "18": 1103, "19": 1104, "nov": 1105, "21": 1106, "dec": 1107, "22": 1108, "each": 1109, "dedicated": 1110, "cut": 1111, "performed": 1112, "before": 1113, "previously": 1114, "reused": 1115, "triggered": 1116, "push": 1117, "rc": 1118, "tag": 1119, "vx": 1120, "rc1": 1121, "enables": 1122, "test": 1123, "multiple": 1124, "rcs": 1125, "final": 1126, "trigger": 1127, "notes": 1128, "monitor": 1129, "reverts": 1130, "apply": 1131, "cherry": 1132, "pick": 1133, "criteria": 1134, "approach": 1135, "finalizing": 1136, "clear": 1137, "what": 1138, "allowed": 1139, "process": 1140, "land": 1141, "pr": 1142, "typically": 1143, "sufficient": 1144, "time": 1145, "complete": 1146, "thorough": 1147, "round": 1148, "stable": 1149, "regression": 1150, "address": 1151, "functional": 1152, "performance": 1153, "against": 1154, "recent": 1155, "severe": 1156, "issue": 1157, "silent": 1158, "incorrectness": 1159, "compatibility": 1160, "crashes": 1161, "deadlocks": 1162, "leaks": 1163, "introduced": 1164, "specific": 1165, "change": 1166, "identifiers": 1167, "work": 1168, "prs": 1169, "considered": 1170, "merged": 1171, "trunk": 1172, "manual": 1173, "validations": 1174, "e2e": 1175, "validation": 1176, "regressions": 1177, "benchmark": 1178, "workflow": 1179, "actions": 1180, "workflows": 1181, "yml": 1182, "coverage": 1183, "llama3": 1184, "llama4": 1185, "hardware": 1186, "h100": 1187, "mi300x": 1188, "_note": 1189, "based": 1190, "availability_": 1191, "step": 1192, "access": 1193, "review": 1194, "familiarize": 1195, "yourself": 1196, "configurations": 1197, "tree": 1198, "benchmarks": 1199, "navigate": 1200, "v0": 1201, "results": 1202, "once": 1203, "completes": 1204, "dashboard": 1205, "hud": 1206, "reponame": 1207, "2fvllm": 1208, "corresponding": 1209, "comparison": 1210, "compare": 1211, "verify": 1212, "occurred": 1213, "example": 1214, "vs": 1215, "starttime": 1216, "thu": 1217, "2c": 1218, "2017": 1219, "20apr": 1220, "202025": 1221, "2021": 1222, "3a43": 1223, "3a50": 1224, "20gmt": 1225, "stoptime": 1226, "wed": 1227, "2016": 1228, "20jul": 1229, "granularity": 1230, "week": 1231, "lbranch": 1232, "lcommit": 1233, "b6553be1bc75f046b00046a4ad7576364d03c835": 1234, "rbranch": 1235, "rcommit": 1236, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 1237, "benchmarkname": 1238, "modelname": 1239, "20models": 1240, "backendname": 1241, "20backends": 1242, "modename": 1243, "20modes": 1244, "dtypename": 1245, "20dtype": 1246, "devicename": 1247, "20devices": 1248, "archname": 1249, "20platforms": 1250, "conduct": 1251, "pledge": 1252, "members": 1253, "leaders": 1254, "participation": 1255, "harassment": 1256, "experience": 1257, "regardless": 1258, "age": 1259, "body": 1260, "size": 1261, "visible": 1262, "invisible": 1263, "disability": 1264, "ethnicity": 1265, "sex": 1266, "characteristics": 1267, "gender": 1268, "identity": 1269, "education": 1270, "socioeconomic": 1271, "nationality": 1272, "personal": 1273, "appearance": 1274, "race": 1275, "caste": 1276, "religion": 1277, "sexual": 1278, "orientation": 1279, "act": 1280, "interact": 1281, "ways": 1282, "contribute": 1283, "welcoming": 1284, "diverse": 1285, "inclusive": 1286, "healthy": 1287, "standards": 1288, "examples": 1289, "behavior": 1290, "contributes": 1291, "positive": 1292, "include": 1293, "demonstrating": 1294, "empathy": 1295, "kindness": 1296, "toward": 1297, "people": 1298, "being": 1299, "respectful": 1300, "differing": 1301, "opinions": 1302, "viewpoints": 1303, "experiences": 1304, "giving": 1305, "gracefully": 1306, "accepting": 1307, "constructive": 1308, "feedback": 1309, "responsibility": 1310, "apologizing": 1311, "those": 1312, "affected": 1313, "mistakes": 1314, "learning": 1315, "best": 1316, "individuals": 1317, "overall": 1318, "unacceptable": 1319, "sexualized": 1320, "imagery": 1321, "advances": 1322, "kind": 1323, "trolling": 1324, "insulting": 1325, "derogatory": 1326, "comments": 1327, "political": 1328, "attacks": 1329, "public": 1330, "private": 1331, "publishing": 1332, "others": 1333, "physical": 1334, "email": 1335, "without": 1336, "permission": 1337, "reasonably": 1338, "inappropriate": 1339, "professional": 1340, "setting": 1341, "enforcement": 1342, "responsibilities": 1343, "responsible": 1344, "clarifying": 1345, "enforcing": 1346, "acceptable": 1347, "take": 1348, "appropriate": 1349, "fair": 1350, "corrective": 1351, "action": 1352, "response": 1353, "deem": 1354, "threatening": 1355, "offensive": 1356, "harmful": 1357, "reject": 1358, "wiki": 1359, "edits": 1360, "aligned": 1361, "reasons": 1362, "moderation": 1363, "decisions": 1364, "scope": 1365, "applies": 1366, "within": 1367, "spaces": 1368, "individual": 1369, "representing": 1370, "posting": 1371, "social": 1372, "account": 1373, "acting": 1374, "appointed": 1375, "representative": 1376, "online": 1377, "offline": 1378, "irl": 1379, "instances": 1380, "abusive": 1381, "harassing": 1382, "otherwise": 1383, "reported": 1384, "channel": 1385, "complaints": 1386, "reviewed": 1387, "investigated": 1388, "promptly": 1389, "fairly": 1390, "obligated": 1391, "respect": 1392, "privacy": 1393, "reporter": 1394, "incident": 1395, "guidelines": 1396, "follow": 1397, "impact": 1398, "determining": 1399, "consequences": 1400, "violation": 1401, "correction": 1402, "deemed": 1403, "unprofessional": 1404, "unwelcome": 1405, "consequence": 1406, "written": 1407, "clarity": 1408, "around": 1409, "nature": 1410, "explanation": 1411, "why": 1412, "apology": 1413, "requested": 1414, "series": 1415, "continued": 1416, "interaction": 1417, "unsolicited": 1418, "specified": 1419, "period": 1420, "includes": 1421, "avoiding": 1422, "interactions": 1423, "well": 1424, "external": 1425, "channels": 1426, "violating": 1427, "terms": 1428, "lead": 1429, "permanent": 1430, "ban": 1431, "serious": 1432, "sustained": 1433, "communication": 1434, "during": 1435, "pattern": 1436, "aggression": 1437, "disparagement": 1438, "classes": 1439, "attribution": 1440, "contributor": 1441, "covenant": 1442, "code_of_conduct": 1443, "were": 1444, "inspired": 1445, "mozilla": 1446, "ladder": 1447, "inclusion": 1448, "answers": 1449, "faq": 1450, "translations": 1451, "traceback": 1452, "typing": 1453, "callable": 1454, "unittest": 1455, "mock": 1456, "find_cuda_init": 1457, "fn": 1458, "object": 1459, "helper": 1460, "function": 1461, "initialization": 1462, "errors": 1463, "initializes": 1464, "prints": 1465, "stack": 1466, "trace": 1467, "happens": 1468, "_lazy_init": 1469, "wrapper": 1470, "nonlocal": 1471, "extract_stack": 1472, "initialized": 1473, "format_list": 1474, "__main__": 1475, "import_module": 1476, "policy": 1477, "reporting": 1478, "report": 1479, "privately": 1480, "vulnerability": 1481, "submission": 1482, "form": 1483, "triage": 1484, "reports": 1485, "triaged": 1486, "vulnerability_management": 1487, "threat": 1488, "guide": 1489, "usage": 1490, "assumptions": 1491, "recommendations": 1492, "securely": 1493, "severity": 1494, "risk": 1495, "taking": 1496, "dealing": 1497, "past": 1498, "defaults": 1499, "cases": 1500, "categories": 1501, "vulnerabilities": 1502, "allow": 1503, "attackers": 1504, "execute": 1505, "arbitrary": 1506, "control": 1507, "significantly": 1508, "compromise": 1509, "confidentiality": 1510, "integrity": 1511, "privileges": 1512, "needed": 1513, "network": 1514, "deserialization": 1515, "exploit": 1516, "chains": 1517, "generally": 1518, "rated": 1519, "cvss": 1520, "flaws": 1521, "elevated": 1522, "rce": 1523, "contexts": 1524, "significant": 1525, "loss": 1526, "require": 1527, "advanced": 1528, "conditions": 1529, "some": 1530, "trust": 1531, "modes": 1532, "node": 1533, "privileged": 1534, "scores": 1535, "moderate": 1536, "cause": 1537, "denial": 1538, "service": 1539, "partial": 1540, "disruption": 1541, "do": 1542, "breach": 1543, "rating": 1544, "low": 1545, "informational": 1546, "non": 1547, "exploitable": 1548, "weaknesses": 1549, "privilege": 1550, "negligible": 1551, "side": 1552, "collisions": 1553, "often": 1554, "less": 1555, "than": 1556, "prenotification": 1557, "certain": 1558, "prenotify": 1559, "vendors": 1560, "ship": 1561, "purpose": 1562, "coordinated": 1563, "notification": 1564, "adding": 1565, "contacts": 1566, "advisory": 1567, "few": 1568, "added": 1569, "send": 1570, "vendor": 1571, "analyzed": 1572, "case": 1573, "withdraw": 1574, "receiving": 1575, "prenotifications": 1576, "membership": 1577, "refinements": 1578, "who": 1579, "argparse": 1580, "hipify": 1581, "hipify_python": 1582, "vllm_max_size_mb": 1583, "defaulting": 1584, "400": 1585, "mib": 1586, "quota": 1587, "wisely": 1588, "3792": 1589, "sync": 1590, "one": 1591, "dockerfile": 1592, "print_top_10_largest_files": 1593, "zip_file": 1594, "top": 1595, "largest": 1596, "given": 1597, "zip": 1598, "file_sizes": 1599, "getinfo": 1600, "file_size": 1601, "namelist": 1602, "reverse": 1603, "1024": 1604, "2f": 1605, "mbs": 1606, "uncompressed": 1607, "check_wheel_size": 1608, "whl": 1609, "walk": 1610, "file_name": 1611, "endswith": 1612, "wheel_size_mb": 1613, "getsize": 1614, "larger": 1615, "mb": 1616, "limit": 1617, "template": 1618, "doctype": 1619, "h1": 1620, "links": 1621, "wheel_html_escaped": 1622, "br": 1623, "parser": 1624, "argumentparser": 1625, "add_argument": 1626, "help": 1627, "args": 1628, "parse_args": 1629, "generated": 1630, "cloudfront": 1631, "requires": 1632, "escaping": 1633, "character": 1634, "2b": 1635, "suite": 1636, "introduction": 1637, "two": 1638, "sets": 1639, "workload": 1640, "developers": 1641, "gain": 1642, "whether": 1643, "improves": 1644, "degrades": 1645, "alternatives": 1646, "tgi": 1647, "trt": 1648, "lmdeploy": 1649, "know": 1650, "choose": 1651, "readme": 1652, "quick": 1653, "overview": 1654, "benchmarking": 1655, "latency": 1656, "fix": 1657, "qps": 1658, "a100": 1659, "coming": 1660, "xeon": 1661, "processors": 1662, "different": 1663, "duration": 1664, "1hr": 1665, "constraint": 1666, "hr": 1667, "won": 1668, "forever": 1669, "8b": 1670, "70b": 1671, "8x7b": 1672, "engines": 1673, "5hrs": 1674, "perf": 1675, "label": 1676, "ready": 1677, "manually": 1678, "buildkite": 1679, "scripts": 1680, "sh": 1681, "variables": 1682, "on_cpu": 1683, "serving_json": 1684, "tests": 1685, "latency_json": 1686, "throughput_json": 1687, "throughout": 1688, "remote_host": 1689, "ip": 1690, "remote_port": 1691, "port": 1692, "descriptions": 1693, "detailed": 1694, "instead": 1695, "inside": 1696, "test_name": 1697, "latency_llama8b_tp1": 1698, "parameters": 1699, "tensor_parallel_size": 1700, "load_format": 1701, "dummy": 1702, "num_iters_warmup": 1703, "num_iters": 1704, "attributes": 1705, "unique": 1706, "must": 1707, "latency_": 1708, "attribute": 1709, "arguments": 1710, "bench": 1711, "underline": 1712, "dash": 1713, "specifying": 1714, "convert": 1715, "feeding": 1716, "load": 1717, "num": 1718, "iters": 1719, "warmup": 1720, "numbers": 1721, "highly": 1722, "sensitive": 1723, "correctly": 1724, "script": 1725, "save": 1726, "itself": 1727, "parameter": 1728, "syntax": 1729, "fed": 1730, "forward": 1731, "slight": 1732, "vary": 1733, "lot": 1734, "rate": 1735, "inf": 1736, "cover": 1737, "serving_llama8b_tp1_sharegpt": 1738, "qps_list": 1739, "server_parameters": 1740, "swap_space": 1741, "disable_log_stats": 1742, "client_parameters": 1743, "backend": 1744, "dataset_name": 1745, "sharegpt": 1746, "dataset_path": 1747, "sharegpt_v3_unfiltered_cleaned_split": 1748, "num_prompts": 1749, "serving_": 1750, "client": 1751, "controls": 1752, "compared": 1753, "delay": 1754, "due": 1755, "randomized": 1756, "dataset": 1757, "benchmark_serving": 1758, "still": 1759, "greatly": 1760, "saving": 1761, "related": 1762, "visualizing": 1763, "markdown": 1764, "helps": 1765, "put": 1766, "table": 1767, "formatting": 1768, "real": 1769, "result": 1770, "presented": 1771, "job": 1772, "page": 1773, "wait": 1774, "till": 1775, "finish": 1776, "running": 1777, "together": 1778, "attached": 1779, "artifacts": 1780, "tab": 1781, "converted": 1782, "generates": 1783, "folder": 1784, "along": 1785, "benchmark_results": 1786, "compares": 1787, "provides": 1788, "ratio": 1789, "tput": 1790, "median": 1791, "ttft": 1792, "tpot": 1793, "passed": 1794, "tp": 1795, "pp": 1796, "result_a": 1797, "result_b": 1798, "input": 1799, "lenght": 1800, "concurrency": 1801, "python3": 1802, "results_a": 1803, "results_b": 1804, "perf_ratio": 1805, "instruct": 1806, "random": 1807, "128": 1808, "1000": 1809, "142": 1810, "633982": 1811, "156": 1812, "526018": 1813, "097396": 1814, "241": 1815, "620334": 1816, "294": 1817, "018783": 1818, "216863": 1819, "diagram": 1820, "96c": 1821, "results_gnr_96c_091_tp2pp3": 1822, "128c": 1823, "results_gnr_128c_091_tp2pp3": 1824, "1886": 1825, "height": 1826, "828": 1827, "image": 1828, "attachments": 1829, "c02a43ef": 1830, "25d0": 1831, "4fd6": 1832, "90e5": 1833, "2169a28682dd": 1834, "description": 1835, "containers": 1836, "yaml": 1837, "specifies": 1838, "container": 1839, "probe": 1840, "engine": 1841, "described": 1842, "launch": 1843, "last": 1844, "collect": 1845, "plot": 1846, "commands": 1847, "hard": 1848, "coded": 1849, "several": 1850, "populating": 1851, "updating": 1852, "protobuf": 1853, "tensorrt": 1854, "demo": 1855, "neuralmagic": 1856, "annotation": 1857, "link": 1858, "artifact": 1859, "download": 1860, "visualization": 1861, "reproduction": 1862, "deploy": 1863, "export": 1864, "hf_token": 1865, "hf": 1866, "token": 1867, "apt": 1868, "unzip": 1869, "vllm_source_code_loc": 1870, "aims": 1871, "provide": 1872, "sglang": 1873, "leads": 1874, "reproducible": 1875, "reproducing": 1876, "instructions": 1877, "scroll": 1878, "guilde": 1879, "8176": 1880, "images": 1881, "lmsysorg": 1882, "cu121": 1883, "openmmlab": 1884, "cu12": 1885, "nvcr": 1886, "io": 1887, "tritonserver": 1888, "24": 1889, "trtllm": 1890, "py3": 1891, "r24": 1892, "implementation": 1893, "works": 1894, "going": 1895, "bump": 1896, "up": 1897, "concrete": 1898, "specs": 1899, "8x": 1900, "heavy": 1901, "average": 1902, "462": 1903, "tokens": 1904, "256": 1905, "datasets": 1906, "2105": 1907, "query": 1908, "per": 1909, "32": 1910, "queries": 1911, "randomly": 1912, "sampled": 1913, "arrival": 1914, "patterns": 1915, "determined": 1916, "poisson": 1917, "fixed": 1918, "seed": 1919, "evaluation": 1920, "metrics": 1921, "higher": 1922, "better": 1923, "itl": 1924, "inter": 1925, "known": 1926, "ignore": 1927, "eos": 1928, "flag": 1929, "length": 1930, "batch": 1931, "mean": 1932, "p99": 1933, "latency_tests_markdown_table": 1934, "sample": 1935, "prompts": 1936, "dynamically": 1937, "achieve": 1938, "maximum": 1939, "throughput_tests_markdown_table": 1940, "means": 1941, "come": 1942, "values": 1943, "100": 1944, "serving_tests_markdown_table": 1945, "platform_markdown_table": 1946, "tables": 1947, "section": 1948, "above": 1949, "pandas": 1950, "dataframes": 1951, "follows": 1952, "pd": 1953, "benchmarking_results_json": 1954, "benchmarking_results": 1955, "latency_results": 1956, "dataframe": 1957, "from_dict": 1958, "throughput_results": 1959, "serving_results": 1960, "benchmarking_results_in_json_string": 1961, "experiment": 1962, "numpy": 1963, "np": 1964, "tabulate": 1965, "parse_arguments": 1966, "stored": 1967, "get_perf": 1968, "df": 1969, "method": 1970, "metric": 1971, "qps_": 1972, "filtered_df": 1973, "array": 1974, "get_perf_w_std": 1975, "ms": 1976, "tolist": 1977, "std": 1978, "success": 1979, "successful": 1980, "sqrt": 1981, "tok": 1982, "results_folder": 1983, "test_file": 1984, "_nightly_results": 1985, "generate": 1986, "md_table": 1987, "headers": 1988, "keys": 1989, "tablefmt": 1990, "pipe": 1991, "showindex": 1992, "nightly_results_benchmarking_table": 1993, "nightly_results": 1994, "transformers": 1995, "autotokenizer": 1996, "cachedir": 1997, "tokenizer": 1998, "from_pretrained": 1999, "save_pretrained": 2000, "saved": 2001, "api_client": 2002, "apiclient": 2003, "http": 2004, "localhost": 2005, "8000": 2006, "model_name": 2007, "available_models": 2008, "compare_data_columns": 2009, "name_column": 2010, "data_column": 2011, "info_cols": 2012, "drop_column": 2013, "ncompare_data_column": 2014, "frames": 2015, "raw_data_cols": 2016, "compare_frames": 2017, "data_df": 2018, "read_json": 2019, "serving_df": 2020, "dropna": 2021, "subset": 2022, "ignore_index": 2023, "columns": 2024, "couple": 2025, "col": 2026, "column": 2027, "mode": 2028, "rename": 2029, "_name": 2030, "among": 2031, "ratio_df": 2032, "pop": 2033, "concat_df": 2034, "concat": 2035, "axis": 2036, "split_json_by_tp_pp": 2037, "input_file": 2038, "output_root": 2039, "separate": 2040, "creates": 2041, "_pp": 2042, "paths": 2043, "encoding": 2044, "isinstance": 2045, "break": 2046, "handle": 2047, "alias": 2048, "names": 2049, "rename_map": 2050, "tp_size": 2051, "pp_size": 2052, "pipeline_parallel_size": 2053, "items": 2054, "inplace": 2055, "numeric": 2056, "ints": 2057, "nan": 2058, "to_numeric": 2059, "coerce": 2060, "fillna": 2061, "astype": 2062, "saved_paths": 2063, "group_df": 2064, "groupby": 2065, "folder_name": 2066, "filepath": 2067, "to_json": 2068, "orient": 2069, "records": 2070, "indent": 2071, "force_ascii": 2072, "datetime": 2073, "serving_column_mapping": 2074, "gpu_type": 2075, "completed": 2076, "request_throughput": 2077, "mean_ttft_ms": 2078, "std_ttft_ms": 2079, "median_ttft_ms": 2080, "mean_itl_ms": 2081, "std_itl_ms": 2082, "median_itl_ms": 2083, "mean_tpot_ms": 2084, "std_tpot_ms": 2085, "median_tpot_ms": 2086, "total_token_throughput": 2087, "total": 2088, "output_throughput": 2089, "total_input_tokens": 2090, "total_output_tokens": 2091, "shlex": 2092, "psutil": 2093, "regex": 2094, "latency_column_mapping": 2095, "avg_latency": 2096, "p10": 2097, "p25": 2098, "p50": 2099, "p75": 2100, "p90": 2101, "throughput_results_column_mapping": 2102, "num_requests": 2103, "total_num_tokens": 2104, "elapsed_time": 2105, "elapsed": 2106, "requests_per_second": 2107, "tokens_per_second": 2108, "model_id": 2109, "input_len": 2110, "output_len": 2111, "dtype": 2112, "max_concurrency": 2113, "p99_ttft_ms": 2114, "p99_tpot_ms": 2115, "p99_itl_ms": 2116, "read_markdown": 2117, "found": 2118, "results_to_json": 2119, "dumps": 2120, "to_dict": 2121, "get_size_with_unit": 2122, "bytes": 2123, "suffix": 2124, "1253656": 2125, "20mb": 2126, "1253656678": 2127, "17gb": 2128, "factor": 2129, "unit": 2130, "_coerce": 2131, "val": 2132, "effort": 2133, "coercion": 2134, "types": 2135, "null": 2136, "integers": 2137, "fullmatch": 2138, "floats": 2139, "strings": 2140, "float": 2141, "parse_client_command": 2142, "cmd": 2143, "client_command": 2144, "toks": 2145, "while": 2146, "boolean": 2147, "metadata": 2148, "consume": 2149, "pairs": 2150, "until": 2151, "next": 2152, "pair": 2153, "lone": 2154, "unexpected": 2155, "positional": 2156, "executab": 2157, "le": 2158, "lm": 2159, "eval": 2160, "harness": 2161, "baseline": 2162, "computed": 2163, "pytest": 2164, "test_lm_eval_correctness": 2165, "config": 2166, "small": 2167, "lm_eval": 2168, "rtol": 2169, "launch_lm_eval": 2170, "eval_config": 2171, "trust_remote_code": 2172, "max_model_len": 2173, "4096": 2174, "model_args": 2175, "pretrained": 2176, "enforce_eager": 2177, "add_bos_token": 2178, "simple_evaluate": 2179, "tasks": 2180, "task": 2181, "num_fewshot": 2182, "batch_size": 2183, "auto": 2184, "test_lm_eval_correctness_param": 2185, "config_filename": 2186, "safe_load": 2187, "read_text": 2188, "ground_truth": 2189, "measured_value": 2190, "measured": 2191, "isclose": 2192, "pytest_addoption": 2193, "addoption": 2194, "store": 2195, "listing": 2196, "yamls": 2197, "fixture": 2198, "session": 2199, "config_list_file": 2200, "pytestconfig": 2201, "config_dir": 2202, "rel_path": 2203, "getoption": 2204, "pytest_generate_tests": 2205, "metafunc": 2206, "fixturenames": 2207, "resolve": 2208, "parametrize": 2209, "specialized": 2210, "reads": 2211, "splits": 2212, "nightly_torch_test": 2213, "torch_nightly_test": 2214, "packages": 2215, "output_file": 2216, "white": 2217, "directly": 2218, "add": 2219, "dependency": 2220, "fails": 2221, "white_list": 2222, "torchaudio": 2223, "torchvision": 2224, "mamba_ssm": 2225, "skip_next": 2226, "__future__": 2227, "annotations": 2228, "forbidden_patterns": 2229, "allowed_patterns": 2230, "get_staged_python_files": 2231, "diff": 2232, "cached": 2233, "am": 2234, "is_forbidden_import": 2235, "check_file": 2236, "tuple": 2237, "violations": 2238, "line_num": 2239, "enumerate": 2240, "unicodedecodeerror": 2241, "total_violations": 2242, "noqa": 2243, "e501": 2244, "imports": 2245, "ast": 2246, "collections": 2247, "abc": 2248, "iterable": 2249, "_is_internal": 2250, "_fail": 2251, "disallowed": 2252, "eager": 2253, "stderr": 2254, "lineno": 2255, "msg": 2256, "init_path": 2257, "visitor": 2258, "nodevisitor": 2259, "_in_type_checking": 2260, "visit_if": 2261, "guard_is_type_checking": 2262, "attr": 2263, "type_checking": 2264, "prev": 2265, "child": 2266, "orelse": 2267, "generic_visit": 2268, "visit_import": 2269, "allowed_imports": 2270, "visit_importfrom": 2271, "importfrom": 2272, "module_as_written": 2273, "allowed_from_modules": 2274, "multiprocessing": 2275, "get_python_executable": 2276, "get_cpu_cores": 2277, "cores": 2278, "generate_presets": 2279, "output_path": 2280, "cmakeuserpresets": 2281, "attempting": 2282, "detect": 2283, "nvcc_path": 2284, "prospective_path": 2285, "nvcc_path_input": 2286, "automatically": 2287, "usr": 2288, "python_executable": 2289, "python_executable_prompt": 2290, "virtual": 2291, "home": 2292, "venvs": 2293, "cpu_cores": 2294, "min": 2295, "cmake_jobs": 2296, "detected": 2297, "assuming": 2298, "tools": 2299, "project_root": 2300, "resolvable": 2301, "isabs": 2302, "cache_variables": 2303, "cmake_cuda_compiler": 2304, "vllm_python_executable": 2305, "cmake_install_prefix": 2306, "sourcedir": 2307, "cmake_cuda_flags": 2308, "compiler": 2309, "cache": 2310, "launcher": 2311, "cxx": 2312, "cmake_": 2313, "_compiler_launcher": 2314, "configure_preset": 2315, "binarydir": 2316, "cachevariables": 2317, "generator": 2318, "cmake_job_pools": 2319, "slower": 2320, "presets": 2321, "cmakeminimumrequired": 2322, "26": 2323, "configurepresets": 2324, "buildpresets": 2325, "configurepreset": 2326, "output_file_path": 2327, "overwrite": 2328, "generation": 2329, "cancelled": 2330, "dump": 2331, "nto": 2332, "preset": 2333, "cd": 2334, "initialize": 2335, "writing": 2336, "errno": 2337, "fnmatch": 2338, "defaultdict": 2339, "long_count": 2340, "long_ext_count": 2341, "represents": 2342, "ninja_log": 2343, "passing": 2344, "times": 2345, "seconds": 2346, "appended": 2347, "owner": 2348, "weighted_duration": 2349, "setweightedduration": 2350, "weightedduration": 2351, "weighted": 2352, "takes": 2353, "divides": 2354, "many": 2355, "thus": 2356, "approximate": 2357, "serialized": 2358, "serializing": 2359, "steps": 2360, "ending": 2361, "much": 2362, "longer": 2363, "durations": 2364, "always": 2365, "shorter": 2366, "modest": 2367, "floating": 2368, "point": 2369, "epsilon": 2370, "000002": 2371, "describetargets": 2372, "printable": 2373, "summarizes": 2374, "dozens": 2375, "sanely": 2376, "max_length": 2377, "chosen": 2378, "fit": 2379, "long": 2380, "minimizing": 2381, "word": 2382, "wrapping": 2383, "65": 2384, "readtargets": 2385, "log": 2386, "show_all": 2387, "log_file": 2388, "sorted": 2389, "objects": 2390, "header": 2391, "readline": 2392, "v5": 2393, "unrecognized": 2394, "targets_dict": 2395, "last_end_seen": 2396, "parts": 2397, "exe": 2398, "rudely": 2399, "halted": 2400, "corrupt": 2401, "silently": 2402, "cmdhash": 2403, "restart": 2404, "integral": 2405, "milliseconds": 2406, "earlier": 2407, "stamp": 2408, "possibly": 2409, "incremental": 2410, "throw": 2411, "away": 2412, "displayed": 2413, "independently": 2414, "comparing": 2415, "because": 2416, "guaranteed": 2417, "row": 2418, "go": 2419, "however": 2420, "repeated": 2421, "changed": 2422, "stop": 2423, "points": 2424, "identified": 2425, "reset": 2426, "dictionary": 2427, "getextension": 2428, "extra_patterns": 2429, "important": 2430, "canonical": 2431, "ultimately": 2432, "goal": 2433, "fn_pattern": 2434, "good": 2435, "grouping": 2436, "type_mappings": 2437, "capture": 2438, "javac": 2439, "jar": 2440, "distinguished": 2441, "interface": 2442, "ext1": 2443, "splitext": 2444, "ext2": 2445, "preserve": 2446, "pdb": 2447, "dll": 2448, "pefile": 2449, "linking": 2450, "grouped": 2451, "don": 2452, "listed": 2453, "toc": 2454, "attempt": 2455, "identify": 2456, "identifying": 2457, "obj": 2458, "categorized": 2459, "mojo": 2460, "jars": 2461, "java": 2462, "normalize": 2463, "mojom": 2464, "summarizeentries": 2465, "entries": 2466, "extra_step_types": 2467, "beginning": 2468, "starting": 2469, "stopping": 2470, "exactly": 2471, "iterate": 2472, "keeping": 2473, "calculate": 2474, "ends": 2475, "own": 2476, "easily": 2477, "calculated": 2478, "task_start_stop_times": 2479, "earliest": 2480, "total_cpu_time": 2481, "weighted_total": 2482, "happen": 2483, "starts": 2484, "stops": 2485, "alphabet": 2486, "making": 2487, "currently": 2488, "running_tasks": 2489, "record": 2490, "processed": 2491, "deltas": 2492, "last_time": 2493, "accumulated": 2494, "efficiently": 2495, "last_weighted_time": 2496, "scan": 2497, "events": 2498, "action_name": 2499, "accumulate": 2500, "num_running": 2501, "running_": 2502, "moment": 2503, "ran": 2504, "del": 2505, "warn": 2506, "sum": 2507, "off": 2508, "half": 2509, "500": 2510, "possible": 2511, "untrustworthy": 2512, "3f": 2513, "entries_by_ext": 2514, "longest": 2515, "1f": 2516, "dest": 2517, "build_directory": 2518, "semicolon": 2519, "separated": 2520, "analyze": 2521, "_extra_args": 2522, "parse_known_args": 2523, "step_types": 2524, "room": 2525, "extra": 2526, "global": 2527, "enoent": 2528, "forbidden_import_re": 2529, "triton": 2530, "allowed_lines": 2531, "triton_utils": 2532, "tl": 2533, "allowed_files": 2534, "importing": 2535, "is_allowed_file": 2536, "current_file": 2537, "stripped": 2538, "parse_diff": 2539, "current_lineno": 2540, "skip_allowed_file": 2541, "splitlines": 2542, "code_line": 2543, "get_diff": 2544, "diff_type": 2545, "staged": 2546, "unified": 2547, "unstaged": 2548, "all_violations": 2549, "diff_output": 2550, "extend": 2551, "forbidden": 2552, "direct": 2553, "pickle": 2554, "serial_utils": 2555, "executor": 2556, "multiproc_executor": 2557, "hasher": 2558, "transformers_utils": 2559, "registry": 2560, "utils_": 2561, "test_utils": 2562, "tokenization": 2563, "test_cached_tokenizer": 2564, "parallel_state": 2565, "device_communicators": 2566, "custom_all_reduce_utils": 2567, "shm_broadcast": 2568, "graph_machete_bench": 2569, "benchmark_lora": 2570, "benchmark_machete": 2571, "fused_kernels": 2572, "layernorm_rms_benchmarks": 2573, "cutlass_benchmarks": 2574, "w8a8_benchmarks": 2575, "sparse_benchmarks": 2576, "cloudpickle": 2577, "worker": 2578, "worker_base": 2579, "mp_distributed_executor": 2580, "ray_distributed_executor": 2581, "entrypoints": 2582, "pickle_re": 2583, "sas": 2584, "is_python_file": 2585, "scan_file": 2586, "load_gitignore": 2587, "repo_root": 2588, "gitignore_path": 2589, "gitignore": 2590, "pathspec": 2591, "from_lines": 2592, "gitwildmatch": 2593, "bad_files": 2594, "dirpath": 2595, "filenames": 2596, "abs_path": 2597, "relpath": 2598, "ignored": 2599, "match_file": 2600, "nerror": 2601, "nif": 2602, "intentional": 2603, "check_pickle_imports": 2604, "test_regex": 2605, "test_cases": 2606, "pkl": 2607, "cpkl": 2608, "timport": 2609, "somethingelse": 2610, "pickleas": 2611, "asdf": 2612, "should_match": 2613, "expected": 2614, "got": 2615, "enum": 2616, "spdxstatus": 2617, "enumeration": 2618, "missing_license": 2619, "missing_copyright": 2620, "missing_both": 2621, "full_spdx_header": 2622, "license_line": 2623, "copyright_line": 2624, "check_spdx_header_status": 2625, "file_path": 2626, "shebang": 2627, "start_idx": 2628, "has_license": 2629, "has_copyright": 2630, "completely": 2631, "add_header": 2632, "supplement": 2633, "seek": 2634, "truncate": 2635, "writelines": 2636, "insert": 2637, "files_missing_both": 2638, "files_missing_copyright": 2639, "files_missing_license": 2640, "fixing": 2641, "all_files_to_fix": 2642, "inspect": 2643, "get_attr_docs": 2644, "cls_node": 2645, "classdef": 2646, "docstrings": 2647, "placed": 2648, "assignments": 2649, "davidism": 2650, "mit": 2651, "pairwise": 2652, "implement": 2653, "itertools": 2654, "dropped": 2655, "iterator": 2656, "iter": 2657, "yield": 2658, "consider": 2659, "nodes": 2660, "assignment": 2661, "constant": 2662, "assign": 2663, "annassign": 2664, "expr": 2665, "doc": 2666, "cleandoc": 2667, "annotated": 2668, "assigning": 2669, "plain": 2670, "configvalidator": 2671, "visit_classdef": 2672, "validate": 2673, "dataclass": 2674, "decorators": 2675, "decorator_list": 2676, "call": 2677, "func": 2678, "validate_class": 2679, "fail": 2680, "decorator": 2681, "class_node": 2682, "attr_docs": 2683, "stmt": 2684, "field": 2685, "classvar": 2686, "dataclasses": 2687, "subscript": 2688, "field_name": 2689, "docstring": 2690, "union": 2691, "slice": 2692, "elts": 2693, "literal_args": 2694, "arg": 2695, "literal": 2696, "literal1": 2697, "literal2": 2698, "validate_ast": 2699, "validate_file": 2700, "validating": 2701, "systemexit": 2702, "message": 2703, "cluster": 2704, "2412": 2705, "19437": 2706, "way": 2707, "sparse": 2708, "moe": 2709, "experts": 2710, "beyond": 2711, "normal": 2712, "impossible": 2713, "bundle": 2714, "down": 2715, "pplx": 2716, "ppl": 2717, "deepep": 2718, "necessary": 2719, "nvshmem": 2720, "ibgda": 2721, "host": 2722, "machine": 2723, "accept": 2724, "argument": 2725, "workspace": 2726, "staging": 2727, "pwd": 2728, "ep_kernels_workspace": 2729, "hopper": 2730, "torch_cuda_arch_list": 2731, "install_python_libraries": 2732, "blackwell": 2733, "additional": 2734, "sudo": 2735, "configure_system_drivers": 2736, "reboot": 2737, "profiler": 2738, "layerwise_profile": 2739, "modelstatsentry": 2740, "summarystatsentry": 2741, "tableprinter": 2742, "indent_string": 2743, "flatten_entries": 2744, "entry_cls": 2745, "profile_dict": 2746, "entries_and_depth": 2747, "get_entries": 2748, "curr_depth": 2749, "entry": 2750, "children": 2751, "math": 2752, "matplotlib": 2753, "pyplot": 2754, "plt": 2755, "largest_dist_from_leaf": 2756, "depth": 2757, "get_entries_at_depth": 2758, "entries_and_traces": 2759, "kernel": 2760, "tall": 2761, "enough": 2762, "fold_nodes": 2763, "nodes_to_fold": 2764, "trim_string_back": 2765, "offset": 2766, "shorten_plot_legend_strings": 2767, "legend": 2768, "max_char_len": 2769, "get_texts": 2770, "set_text": 2771, "abbreviate_known_names": 2772, "get_text": 2773, "abbreviations": 2774, "mergedcolumnparallellinear": 2775, "mcplinear": 2776, "qkvparallellinear": 2777, "qkvplinear": 2778, "rowparallellinear": 2779, "rplinear": 2780, "weight": 2781, "bfloat16": 2782, "bf16": 2783, "float16": 2784, "f16": 2785, "attempt_to_make_names_unique": 2786, "non_unique_names": 2787, "all_the_same": 2788, "entries_and_traces_with_name": 2789, "zipped_traces": 2790, "first_trace_difference": 2791, "trace_eles": 2792, "leave": 2793, "aggregated": 2794, "pivot_table": 2795, "group_trace_by_operations": 2796, "trace_df": 2797, "is_rms_norm": 