{"vllm": 0, "code": 1, "conduct": 2, "our": 3, "pledge": 4, "we": 5, "members": 6, "contributors": 7, "leaders": 8, "make": 9, "participation": 10, "community": 11, "harassment": 12, "free": 13, "experience": 14, "everyone": 15, "regardless": 16, "age": 17, "body": 18, "size": 19, "visible": 20, "invisible": 21, "disability": 22, "ethnicity": 23, "sex": 24, "characteristics": 25, "gender": 26, "identity": 27, "expression": 28, "level": 29, "education": 30, "socioeconomic": 31, "status": 32, "nationality": 33, "personal": 34, "appearance": 35, "race": 36, "caste": 37, "color": 38, "religion": 39, "sexual": 40, "orientation": 41, "act": 42, "interact": 43, "ways": 44, "contribute": 45, "open": 46, "welcoming": 47, "diverse": 48, "inclusive": 49, "healthy": 50, "standards": 51, "examples": 52, "behavior": 53, "contributes": 54, "positive": 55, "environment": 56, "include": 57, "demonstrating": 58, "empathy": 59, "kindness": 60, "toward": 61, "other": 62, "people": 63, "being": 64, "respectful": 65, "differing": 66, "opinions": 67, "viewpoints": 68, "experiences": 69, "giving": 70, "gracefully": 71, "accepting": 72, "constructive": 73, "feedback": 74, "responsibility": 75, "apologizing": 76, "those": 77, "affected": 78, "mistakes": 79, "learning": 80, "from": 81, "focusing": 82, "what": 83, "best": 84, "just": 85, "us": 86, "individuals": 87, "overall": 88, "unacceptable": 89, "use": 90, "sexualized": 91, "language": 92, "imagery": 93, "attention": 94, "advances": 95, "any": 96, "kind": 97, "trolling": 98, "insulting": 99, "derogatory": 100, "comments": 101, "political": 102, "attacks": 103, "public": 104, "private": 105, "publishing": 106, "others": 107, "information": 108, "physical": 109, "email": 110, "address": 111, "without": 112, "explicit": 113, "permission": 114, "which": 115, "could": 116, "reasonably": 117, "considered": 118, "inappropriate": 119, "professional": 120, "setting": 121, "enforcement": 122, "responsibilities": 123, "responsible": 124, "clarifying": 125, "enforcing": 126, "acceptable": 127, "take": 128, "appropriate": 129, "fair": 130, "corrective": 131, "action": 132, "response": 133, "deem": 134, "threatening": 135, "offensive": 136, "harmful": 137, "have": 138, "right": 139, "remove": 140, "edit": 141, "reject": 142, "commits": 143, "wiki": 144, "edits": 145, "issues": 146, "contributions": 147, "aligned": 148, "communicate": 149, "reasons": 150, "moderation": 151, "decisions": 152, "when": 153, "scope": 154, "applies": 155, "within": 156, "all": 157, "spaces": 158, "also": 159, "individual": 160, "officially": 161, "representing": 162, "using": 163, "official": 164, "posting": 165, "via": 166, "social": 167, "media": 168, "account": 169, "acting": 170, "appointed": 171, "representative": 172, "online": 173, "offline": 174, "irl": 175, "event": 176, "instances": 177, "abusive": 178, "harassing": 179, "otherwise": 180, "may": 181, "reported": 182, "channel": 183, "slack": 184, "https": 185, "ai": 186, "complaints": 187, "reviewed": 188, "investigated": 189, "promptly": 190, "fairly": 191, "obligated": 192, "respect": 193, "privacy": 194, "security": 195, "reporter": 196, "incident": 197, "guidelines": 198, "follow": 199, "impact": 200, "determining": 201, "consequences": 202, "violation": 203, "correction": 204, "deemed": 205, "unprofessional": 206, "unwelcome": 207, "consequence": 208, "written": 209, "warning": 210, "providing": 211, "clarity": 212, "around": 213, "nature": 214, "explanation": 215, "why": 216, "apology": 217, "requested": 218, "through": 219, "single": 220, "series": 221, "actions": 222, "continued": 223, "interaction": 224, "involved": 225, "including": 226, "unsolicited": 227, "specified": 228, "period": 229, "time": 230, "includes": 231, "avoiding": 232, "interactions": 233, "well": 234, "external": 235, "channels": 236, "like": 237, "violating": 238, "terms": 239, "lead": 240, "temporary": 241, "permanent": 242, "ban": 243, "serious": 244, "sustained": 245, "sort": 246, "communication": 247, "allowed": 248, "during": 249, "pattern": 250, "aggression": 251, "disparagement": 252, "classes": 253, "attribution": 254, "adapted": 255, "contributor": 256, "covenant": 257, "www": 258, "org": 259, "version": 260, "available": 261, "v2": 262, "code_of_conduct": 263, "html": 264, "were": 265, "inspired": 266, "mozilla": 267, "ladder": 268, "github": 269, "com": 270, "inclusion": 271, "answers": 272, "common": 273, "questions": 274, "about": 275, "see": 276, "faq": 277, "translations": 278, "contributing": 279, "you": 280, "find": 281, "docs": 282, "en": 283, "latest": 284, "markdownlint": 285, "disable": 286, "md001": 287, "md041": 288, "align": 289, "center": 290, "picture": 291, "source": 292, "prefers": 293, "scheme": 294, "dark": 295, "srcset": 296, "raw": 297, "githubusercontent": 298, "project": 299, "main": 300, "assets": 301, "logos": 302, "logo": 303, "text": 304, "png": 305, "img": 306, "alt": 307, "src": 308, "light": 309, "width": 310, "55": 311, "h3": 312, "easy": 313, "fast": 314, "cheap": 315, "llm": 316, "serving": 317, "href": 318, "documentation": 319, "blog": 320, "arxiv": 321, "abs": 322, "2309": 323, "06180": 324, "paper": 325, "vllm_project": 326, "twitter": 327, "discuss": 328, "user": 329, "forum": 330, "developer": 331, "news": 332, "2025": 333, "08": 334, "hosted": 335, "beijing": 336, "meetup": 337, "mp": 338, "weixin": 339, "qq": 340, "dgkwg1wfpwgo2jcdtqqhxa": 341, "large": 342, "scale": 343, "deployment": 344, "please": 345, "slides": 346, "here": 347, "drive": 348, "google": 349, "folders": 350, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 351, "recording": 352, "chaspark": 353, "live": 354, "1166916873711665152": 355, "05": 356, "nyc": 357, "lu": 358, "ma": 359, "c1rqyf1f": 360, "presentation": 361, "1_q_aw_iomjwuimf1s1ym": 362, "zhjxz8cuel0ijvaquoybea": 363, "usp": 364, "sharing": 365, "now": 366, "under": 367, "pytorch": 368, "foundation": 369, "announcement": 370, "welcomes": 371, "01": 372, "excited": 373, "announce": 374, "alpha": 375, "release": 376, "v1": 377, "major": 378, "architectural": 379, "upgrade": 380, "7x": 381, "speedup": 382, "clean": 383, "optimized": 384, "execution": 385, "loop": 386, "zero": 387, "overhead": 388, "prefix": 389, "caching": 390, "enhanced": 391, "multimodal": 392, "support": 393, "more": 394, "check": 395, "out": 396, "post": 397, "27": 398, "details": 399, "summary": 400, "previous": 401, "04": 402, "asia": 403, "day": 404, "sginnovate": 405, "limited": 406, "availability": 407, "morning": 408, "evening": 409, "slots": 410, "remaining": 411, "inaugural": 412, "team": 413, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 414, "03": 415, "ollama": 416, "inference": 417, "night": 418, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 419, "first": 420, "china": 421, "n77gibl2coratqhtveazfg": 422, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 423, "east": 424, "coast": 425, "7mu4k4xx": 426, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 427, "slide": 428, "id": 429, "g31441846c39_0_0": 430, "02": 431, "ninth": 432, "h7g3kuj9": 433, "meta": 434, "1jzc_pzvxrvnsfvcw": 435, "v4cfxb6pn7zz2cyp_flwo05aqg": 436, "amd": 437, "file": 438, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 439, "view": 440, "posted": 441, "eighth": 442, "zep56hui": 443, "cloud": 444, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 445, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 446, "2024": 447, "12": 448, "joins": 449, "ecosystem": 450, "11": 451, "seventh": 452, "h0qvrajz": 453, "snowflake": 454, "1e3cxqbv3jsfgp30swyvs3em_tw": 455, "ghohj9pajgk6kr54": 456, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 457, "10": 458, "created": 459, "coordinating": 460, "discussing": 461, "features": 462, "feel": 463, "join": 464, "ray": 465, "summit": 466, "held": 467, "special": 468, "track": 469, "opening": 470, "talk": 471, "1b_kqxphbtra_mdf": 472, "tr6i8rwdou5qotznceg2mkzxehm": 473, "learn": 474, "talks": 475, "youtube": 476, "playlist": 477, "list": 478, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 479, "users": 480, "09": 481, "sixth": 482, "87q3nvnh": 483, "nvidia": 484, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 485, "9wqyp7ny93xrs": 486, "07": 487, "fifth": 488, "lp0gyjqr": 489, "aws": 490, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 491, "partnership": 492, "supports": 493, "llama": 494, "fp8": 495, "quantization": 496, "pipeline": 497, "parallelism": 498, "23": 499, "llama31": 500, "06": 501, "fourth": 502, "agivllm": 503, "cloudflare": 504, "bentoml": 505, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 506, "third": 507, "robloxandvllmmeetup2024": 508, "splashthat": 509, "roblox": 510, "1a": 511, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 512, "second": 513, "ygxbpzhl": 514, "ibm": 515, "12mi2skabnuw5rbwxdyy": 516, "hthth4imsnceoq10jdqbxga": 517, "2023": 518, "a16z": 519, "1ql": 520, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 521, "would": 522, "express": 523, "sincere": 524, "gratitude": 525, "andreessen": 526, "horowitz": 527, "30": 528, "supporting": 529, "generous": 530, "grant": 531, "development": 532, "research": 533, "released": 534, "fastchat": 535, "integration": 536, "has": 537, "powered": 538, "lmsys": 539, "vicuna": 540, "chatbot": 541, "arena": 542, "chat": 543, "since": 544, "mid": 545, "april": 546, "library": 547, "originally": 548, "developed": 549, "sky": 550, "computing": 551, "lab": 552, "cs": 553, "berkeley": 554, "edu": 555, "uc": 556, "evolved": 557, "driven": 558, "both": 559, "academia": 560, "industry": 561, "state": 562, "art": 563, "throughput": 564, "efficient": 565, "management": 566, "key": 567, "value": 568, "memory": 569, "pagedattention": 570, "20": 571, "continuous": 572, "batching": 573, "incoming": 574, "requests": 575, "model": 576, "cuda": 577, "hip": 578, "graph": 579, "quantizations": 580, "gptq": 581, "2210": 582, "17323": 583, "awq": 584, "2306": 585, "00978": 586, "autoround": 587, "05516": 588, "int4": 589, "int8": 590, "kernels": 591, "flashattention": 592, "flashinfer": 593, "speculative": 594, "decoding": 595, "chunked": 596, "prefill": 597, "flexible": 598, "seamless": 599, "popular": 600, "hugging": 601, "face": 602, "models": 603, "high": 604, "various": 605, "algorithms": 606, "parallel": 607, "sampling": 608, "beam": 609, "search": 610, "tensor": 611, "data": 612, "expert": 613, "distributed": 614, "streaming": 615, "outputs": 616, "openai": 617, "compatible": 618, "api": 619, "server": 620, "gpus": 621, "cpus": 622, "intel": 623, "powerpc": 624, "tpu": 625, "neuron": 626, "multi": 627, "lora": 628, "seamlessly": 629, "most": 630, "huggingface": 631, "transformer": 632, "llms": 633, "mixture": 634, "mixtral": 635, "deepseek": 636, "v3": 637, "embedding": 638, "e5": 639, "mistral": 640, "modal": 641, "llava": 642, "full": 643, "supported": 644, "supported_models": 645, "getting": 646, "started": 647, "install": 648, "pip": 649, "getting_started": 650, "installation": 651, "gpu": 652, "index": 653, "build": 654, "wheel": 655, "bash": 656, "visit": 657, "quickstart": 658, "welcome": 659, "collaborations": 660, "how": 661, "get": 662, "sponsors": 663, "compute": 664, "resources": 665, "testing": 666, "following": 667, "organizations": 668, "thank": 669, "your": 670, "note": 671, "them": 672, "alphabetical": 673, "order": 674, "keep": 675, "consistent": 676, "md": 677, "cash": 678, "donations": 679, "dropbox": 680, "sequoia": 681, "capital": 682, "skywork": 683, "zhenfund": 684, "alibaba": 685, "anyscale": 686, "crusoe": 687, "databricks": 688, "deepinfra": 689, "lambda": 690, "nebius": 691, "novita": 692, "replicate": 693, "runpod": 694, "trainy": 695, "san": 696, "diego": 697, "sponsor": 698, "fundraising": 699, "venue": 700, "opencollective": 701, "plan": 702, "fund": 703, "maintenance": 704, "adoption": 705, "citation": 706, "cite": 707, "bibtex": 708, "inproceedings": 709, "kwon2023efficient": 710, "title": 711, "author": 712, "woosuk": 713, "kwon": 714, "zhuohan": 715, "li": 716, "siyuan": 717, "zhuang": 718, "ying": 719, "sheng": 720, "lianmin": 721, "zheng": 722, "cody": 723, "hao": 724, "yu": 725, "joseph": 726, "gonzalez": 727, "zhang": 728, "ion": 729, "stoica": 730, "booktitle": 731, "proceedings": 732, "acm": 733, "sigops": 734, "29th": 735, "symposium": 736, "operating": 737, "systems": 738, "principles": 739, "year": 740, "contact": 741, "start": 742, "technical": 743, "feature": 744, "fellow": 745, "disclosures": 746, "advisories": 747, "partnerships": 748, "lists": 749, "mailto": 750, "end": 751, "kit": 752, "wish": 753, "refer": 754, "repo": 755, "releasing": 756, "releases": 757, "offer": 758, "reliable": 759, "base": 760, "packaged": 761, "binary": 762, "format": 763, "can": 764, "conveniently": 765, "accessed": 766, "pypi": 767, "serve": 768, "milestones": 769, "newly": 770, "improvements": 771, "upcoming": 772, "changes": 773, "affect": 774, "potential": 775, "breaking": 776, "versioning": 777, "uses": 778, "shifted": 779, "where": 780, "new": 781, "patch": 782, "every": 783, "weeks": 784, "contain": 785, "bug": 786, "fixes": 787, "opposed": 788, "semver": 789, "contains": 790, "only": 791, "backwards": 792, "critical": 793, "need": 794, "made": 795, "post1": 796, "_major_": 797, "milestone": 798, "incompatible": 799, "similar": 800, "_minor_": 801, "_patch_": 802, "_post1_": 803, "_patch": 804, "1_": 805, "either": 806, "implicit": 807, "cadence": 808, "bi": 809, "weekly": 810, "basis": 811, "days": 812, "after": 813, "same": 814, "branch": 815, "future": 816, "dates": 817, "below": 818, "tentative": 819, "optional": 820, "date": 821, "versions": 822, "jan": 823, "feb": 824, "mar": 825, "apr": 826, "jun": 827, "jul": 828, "13": 829, "aug": 830, "14": 831, "15": 832, "sep": 833, "16": 834, "17": 835, "oct": 836, "18": 837, "19": 838, "nov": 839, "21": 840, "dec": 841, "22": 842, "each": 843, "built": 844, "dedicated": 845, "cut": 846, "performed": 847, "before": 848, "previously": 849, "reused": 850, "builds": 851, "triggered": 852, "push": 853, "rc": 854, "tag": 855, "vx": 856, "rc1": 857, "enables": 858, "test": 859, "multiple": 860, "rcs": 861, "final": 862, "does": 863, "trigger": 864, "used": 865, "notes": 866, "monitor": 867, "reverts": 868, "apply": 869, "cherry": 870, "pick": 871, "criteria": 872, "approach": 873, "finalizing": 874, "clear": 875, "picks": 876, "process": 877, "land": 878, "pr": 879, "typically": 880, "ensure": 881, "sufficient": 882, "complete": 883, "thorough": 884, "round": 885, "stable": 886, "regression": 887, "functional": 888, "performance": 889, "against": 890, "recent": 891, "severe": 892, "issue": 893, "silent": 894, "incorrectness": 895, "compatibility": 896, "crashes": 897, "deadlocks": 898, "leaks": 899, "introduced": 900, "specific": 901, "change": 902, "identifiers": 903, "ci": 904, "work": 905, "prs": 906, "merged": 907, "trunk": 908, "exception": 909, "manual": 910, "validations": 911, "e2e": 912, "validation": 913, "perform": 914, "regressions": 915, "benchmark": 916, "workflow": 917, "workflows": 918, "yml": 919, "current": 920, "coverage": 921, "llama3": 922, "llama4": 923, "hardware": 924, "h100": 925, "mi300x": 926, "_note": 927, "based": 928, "availability_": 929, "step": 930, "access": 931, "request": 932, "write": 933, "repository": 934, "run": 935, "review": 936, "setup": 937, "familiarize": 938, "yourself": 939, "configurations": 940, "tree": 941, "benchmarks": 942, "rocm": 943, "navigate": 944, "configure": 945, "set": 946, "v0": 947, "commit": 948, "hash": 949, "results": 950, "once": 951, "completes": 952, "dashboard": 953, "hud": 954, "reponame": 955, "2fvllm": 956, "corresponding": 957, "comparison": 958, "compare": 959, "verify": 960, "occurred": 961, "example": 962, "vs": 963, "starttime": 964, "thu": 965, "2c": 966, "2017": 967, "20apr": 968, "202025": 969, "2021": 970, "3a43": 971, "3a50": 972, "20gmt": 973, "stoptime": 974, "wed": 975, "2016": 976, "20jul": 977, "granularity": 978, "week": 979, "lbranch": 980, "lcommit": 981, "b6553be1bc75f046b00046a4ad7576364d03c835": 982, "rbranch": 983, "rcommit": 984, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 985, "benchmarkname": 986, "modelname": 987, "20models": 988, "backendname": 989, "20backends": 990, "modename": 991, "20modes": 992, "dtypename": 993, "20dtype": 994, "devicename": 995, "20devices": 996, "archname": 997, "20platforms": 998, "policy": 999, "reporting": 1000, "report": 1001, "privately": 1002, "vulnerability": 1003, "submission": 1004, "form": 1005, "triage": 1006, "reports": 1007, "triaged": 1008, "vulnerability_management": 1009, "threat": 1010, "guide": 1011, "usage": 1012, "assumptions": 1013, "recommendations": 1014, "blob": 1015, "securely": 1016, "severity": 1017, "determine": 1018, "risk": 1019, "taking": 1020, "dealing": 1021, "past": 1022, "defaults": 1023, "cases": 1024, "categories": 1025, "vulnerabilities": 1026, "allow": 1027, "remote": 1028, "attackers": 1029, "execute": 1030, "arbitrary": 1031, "control": 1032, "system": 1033, "significantly": 1034, "compromise": 1035, "confidentiality": 1036, "integrity": 1037, "privileges": 1038, "needed": 1039, "network": 1040, "deserialization": 1041, "exploit": 1042, "chains": 1043, "generally": 1044, "rated": 1045, "cvss": 1046, "flaws": 1047, "elevated": 1048, "rce": 1049, "contexts": 1050, "significant": 1051, "loss": 1052, "require": 1053, "advanced": 1054, "conditions": 1055, "some": 1056, "trust": 1057, "modes": 1058, "node": 1059, "privileged": 1060, "required": 1061, "scores": 1062, "between": 1063, "moderate": 1064, "cause": 1065, "denial": 1066, "service": 1067, "partial": 1068, "disruption": 1069, "do": 1070, "breach": 1071, "rating": 1072, "low": 1073, "minor": 1074, "informational": 1075, "logging": 1076, "errors": 1077, "non": 1078, "exploitable": 1079, "weaknesses": 1080, "local": 1081, "privilege": 1082, "negligible": 1083, "side": 1084, "collisions": 1085, "often": 1086, "less": 1087, "than": 1088, "prenotification": 1089, "certain": 1090, "prenotify": 1091, "vendors": 1092, "ship": 1093, "purpose": 1094, "coordinated": 1095, "notification": 1096, "adding": 1097, "contacts": 1098, "advisory": 1099, "few": 1100, "added": 1101, "group": 1102, "send": 1103, "copying": 1104, "vendor": 1105, "analyzed": 1106, "case": 1107, "withdraw": 1108, "receiving": 1109, "prenotifications": 1110, "membership": 1111, "refinements": 1112, "who": 1113, "included": 1114, "spdx": 1115, "license": 1116, "identifier": 1117, "apache": 1118, "filecopyrighttext": 1119, "copyright": 1120, "import": 1121, "importlib": 1122, "traceback": 1123, "typing": 1124, "callable": 1125, "unittest": 1126, "mock": 1127, "def": 1128, "find_cuda_init": 1129, "fn": 1130, "object": 1131, "none": 1132, "helper": 1133, "function": 1134, "debug": 1135, "re": 1136, "initialization": 1137, "initializes": 1138, "prints": 1139, "stack": 1140, "trace": 1141, "happens": 1142, "torch": 1143, "_lazy_init": 1144, "wrapper": 1145, "nonlocal": 1146, "extract_stack": 1147, "return": 1148, "print": 1149, "initialized": 1150, "format_list": 1151, "strip": 1152, "__name__": 1153, "__main__": 1154, "import_module": 1155, "model_executor": 1156, "ctypes": 1157, "util": 1158, "json": 1159, "os": 1160, "shutil": 1161, "subprocess": 1162, "sys": 1163, "pathlib": 1164, "path": 1165, "packaging": 1166, "parse": 1167, "setuptools": 1168, "extension": 1169, "command": 1170, "build_ext": 1171, "setuptools_scm": 1172, "get_version": 1173, "utils": 1174, "cpp_extension": 1175, "cuda_home": 1176, "rocm_home": 1177, "load_module_from_path": 1178, "module_name": 1179, "spec": 1180, "spec_from_file_location": 1181, "module": 1182, "module_from_spec": 1183, "modules": 1184, "loader": 1185, "exec_module": 1186, "root_dir": 1187, "__file__": 1188, "parent": 1189, "logger": 1190, "getlogger": 1191, "envs": 1192, "py": 1193, "vllm_target_device": 1194, "main_cuda_version": 1195, "is_sccache_available": 1196, "bool": 1197, "sccache": 1198, "int": 1199, "getenv": 1200, "vllm_disable_sccache": 1201, "is_ccache_available": 1202, "ccache": 1203, "is_ninja_available": 1204, "ninja": 1205, "is_url_available": 1206, "url": 1207, "str": 1208, "urllib": 1209, "urlopen": 1210, "try": 1211, "except": 1212, "false": 1213, "200": 1214, "class": 1215, "cmakeextension": 1216, "__init__": 1217, "self": 1218, "name": 1219, "cmake_lists_dir": 1220, "kwa": 1221, "super": 1222, "sources": 1223, "py_limited_api": 1224, "true": 1225, "abspath": 1226, "cmake_build_ext": 1227, "dict": 1228, "directories": 1229, "been": 1230, "configured": 1231, "did_config": 1232, "number": 1233, "compilation": 1234, "jobs": 1235, "optionally": 1236, "nvcc": 1237, "compile": 1238, "threads": 1239, "compute_num_jobs": 1240, "num_jobs": 1241, "max_jobs": 1242, "variable": 1243, "defined": 1244, "info": 1245, "else": 1246, "sched_getaffinity": 1247, "isn": 1248, "universally": 1249, "so": 1250, "fall": 1251, "back": 1252, "cpu_count": 1253, "error": 1254, "len": 1255, "attributeerror": 1256, "nvcc_threads": 1257, "_is_cuda": 1258, "get_nvcc_cuda_version": 1259, "reduce": 1260, "avoid": 1261, "overloading": 1262, "max": 1263, "cmake": 1264, "configuration": 1265, "ext": 1266, "ve": 1267, "already": 1268, "cmakelists": 1269, "txt": 1270, "exit": 1271, "early": 1272, "select": 1273, "type": 1274, "optimization": 1275, "default_cfg": 1276, "relwithdebinfo": 1277, "cfg": 1278, "cmake_build_type": 1279, "cmake_args": 1280, "dcmake_build_type": 1281, "dvllm_target_device": 1282, "verbose": 1283, "dcmake_verbose_makefile": 1284, "dcmake_c_compiler_launcher": 1285, "dcmake_cxx_compiler_launcher": 1286, "dcmake_cuda_compiler_launcher": 1287, "dcmake_hip_compiler_launcher": 1288, "elif": 1289, "pass": 1290, "python": 1291, "executable": 1292, "exact": 1293, "match": 1294, "dvllm_python_executable": 1295, "reuse": 1296, "dependencies": 1297, "subsequent": 1298, "calls": 1299, "dvllm_python_path": 1300, "override": 1301, "directory": 1302, "fetchcontent": 1303, "downloads": 1304, "root": 1305, "deps": 1306, "allows": 1307, "profiles": 1308, "plays": 1309, "nicely": 1310, "fetchcontent_base_dir": 1311, "fc_base_dir": 1312, "environ": 1313, "dfetchcontent_base_dir": 1314, "tool": 1315, "num_job": 1316, "dnvcc_threads": 1317, "build_tool": 1318, "dcmake_job_pool_compile": 1319, "string": 1320, "dcmake_job_pools": 1321, "default": 1322, "whatever": 1323, "sure": 1324, "dcmake_cuda_compiler": 1325, "bin": 1326, "check_call": 1327, "cwd": 1328, "build_temp": 1329, "build_extensions": 1330, "present": 1331, "working": 1332, "check_output": 1333, "oserror": 1334, "raise": 1335, "runtimeerror": 1336, "cannot": 1337, "create": 1338, "exist": 1339, "exists": 1340, "makedirs": 1341, "targets": 1342, "target_name": 1343, "removeprefix": 1344, "vllm_flash_attn": 1345, "extensions": 1346, "append": 1347, "build_args": 1348, "target": 1349, "libraries": 1350, "proper": 1351, "location": 1352, "outdir": 1353, "get_ext_fullpath": 1354, "absolute": 1355, "skip": 1356, "directo": 1357, "ry": 1358, "continue": 1359, "appends": 1360, "range": 1361, "count": 1362, "should": 1363, "actually": 1364, "components": 1365, "install_args": 1366, "component": 1367, "standard": 1368, "copy": 1369, "build_lib": 1370, "editable": 1371, "glob": 1372, "files": 1373, "recursive": 1374, "dst_file": 1375, "split": 1376, "dirname": 1377, "exist_ok": 1378, "copy_file": 1379, "precompiled_build_ext": 1380, "disables": 1381, "building": 1382, "precompiled": 1383, "binaries": 1384, "assert": 1385, "vllm_use_precompiled": 1386, "skipping": 1387, "precompiled_wheel_utils": 1388, "extracts": 1389, "existing": 1390, "staticmethod": 1391, "extract_precompiled_and_patch_package": 1392, "wheel_url_or_path": 1393, "tempfile": 1394, "zipfile": 1395, "temp_dir": 1396, "isfile": 1397, "wheel_filename": 1398, "mkdtemp": 1399, "wheels": 1400, "wheel_path": 1401, "downloading": 1402, "urlretrieve": 1403, "filename": 1404, "package_data_patch": 1405, "files_to_copy": 1406, "_c": 1407, "abi3": 1408, "_moe_c": 1409, "_flashmla_c": 1410, "_vllm_fa2_c": 1411, "_vllm_fa3_c": 1412, "cumem_allocator": 1413, "compiled_regex": 1414, "file_members": 1415, "filter": 1416, "filelist": 1417, "extract": 1418, "target_path": 1419, "target_pa": 1420, "th": 1421, "wb": 1422, "dst": 1423, "copyfileobj": 1424, "pkg": 1425, "replace": 1426, "setdefault": 1427, "basename": 1428, "finally": 1429, "removing": 1430, "rmtree": 1431, "get_base_commit_in_main_branch": 1432, "force": 1433, "nightly": 1434, "mainly": 1435, "vllm_test_use_precompiled_nightly_wheel": 1436, "upstream": 1437, "resp_json": 1438, "curl": 1439, "repos": 1440, "decode": 1441, "utf": 1442, "upstream_main_commit": 1443, "loads": 1444, "sha": 1445, "docker": 1446, "context": 1447, "git": 1448, "immutable": 1449, "missing": 1450, "vllm_docker_build_context": 1451, "cat": 1452, "calledprocesserror": 1453, "fetch": 1454, "update": 1455, "branches": 1456, "ensures": 1457, "ref": 1458, "its": 1459, "history": 1460, "current_branch": 1461, "show": 1462, "base_commit": 1463, "merge": 1464, "valueerror": 1465, "err": 1466, "failed": 1467, "dev": 1468, "_no_device": 1469, "empty": 1470, "has_cuda": 1471, "_is_neuron": 1472, "_is_tpu": 1473, "_is_hip": 1474, "_is_cpu": 1475, "cpu": 1476, "_is_xpu": 1477, "xpu": 1478, "_build_custom_ops": 1479, "get_rocm_version": 1480, "librocm": 1481, "core": 1482, "d11f5c20d500f729c393680a01fa902ebf92094b": 1483, "rocm_version": 1484, "cpp": 1485, "l21": 1486, "librocm_core_file": 1487, "lib": 1488, "is_file": 1489, "librocm_core": 1490, "cdll": 1491, "vererrors": 1492, "c_uint32": 1493, "get_rocm_core_version": 1494, "getrocmversion": 1495, "restype": 1496, "argtypes": 1497, "pointer": 1498, "byref": 1499, "get_neuronxcc_version": 1500, "sysconfig": 1501, "site_dir": 1502, "get_paths": 1503, "purelib": 1504, "version_file": 1505, "neuronxcc": 1506, "executed": 1507, "successfully": 1508, "fp": 1509, "content": 1510, "read": 1511, "regular": 1512, "__version__": 1513, "output": 1514, "apex": 1515, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 1516, "nvcc_output": 1517, "universal_newlines": 1518, "release_idx": 1519, "nvcc_cuda_version": 1520, "get_gaudi_sw_version": 1521, "returns": 1522, "driver": 1523, "enable": 1524, "console": 1525, "printing": 1526, "hl": 1527, "smi": 1528, "shell": 1529, "capture_output": 1530, "env": 1531, "enable_console": 1532, "returncode": 1533, "stdout": 1534, "get_vllm_version": 1535, "write_to": 1536, "_version": 1537, "might": 1538, "cuda_version": 1539, "cuda_version_str": 1540, "tarball": 1541, "sdist": 1542, "argv": 1543, "cu": 1544, "neuron_version": 1545, "neuron_version_str": 1546, "unknown": 1547, "runtime": 1548, "get_requirements": 1549, "package": 1550, "requirements": 1551, "requirements_dir": 1552, "_read_requirements": 1553, "resolved_requirements": 1554, "line": 1555, "startswith": 1556, "cuda_major": 1557, "cuda_minor": 1558, "modified_requirements": 1559, "req": 1560, "flash": 1561, "attn": 1562, "unsupported": 1563, "platform": 1564, "ext_modules": 1565, "package_data": 1566, "typed": 1567, "layers": 1568, "fused_moe": 1569, "configs": 1570, "requires_files": 1571, "pyproject": 1572, "toml": 1573, "cleaning": 1574, "lines": 1575, "readlines": 1576, "lower": 1577, "removed": 1578, "done": 1579, "__version_tuple__": 1580, "env_override": 1581, "module_attrs": 1582, "asyncengineargs": 1583, "engine": 1584, "arg_utils": 1585, "engineargs": 1586, "asyncllmengine": 1587, "async_llm_engine": 1588, "llmengine": 1589, "llm_engine": 1590, "entrypoints": 1591, "initialize_ray_cluster": 1592, "executor": 1593, "ray_utils": 1594, "prompttype": 1595, "inputs": 1596, "textprompt": 1597, "tokensprompt": 1598, "modelregistry": 1599, "samplingparams": 1600, "sampling_params": 1601, "poolingparams": 1602, "pooling_params": 1603, "classificationoutput": 1604, "classificationrequestoutput": 1605, "completionoutput": 1606, "embeddingoutput": 1607, "embeddingrequestoutput": 1608, "poolingoutput": 1609, "poolingrequestoutput": 1610, "requestoutput": 1611, "scoringoutput": 1612, "scoringrequestoutput": 1613, "__all__": 1614, "contextlib": 1615, "type_checking": 1616, "union": 1617, "init_logger": 1618, "platforms": 1619, "current_platform": 1620, "scalar_type": 1621, "scalartype": 1622, "supports_moe_ops": 1623, "paged_attention_v1": 1624, "query": 1625, "key_cache": 1626, "value_cache": 1627, "num_kv_heads": 1628, "float": 1629, "block_tables": 1630, "seq_lens": 1631, "block_size": 1632, "max_seq_len": 1633, "alibi_slopes": 1634, "kv_cache_dtype": 1635, "k_scale": 1636, "v_scale": 1637, "tp_rank": 1638, "blocksparse_local_blocks": 1639, "blocksparse_vert_stride": 1640, "blocksparse_block_size": 1641, "64": 1642, "blocksparse_head_sliding_step": 1643, "ops": 1644, "paged_attention_v2": 1645, "exp_sum": 1646, "max_logits": 1647, "tmp_out": 1648, "paged_attention_rocm": 1649, "query_start_loc": 1650, "fp8_out_scale": 1651, "_rocm_c": 1652, "paged_attention": 1653, "mla_decode_kvcache_cpu": 1654, "kv_cache": 1655, "_c_cpu": 1656, "mla_decode_kvcache": 1657, "merge_attn_states": 1658, "prefix_output": 1659, "prefix_lse": 1660, "suffix_output": 1661, "suffix_lse": 1662, "output_lse": 1663, "convert_vertical_slash_indexes": 1664, "q_seqlens": 1665, "batch": 1666, "kv_seqlens": 1667, "vertical_indexes": 1668, "n_heads": 1669, "nnz_v": 1670, "slash_indexes": 1671, "nnz_s": 1672, "context_size": 1673, "block_size_m": 1674, "block_size_n": 1675, "causal": 1676, "tuple": 1677, "batch_size": 1678, "num_heads": 1679, "nnz_slash": 1680, "nnz_vertical": 1681, "num_rows": 1682, "block_count": 1683, "zeros": 1684, "dtype": 1685, "device": 1686, "block_offset": 1687, "column_count": 1688, "column_index": 1689, "convert_vertical_slash_indexes_mergehead": 1690, "different": 1691, "head": 1692, "indices": 1693, "vertical_indices_count": 1694, "slash_indices_count": 1695, "rotary_embedding": 1696, "positions": 1697, "head_size": 1698, "cos_sin_cache": 1699, "is_neox": 1700, "batched_rotary_embedding": 1701, "rot_dim": 1702, "cos_sin_cache_offsets": 1703, "rms_norm": 1704, "input": 1705, "weight": 1706, "epsilon": 1707, "todo": 1708, "contiguous": 1709, "call": 1710, "kernel": 1711, "updated": 1712, "input_contiguous": 1713, "fused_add_rms_norm": 1714, "residual": 1715, "apply_repetition_penalties_torch": 1716, "logits": 1717, "prompt_mask": 1718, "output_mask": 1719, "repetition_penalties": 1720, "unsqueeze": 1721, "dim": 1722, "repeat": 1723, "token": 1724, "appears": 1725, "prompt": 1726, "op": 1727, "penalties": 1728, "divide": 1729, "penalty": 1730, "multiply": 1731, "scaling": 1732, "apply_repetition_penalties_cuda": 1733, "apply_repetition_penalties_": 1734, "apply_repetition_penalties": 1735, "repetition": 1736, "place": 1737, "args": 1738, "shape": 1739, "num_seqs": 1740, "vocab_size": 1741, "boolean": 1742, "indicating": 1743, "tokens": 1744, "appear": 1745, "is_cuda": 1746, "is_contiguous": 1747, "rms_norm_dynamic_per_token_quant": 1748, "quant_dtype": 1749, "scale_ub": 1750, "empty_like": 1751, "scales": 1752, "numel": 1753, "float32": 1754, "awq_dequantize": 1755, "qweight": 1756, "split_k_iters": 1757, "thx": 1758, "thy": 1759, "vllm_use_triton_awq": 1760, "awq_triton": 1761, "awq_dequantize_triton": 1762, "awq_gemm": 1763, "qzeros": 1764, "awq_gemm_triton": 1765, "gptq_gemm": 1766, "b_q_weight": 1767, "b_gptq_qzeros": 1768, "b_gptq_scales": 1769, "b_g_idx": 1770, "use_exllama": 1771, "bit": 1772, "gptq_shuffle": 1773, "q_weight": 1774, "q_perm": 1775, "marlin_gemm": 1776, "b_scales": 1777, "workspace": 1778, "size_m": 1779, "size_n": 1780, "size_k": 1781, "gptq_marlin_24_gemm": 1782, "b_meta": 1783, "b_q_type": 1784, "cutlass_scaled_mm_supports_fp4": 1785, "cuda_device_capability": 1786, "cutlass_blockwise_scaled_grouped_mm": 1787, "scales_a": 1788, "scales_b": 1789, "problem_sizes": 1790, "expert_offsets": 1791, "cutlass_scaled_fp4_mm": 1792, "block_scale_a": 1793, "block_scale_b": 1794, "out_dtype": 1795, "ndim": 1796, "cutlass_scaled_mm_supports_fp8": 1797, "cutlass_scaled_mm_supports_block_fp8": 1798, "cutlass_scaled_mm": 1799, "scale_a": 1800, "scale_b": 1801, "bias": 1802, "implements": 1803, "fused": 1804, "mm": 1805, "implemented": 1806, "numpy": 1807, "style": 1808, "broadcasting": 1809, "blockwise": 1810, "found": 1811, "extended": 1812, "broadcast": 1813, "rules": 1814, "extend": 1815, "rule": 1816, "extent": 1817, "dimension": 1818, "element": 1819, "along": 1820, "src_shape": 1821, "target_shape": 1822, "times": 1823, "consecutively": 1824, "expand": 1825, "currently": 1826, "128": 1827, "bfloat16": 1828, "float16": 1829, "massage": 1830, "2d": 1831, "cutlass_compatible_b": 1832, "is_rocm": 1833, "compressed_tensors": 1834, "triton_scaled_mm": 1835, "noqa": 1836, "cutlass_scaled_mm_azp": 1837, "azp_adj": 1838, "azp": 1839, "param": 1840, "per": 1841, "always": 1842, "cutlass_sparse_scaled_mm_supported": 1843, "cutlass_group_gemm_supported": 1844, "cutlass_sparse_compress": 1845, "compresses": 1846, "sparse": 1847, "matrix": 1848, "cutlass": 1849, "operations": 1850, "takes": 1851, "dense": 1852, "two": 1853, "elements": 1854, "metadata": 1855, "compressed": 1856, "representation": 1857, "must": 1858, "one": 1859, "types": 1860, "float8_e4m3fn": 1861, "containing": 1862, "a_nzs": 1863, "a_meta": 1864, "raises": 1865, "compression": 1866, "operation": 1867, "fails": 1868, "uint8": 1869, "encodes": 1870, "sparsity": 1871, "elemspermetaelem": 1872, "dimensions": 1873, "8b": 1874, "2b_per_nz": 1875, "cutlass_scaled_sparse_mm": 1876, "bt_nzs": 1877, "bt_meta": 1878, "performs": 1879, "scaled": 1880, "multiplication": 1881, "steps": 1882, "randn": 1883, "prune": 1884, "prune_to_2_4": 1885, "compress": 1886, "transposed": 1887, "applying": 1888, "factors": 1889, "result": 1890, "get_cutlass_moe_mm_data": 1891, "topk_ids": 1892, "problem_sizes1": 1893, "problem_sizes2": 1894, "input_permutation": 1895, "output_permutation": 1896, "num_experts": 1897, "blockscale_offsets": 1898, "prepare": 1899, "necessary": 1900, "grouped": 1901, "multiplications": 1902, "moe": 1903, "mapping": 1904, "mark": 1905, "begins": 1906, "computation": 1907, "sorted": 1908, "computed": 1909, "mxnxk": 1910, "sizes": 1911, "mms": 1912, "permutation": 1913, "shuffle": 1914, "executing": 1915, "argument": 1916, "passed": 1917, "fp4": 1918, "block": 1919, "rows": 1920, "shuffle_rows": 1921, "input_tensor": 1922, "dst2src_map": 1923, "according": 1924, "store": 1925, "output_tensor": 1926, "permute": 1927, "performing": 1928, "num_tokens_permuted": 1929, "get_cutlass_pplx_moe_mm_data": 1930, "expert_num_tokens": 1931, "num_local_experts": 1932, "padded_m": 1933, "non_zero_expert_idxs": 1934, "consecutive": 1935, "experts": 1936, "counts": 1937, "cutlass_moe_mm": 1938, "out_tensors": 1939, "a_tensors": 1940, "b_tensors": 1941, "a_scales": 1942, "a_strides": 1943, "b_strides": 1944, "c_strides": 1945, "per_act_token": 1946, "per_out_ch": 1947, "executes": 1948, "quantized": 1949, "ab": 1950, "strides": 1951, "cutlass_fp4_moe_mm": 1952, "alphas": 1953, "sf_offsets": 1954, "blockscaled": 1955, "gemm": 1956, "runs": 1957, "gemms": 1958, "combination": 1959, "problem": 1960, "nvfp4": 1961, "fusedmoe": 1962, "forward": 1963, "a_ptrs": 1964, "b_ptrs": 1965, "tensors": 1966, "weights": 1967, "a_": 1968, "blockscales": 1969, "e4m3": 1970, "precision": 1971, "sf_size": 1972, "sf_offset": 1973, "cutlass_fp4_group_mm": 1974, "gptq_marlin_repack": 1975, "perm": 1976, "num_bits": 1977, "awq_marlin_repack": 1978, "gptq_marlin_moe_repack": 1979, "awq_marlin_moe_repack": 1980, "gptq_marlin_gemm": 1981, "b_bias": 1982, "global_scale": 1983, "b_zeros": 1984, "g_idx": 1985, "is_k_full": 1986, "use_atomic_add": 1987, "use_fp32_reduce": 1988, "is_zp_float": 1989, "machete_supported_schedules": 1990, "a_type": 1991, "b_type": 1992, "group_scales_type": 1993, "group_zeros_type": 1994, "channel_scales_type": 1995, "token_scales_type": 1996, "out_type": 1997, "machete_mm": 1998, "b_q": 1999, "returned": 2000, "machete_prepack_b": 2001, "b_group_scales": 2002, "b_group_zeros": 2003, "b_group_size": 2004, "b_channel_scales": 2005, "a_token_scales": 2006, "schedule": 2007, "permute_cols": 2008, "scaled_fp4_quant": 2009, "input_global_scale": 2010, "quantize": 2011, "quantizes": 2012, "last": 2013, "given": 2014, "dynamically": 2015, "factor": 2016, "shared": 2017, "stored": 2018, "swizzled": 2019, "layout": 2020, "thread": 2021, "tcgen05": 2022, "mma": 2023, "4x": 2024, "scalar": 2025, "entire": 2026, "values": 2027, "packed": 2028, "float8_e4m3": 2029, "sizzled": 2030, "needs": 2031, "got": 2032, "other_dims": 2033, "reshape": 2034, "fp16": 2035, "bf16": 2036, "rounded": 2037, "due": 2038, "requirement": 2039, "minimum": 2040, "tile": 2041, "128x4": 2042, "pad": 2043, "multiples": 2044, "int32": 2045, "round_up": 2046, "rounded_m": 2047, "scale_n": 2048, "rounded_n": 2049, "output_scale": 2050, "scaled_fp4_experts_quant": 2051, "topk": 2052, "offsets": 2053, "blockscale": 2054, "output_scales": 2055, "maximum": 2056, "prevent": 2057, "running": 2058, "increased": 2059, "larger": 2060, "max_tokens_per_expert": 2061, "vllm_max_tokens_per_expert_fp4_moe": 2062, "m_numtopk": 2063, "cutlass_moe_fp4": 2064, "observed": 2065, "scales_k": 2066, "padded_k": 2067, "rch": 2068, "scaled_fp8_quant": 2069, "num_token_padding": 2070, "use_per_token_if_dynamic": 2071, "static": 2072, "dynamic": 2073, "provide": 2074, "omit": 2075, "determined": 2076, "padding": 2077, "downstream": 2078, "benefit": 2079, "upper": 2080, "bound": 2081, "least": 2082, "whether": 2083, "per_tensor": 2084, "per_token": 2085, "assumes": 2086, "batch_dim": 2087, "num_tokens": 2088, "flattened": 2089, "mi300": 2090, "float_e3m3fnuz": 2091, "fp8_dtype": 2092, "pe": 2093, "dynamic_per_token_scaled_fp8_quant": 2094, "dynamic_scaled_fp8_quant": 2095, "static_scaled_fp8_quant": 2096, "allspark_repack_weight": 2097, "zero_point": 2098, "has_zp": 2099, "rearrange": 2100, "asymmetric": 2101, "n32k16": 2102, "ampere": 2103, "w8a16": 2104, "original": 2105, "provided": 2106, "symmetric": 2107, "rearranged": 2108, "n_32align": 2109, "32": 2110, "qweight_reorder": 2111, "scale_reorder": 2112, "zero_point_reorder": 2113, "rearrange_kn_weight_as_n32k16_order": 2114, "allspark_w8a16_gemm": 2115, "b_qweight": 2116, "b_qzeros": 2117, "group_size": 2118, "sm_count": 2119, "sm_version": 2120, "cublas_m_threshold": 2121, "n32k16_reorder": 2122, "scaled_int8_quant": 2123, "maybe": 2124, "invoke": 2125, "point": 2126, "ignored": 2127, "static_scaled_int8_quant": 2128, "input_scales": 2129, "input_azp": 2130, "dynamic_scaled_int8_quant": 2131, "marlin_qqq_gemm": 2132, "s_tok": 2133, "s_ch": 2134, "s_group": 2135, "ggml_dequantize": 2136, "quant_type": 2137, "ggml_mul_mat_vec_a8": 2138, "row": 2139, "ggml_mul_mat_a8": 2140, "ggml_moe_a8": 2141, "sorted_token_ids": 2142, "expert_ids": 2143, "num_tokens_post_padded": 2144, "top_k": 2145, "ggml_moe_a8_vec": 2146, "symint": 2147, "ggml_moe_get_block_size": 2148, "selective_scan_fwd": 2149, "delta": 2150, "d_": 2151, "z_": 2152, "delta_bias_": 2153, "delta_softplus": 2154, "cache_indices": 2155, "has_initial_state": 2156, "ssm_states": 2157, "pad_slot_id": 2158, "llmm1": 2159, "rows_per_block": 2160, "wvsplitk": 2161, "cu_count": 2162, "wvsplitkq": 2163, "moe_sum": 2164, "moe_align_block_size": 2165, "experts_ids": 2166, "num_tokens_post_pad": 2167, "moe_wna16_gemm": 2168, "topk_weights": 2169, "block_size_k": 2170, "notimplementederror": 2171, "topk_softmax": 2172, "token_expert_indices": 2173, "gating_output": 2174, "moe_wna16_marlin_gemm": 2175, "num_tokens_past_padded": 2176, "moe_block_size": 2177, "mul_topk_weights": 2178, "is_ep": 2179, "reshape_and_cache": 2180, "slot_mapping": 2181, "_c_cache_ops": 2182, "reshape_and_cache_flash": 2183, "concat_and_cache_mla": 2184, "kv_c": 2185, "k_pe": 2186, "copy_blocks": 2187, "key_caches": 2188, "value_caches": 2189, "block_mapping": 2190, "copy_blocks_mla": 2191, "kv_caches": 2192, "swap_blocks": 2193, "convert_fp8": 2194, "kv_dtype": 2195, "gather_cache": 2196, "src_cache": 2197, "block_table": 2198, "cu_seq_lens": 2199, "seq_starts": 2200, "get_device_attribute": 2201, "attribute": 2202, "_c_cuda_utils": 2203, "get_max_shared_memory_per_block_device_attribute": 2204, "ruff": 2205, "e501": 2206, "init_custom_ar": 2207, "ipc_tensors": 2208, "rank_data": 2209, "rank": 2210, "fully_connected": 2211, "_c_custom_ar": 2212, "all_reduce": 2213, "fa": 2214, "inp": 2215, "reg_buffer": 2216, "reg_buffer_sz_bytes": 2217, "dispose": 2218, "meta_size": 2219, "register_buffer": 2220, "get_graph_buffer_ipc_meta": 2221, "register_graph_buffers": 2222, "handles": 2223, "allocate_shared_buffer_and_handle": 2224, "open_mem_handle": 2225, "mem_handle": 2226, "free_shared_buffer": 2227, "ptr": 2228, "init_custom_qr": 2229, "world_size": 2230, "qr_max_size": 2231, "qr_destroy": 2232, "qr_all_reduce": 2233, "quant_level": 2234, "cast_bf2half": 2235, "qr_get_handle": 2236, "qr_open_handles": 2237, "get_flash_mla_metadata": 2238, "cache_seqlens": 2239, "num_heads_per_head_k": 2240, "num_heads_k": 2241, "arguments": 2242, "equals": 2243, "seq_len_q": 2244, "num_heads_q": 2245, "tile_scheduler_metadata": 2246, "num_sm_parts": 2247, "tileschedulermetadatasize": 2248, "num_splits": 2249, "flash_mla_with_kvcache": 2250, "k_cache": 2251, "head_dim_v": 2252, "softmax_scale": 2253, "head_dim": 2254, "num_blocks": 2255, "page_block_size": 2256, "max_num_blocks_per_seq": 2257, "get_mla_metadata": 2258, "qk": 2259, "softmax": 2260, "sqrt": 2261, "mask": 2262, "softmax_lse": 2263, "flash_mla_fwd_kvcache": 2264, "cutlass_mla_decode": 2265, "q_nope": 2266, "q_pe": 2267, "kv_c_and_k_pe_cache": 2268, "page_table": 2269, "sm100_cutlass_mla_decode": 2270, "num_kv_splits": 2271, "sm100_cutlass_mla_get_workspace_size": 2272, "num_batches": 2273, "ipex_ops": 2274, "_reshape_activation_tensor": 2275, "num": 2276, "x1": 2277, "x2": 2278, "chunk": 2279, "chunks": 2280, "silu_and_mul": 2281, "ipex": 2282, "gelu_and_mul": 2283, "gelu_tanh_and_mul": 2284, "gelu_fast": 2285, "nn": 2286, "gelu": 2287, "gelu_new": 2288, "gelu_quick": 2289, "context_lens": 2290, "max_context_len": 2291, "auto": 2292, "num_queries_per_tokens": 2293, "single_query_kv_attent": 2294, "view_as": 2295, "single_query_kv_attention": 2296, "seq_len": 2297, "cos_sin_dim": 2298, "rotary_embedding_batched": 2299, "tmp": 2300, "add_rms_norm": 2301, "copy_": 2302, "varlen_attention": 2303, "seqlen_q": 2304, "seqlen_k": 2305, "max_seqlen_q": 2306, "max_seqlen_k": 2307, "pdropout": 2308, "zero_tensors": 2309, "is_causal": 2310, "return_softmax": 2311, "gen_": 2312, "generator": 2313, "window_size_left": 2314, "window_size_r": 2315, "ight": 2316, "logits_soft_cap": 2317, "endswith": 2318, "window_size_right": 2319, "value_ca": 2320, "che": 2321, "k_scale_float": 2322, "v_scale_float": 2323, "kv": 2324, "cache": 2325, "flash_attn_varlen_func": 2326, "cu_seqlens_q": 2327, "seqused_k": 2328, "don": 2329, "window_size": 2330, "softcap": 2331, "cu_seqlens_k": 2332, "parameters": 2333, "scheduler_metadata": 2334, "fa_version": 2335, "q_descale": 2336, "k_descale": 2337, "v_descale": 2338, "s_aux": 2339, "cumsum": 2340, "real_window_size": 2341, "_attn_varlen_func": 2342, "get_scheduler_metadata": 2343, "num_heads_kv": 2344, "headdim": 2345, "qkv_dtype": 2346, "headdim_v": 2347, "cu_seqlens_k_new": 2348, "cache_leftpad": 2349, "page_size": 2350, "max_seqlen_k_new": 2351, "means": 2352, "infinite": 2353, "window": 2354, "has_softcap": 2355, "tuned": 2356, "speed": 2357, "pack_gqa": 2358, "sm_margin": 2359, "sms": 2360, "warning_once": 2361, "returning": 2362, "ignore": 2363, "swap_bl": 2364, "ocks": 2365, "dataclasses": 2366, "dataclass": 2367, "lorarequest": 2368, "sequence": 2369, "logprob": 2370, "beamsearchsequence": 2371, "keeps": 2372, "log": 2373, "probability": 2374, "field": 2375, "filled": 2376, "logprobs": 2377, "lora_request": 2378, "cum_logprob": 2379, "finish_reason": 2380, "stop_reason": 2381, "multi_modal_data": 2382, "multimodaldatadict": 2383, "mm_processor_kwargs": 2384, "beamsearchoutput": 2385, "sequences": 2386, "length": 2387, "equal": 2388, "beamsearchinstance": 2389, "prompt_tokens": 2390, "kwargs": 2391, "beams": 2392, "completed": 2393, "get_beam_search_score": 2394, "cumulative_logprob": 2395, "eos_token_id": 2396, "length_penalty": 2397, "calculate": 2398, "score": 2399, "transformers": 2400, "ccb92be23def445f2afdea94c31286f84b89eb5b": 2401, "generation": 2402, "beam_search": 2403, "l938": 2404, "create_sort_beams_key_function": 2405, "sort_beams_key": 2406, "datetime": 2407, "locale": 2408, "collections": 2409, "namedtuple": 2410, "regex": 2411, "environment_variables": 2412, "systemenv": 2413, "torch_version": 2414, "is_debug_build": 2415, "cuda_compiled_version": 2416, "gcc_version": 2417, "clang_version": 2418, "cmake_version": 2419, "libc_version": 2420, "python_version": 2421, "python_platform": 2422, "is_cuda_available": 2423, "cuda_runtime_version": 2424, "cuda_module_loading": 2425, "nvidia_driver_version": 2426, "nvidia_gpu_models": 2427, "cudnn_version": 2428, "pip_version": 2429, "pip3": 2430, "pip_packages": 2431, "conda_packages": 2432, "hip_compiled_version": 2433, "hip_runtime_version": 2434, "miopen_runtime_version": 2435, "caching_allocator_config": 2436, "is_xnnpack_available": 2437, "cpu_info": 2438, "neuron_sdk_version": 2439, "vllm_version": 2440, "vllm_build_flags": 2441, "gpu_topo": 2442, "env_vars": 2443, "default_conda_patterns": 2444, "cudatoolkit": 2445, "soumith": 2446, "mkl": 2447, "magma": 2448, "triton": 2449, "optree": 2450, "nccl": 2451, "zmq": 2452, "pynvml": 2453, "default_pip_patterns": 2454, "mypy": 2455, "flake8": 2456, "onnx": 2457, "stderr": 2458, "popen": 2459, "pipe": 2460, "raw_output": 2461, "raw_err": 2462, "get_platform": 2463, "win32": 2464, "enc": 2465, "oem": 2466, "getpreferredencoding": 2467, "topo": 2468, "leading": 2469, "whitespace": 2470, "because": 2471, "meaningful": 2472, "rstrip": 2473, "filenotfounderror": 2474, "cmd_str": 2475, "isinstance": 2476, "127": 2477, "run_and_read_all": 2478, "run_lambda": 2479, "reads": 2480, "run_and_parse_first_match": 2481, "run_and_return_first_line": 2482, "get_conda_packages": 2483, "patterns": 2484, "conda": 2485, "conda_exe": 2486, "splitlines": 2487, "get_gcc_version": 2488, "gcc": 2489, "get_clang_version": 2490, "clang": 2491, "get_cmake_version": 2492, "get_nvidia_driver_version": 2493, "darwin": 2494, "cmd": 2495, "kextstat": 2496, "grep": 2497, "get_nvidia_smi": 2498, "get_gpu_info": 2499, "torch_available": 2500, "hasattr": 2501, "is_available": 2502, "prop": 2503, "get_device_properties": 2504, "gcnarchname": 2505, "gcnarch": 2506, "nogcnarchnameonoldpytorch": 2507, "get_device_name": 2508, "uuid_regex": 2509, "uuid": 2510, "anonymize": 2511, "sub": 2512, "get_running_cuda_version": 2513, "get_cudnn_version": 2514, "libcudnn": 2515, "hard": 2516, "tell": 2517, "system_root": 2518, "systemroot": 2519, "windows": 2520, "cuda_path": 2521, "where_cmd": 2522, "system32": 2523, "cudnn_cmd": 2524, "cudnn": 2525, "dll": 2526, "drivers": 2527, "usr": 2528, "mac": 2529, "deeplearning": 2530, "sdk": 2531, "installmac": 2532, "cudnn_library": 2533, "installed": 2534, "elsewhere": 2535, "ls": 2536, "ldconfig": 2537, "rev": 2538, "f1": 2539, "realpath": 2540, "files_set": 2541, "eliminate": 2542, "symbolic": 2543, "links": 2544, "add": 2545, "alphabetize": 2546, "deterministic": 2547, "probably": 2548, "linux": 2549, "program_files_root": 2550, "programfiles": 2551, "program": 2552, "legacy_path": 2553, "corporation": 2554, "nvsmi": 2555, "new_path": 2556, "smis": 2557, "candidate_smi": 2558, "break": 2559, "hipcc": 2560, "get_neuron_sdk_version": 2561, "script": 2562, "version_str": 2563, "git_sha": 2564, "summarize_vllm_build_flags": 2565, "method": 2566, "flags": 2567, "constant": 2568, "variables": 2569, "etc": 2570, "archs": 2571, "torch_cuda_arch_list": 2572, "enabled": 2573, "disabled": 2574, "neuron_cores": 2575, "get_gpu_topo": 2576, "showtopo": 2577, "get_cpu_info": 2578, "lscpu": 2579, "wmic": 2580, "manufacturer": 2581, "family": 2582, "architecture": 2583, "processortype": 2584, "deviceid": 2585, "currentclockspeed": 2586, "maxclockspeed": 2587, "l2cachesize": 2588, "l2cachespeed": 2589, "revision": 2590, "sysctl": 2591, "machdep": 2592, "brand_string": 2593, "cygwin": 2594, "get_mac_version": 2595, "sw_vers": 2596, "productversion": 2597, "get_windows_version": 2598, "wmic_cmd": 2599, "wbem": 2600, "findstr_cmd": 2601, "findstr": 2602, "caption": 2603, "get_lsb_version": 2604, "lsb_release": 2605, "description": 2606, "check_release_file": 2607, "pretty_name": 2608, "get_os": 2609, "machine": 2610, "macos": 2611, "ubuntu": 2612, "debian": 2613, "desc": 2614, "reading": 2615, "get_python_platform": 2616, "get_libc_version": 2617, "libc_ver": 2618, "get_pip_packages": 2619, "packages": 2620, "run_with_pip": 2621, "pip_spec": 2622, "find_spec": 2623, "pip_available": 2624, "importerror": 2625, "mpip": 2626, "freeze": 2627, "uv": 2628, "collect": 2629, "get_cachingallocator_config": 2630, "ca_config": 2631, "pytorch_cuda_alloc_conf": 2632, "get_cuda_module_loading_config": 2633, "init": 2634, "config": 2635, "backends": 2636, "xnnpack": 2637, "attr": 2638, "get_env_vars": 2639, "secret_terms": 2640, "secret": 2641, "password": 2642, "report_prefix": 2643, "cublas": 2644, "omp_": 2645, "mkl_": 2646, "items": 2647, "term": 2648, "get_env_info": 2649, "pip_list_output": 2650, "debug_mode_str": 2651, "cuda_available_str": 2652, "get_version_or_na": 2653, "_lst": 2654, "rsplit": 2655, "_show_config": 2656, "miopen": 2657, "sys_version": 2658, "maxsize": 2659, "bit_length": 2660, "get_cud": 2661, "a_module_loading_config": 2662, "env_info_fmt": 2663, "libc": 2664, "relevant": 2665, "pretty_str": 2666, "envinfo": 2667, "replace_nones": 2668, "dct": 2669, "replacement": 2670, "keys": 2671, "replace_bools": 2672, "yes": 2673, "prepend": 2674, "updated_lines": 2675, "replace_if_empty": 2676, "maybe_start_on_next_line": 2677, "multiline": 2678, "mutable_dict": 2679, "_asdict": 2680, "next": 2681, "doesn": 2682, "fields": 2683, 