{"security": 0, "policy": 1, "reporting": 2, "issues": 3, "please": 4, "report": 5, "privately": 6, "using": 7, "vulnerability": 8, "submission": 9, "form": 10, "https": 11, "github": 12, "com": 13, "vllm": 14, "project": 15, "advisories": 16, "new": 17, "issue": 18, "triage": 19, "reports": 20, "triaged": 21, "management": 22, "team": 23, "docs": 24, "ai": 25, "en": 26, "latest": 27, "contributing": 28, "vulnerability_management": 29, "html": 30, "threat": 31, "model": 32, "see": 33, "guide": 34, "documentation": 35, "usage": 36, "more": 37, "information": 38, "assumptions": 39, "recommendations": 40, "pytorch": 41, "blob": 42, "main": 43, "md": 44, "how": 45, "securely": 46, "interact": 47, "models": 48, "severity": 49, "we": 50, "determine": 51, "risk": 52, "each": 53, "taking": 54, "account": 55, "our": 56, "experience": 57, "dealing": 58, "past": 59, "versions": 60, "affected": 61, "common": 62, "defaults": 63, "use": 64, "cases": 65, "following": 66, "categories": 67, "critical": 68, "vulnerabilities": 69, "allow": 70, "remote": 71, "attackers": 72, "execute": 73, "arbitrary": 74, "code": 75, "take": 76, "full": 77, "control": 78, "system": 79, "significantly": 80, "compromise": 81, "confidentiality": 82, "integrity": 83, "availability": 84, "without": 85, "any": 86, "interaction": 87, "privileges": 88, "needed": 89, "examples": 90, "include": 91, "execution": 92, "via": 93, "network": 94, "deserialization": 95, "exploit": 96, "chains": 97, "generally": 98, "those": 99, "which": 100, "rated": 101, "cvss": 102, "high": 103, "serious": 104, "flaws": 105, "elevated": 106, "impact": 107, "like": 108, "rce": 109, "specific": 110, "limited": 111, "contexts": 112, "significant": 113, "data": 114, "loss": 115, "require": 116, "advanced": 117, "conditions": 118, "some": 119, "trust": 120, "deployment": 121, "modes": 122, "multi": 123, "node": 124, "where": 125, "sort": 126, "privileged": 127, "access": 128, "required": 129, "typically": 130, "have": 131, "scores": 132, "between": 133, "moderate": 134, "cause": 135, "denial": 136, "service": 137, "partial": 138, "disruption": 139, "do": 140, "breach": 141, "rating": 142, "low": 143, "minor": 144, "informational": 145, "disclosures": 146, "logging": 147, "errors": 148, "non": 149, "exploitable": 150, "weaknesses": 151, "local": 152, "privilege": 153, "offer": 154, "negligible": 155, "side": 156, "channel": 157, "attacks": 158, "hash": 159, "collisions": 160, "often": 161, "less": 162, "than": 163, "prenotification": 164, "certain": 165, "level": 166, "may": 167, "prenotify": 168, "organizations": 169, "vendors": 170, "ship": 171, "purpose": 172, "coordinated": 173, "release": 174, "fixes": 175, "severe": 176, "private": 177, "email": 178, "notification": 179, "also": 180, "adding": 181, "contacts": 182, "advisory": 183, "few": 184, "days": 185, "before": 186, "you": 187, "wish": 188, "added": 189, "group": 190, "send": 191, "copying": 192, "all": 193, "members": 194, "vendor": 195, "contact": 196, "analyzed": 197, "case": 198, "basis": 199, "withdraw": 200, "from": 201, "receiving": 202, "future": 203, "prenotifications": 204, "other": 205, "about": 206, "public": 207, "membership": 208, "change": 209, "based": 210, "refinements": 211, "who": 212, "included": 213, "spdx": 214, "license": 215, "identifier": 216, "apache": 217, "filecopyrighttext": 218, "copyright": 219, "contributors": 220, "import": 221, "importlib": 222, "traceback": 223, "typing": 224, "callable": 225, "unittest": 226, "mock": 227, "patch": 228, "def": 229, "find_cuda_init": 230, "fn": 231, "object": 232, "none": 233, "helper": 234, "function": 235, "debug": 236, "cuda": 237, "re": 238, "initialization": 239, "initializes": 240, "prints": 241, "stack": 242, "trace": 243, "happens": 244, "torch": 245, "_lazy_init": 246, "wrapper": 247, "nonlocal": 248, "extract_stack": 249, "return": 250, "print": 251, "initialized": 252, "join": 253, "format_list": 254, "strip": 255, "__name__": 256, "__main__": 257, "lambda": 258, "import_module": 259, "model_executor": 260, "llava": 261, "conduct": 262, "pledge": 263, "leaders": 264, "make": 265, "participation": 266, "community": 267, "harassment": 268, "free": 269, "everyone": 270, "regardless": 271, "age": 272, "body": 273, "size": 274, "visible": 275, "invisible": 276, "disability": 277, "ethnicity": 278, "sex": 279, "characteristics": 280, "gender": 281, "identity": 282, "expression": 283, "education": 284, "socioeconomic": 285, "status": 286, "nationality": 287, "personal": 288, "appearance": 289, "race": 290, "caste": 291, "color": 292, "religion": 293, "sexual": 294, "orientation": 295, "act": 296, "ways": 297, "contribute": 298, "open": 299, "welcoming": 300, "diverse": 301, "inclusive": 302, "healthy": 303, "standards": 304, "behavior": 305, "contributes": 306, "positive": 307, "environment": 308, "demonstrating": 309, "empathy": 310, "kindness": 311, "toward": 312, "people": 313, "being": 314, "respectful": 315, "differing": 316, "opinions": 317, "viewpoints": 318, "experiences": 319, "giving": 320, "gracefully": 321, "accepting": 322, "constructive": 323, "feedback": 324, "responsibility": 325, "apologizing": 326, "mistakes": 327, "learning": 328, "focusing": 329, "what": 330, "best": 331, "just": 332, "us": 333, "individuals": 334, "overall": 335, "unacceptable": 336, "sexualized": 337, "language": 338, "imagery": 339, "attention": 340, "advances": 341, "kind": 342, "trolling": 343, "insulting": 344, "derogatory": 345, "comments": 346, "political": 347, "publishing": 348, "others": 349, "physical": 350, "address": 351, "explicit": 352, "permission": 353, "could": 354, "reasonably": 355, "considered": 356, "inappropriate": 357, "professional": 358, "setting": 359, "enforcement": 360, "responsibilities": 361, "responsible": 362, "clarifying": 363, "enforcing": 364, "acceptable": 365, "appropriate": 366, "fair": 367, "corrective": 368, "action": 369, "response": 370, "deem": 371, "threatening": 372, "offensive": 373, "harmful": 374, "right": 375, "remove": 376, "edit": 377, "reject": 378, "commits": 379, "wiki": 380, "edits": 381, "contributions": 382, "aligned": 383, "communicate": 384, "reasons": 385, "moderation": 386, "decisions": 387, "when": 388, "scope": 389, "applies": 390, "within": 391, "spaces": 392, "individual": 393, "officially": 394, "representing": 395, "official": 396, "posting": 397, "social": 398, "media": 399, "acting": 400, "appointed": 401, "representative": 402, "online": 403, "offline": 404, "irl": 405, "event": 406, "instances": 407, "abusive": 408, "harassing": 409, "otherwise": 410, "reported": 411, "slack": 412, "complaints": 413, "reviewed": 414, "investigated": 415, "promptly": 416, "fairly": 417, "obligated": 418, "respect": 419, "privacy": 420, "reporter": 421, "incident": 422, "guidelines": 423, "follow": 424, "determining": 425, "consequences": 426, "violation": 427, "correction": 428, "deemed": 429, "unprofessional": 430, "unwelcome": 431, "consequence": 432, "written": 433, "warning": 434, "providing": 435, "clarity": 436, "around": 437, "nature": 438, "explanation": 439, "why": 440, "apology": 441, "requested": 442, "through": 443, "single": 444, "series": 445, "actions": 446, "continued": 447, "involved": 448, "including": 449, "unsolicited": 450, "specified": 451, "period": 452, "time": 453, "includes": 454, "avoiding": 455, "interactions": 456, "well": 457, "external": 458, "channels": 459, "violating": 460, "terms": 461, "lead": 462, "temporary": 463, "permanent": 464, "ban": 465, "sustained": 466, "communication": 467, "allowed": 468, "during": 469, "pattern": 470, "aggression": 471, "disparagement": 472, "classes": 473, "attribution": 474, "adapted": 475, "contributor": 476, "covenant": 477, "www": 478, "org": 479, "version": 480, "available": 481, "v2": 482, "code_of_conduct": 483, "were": 484, "inspired": 485, "mozilla": 486, "ladder": 487, "inclusion": 488, "answers": 489, "questions": 490, "faq": 491, "translations": 492, "ctypes": 493, "util": 494, "json": 495, "os": 496, "shutil": 497, "subprocess": 498, "sys": 499, "pathlib": 500, "path": 501, "packaging": 502, "parse": 503, "setuptools": 504, "extension": 505, "setup": 506, "command": 507, "build_ext": 508, "setuptools_scm": 509, "get_version": 510, "utils": 511, "cpp_extension": 512, "cuda_home": 513, "rocm_home": 514, "load_module_from_path": 515, "module_name": 516, "spec": 517, "spec_from_file_location": 518, "module": 519, "module_from_spec": 520, "modules": 521, "loader": 522, "exec_module": 523, "root_dir": 524, "__file__": 525, "parent": 526, "logger": 527, "getlogger": 528, "envs": 529, "py": 530, "vllm_target_device": 531, "main_cuda_version": 532, "12": 533, "is_sccache_available": 534, "bool": 535, "sccache": 536, "int": 537, "getenv": 538, "vllm_disable_sccache": 539, "is_ccache_available": 540, "ccache": 541, "is_ninja_available": 542, "ninja": 543, "is_url_available": 544, "url": 545, "str": 546, "urllib": 547, "request": 548, "urlopen": 549, "try": 550, "except": 551, "exception": 552, "false": 553, "200": 554, "class": 555, "cmakeextension": 556, "__init__": 557, "self": 558, "name": 559, "cmake_lists_dir": 560, "kwa": 561, "super": 562, "sources": 563, "py_limited_api": 564, "true": 565, "abspath": 566, "cmake_build_ext": 567, "dict": 568, "directories": 569, "been": 570, "configured": 571, "did_config": 572, "number": 573, "compilation": 574, "jobs": 575, "optionally": 576, "nvcc": 577, "compile": 578, "threads": 579, "compute_num_jobs": 580, "num_jobs": 581, "either": 582, "value": 583, "max_jobs": 584, "variable": 585, "defined": 586, "cpus": 587, "info": 588, "else": 589, "sched_getaffinity": 590, "isn": 591, "universally": 592, "so": 593, "fall": 594, "back": 595, "cpu_count": 596, "get": 597, "error": 598, "here": 599, "len": 600, "attributeerror": 601, "nvcc_threads": 602, "_is_cuda": 603, "get_nvcc_cuda_version": 604, "11": 605, "set": 606, "reduce": 607, "avoid": 608, "overloading": 609, "max": 610, "perform": 611, "cmake": 612, "configuration": 613, "configure": 614, "ext": 615, "ve": 616, "already": 617, "cmakelists": 618, "txt": 619, "exit": 620, "early": 621, "select": 622, "build": 623, "type": 624, "note": 625, "optimization": 626, "default_cfg": 627, "relwithdebinfo": 628, "cfg": 629, "cmake_build_type": 630, "cmake_args": 631, "dcmake_build_type": 632, "format": 633, "dvllm_target_device": 634, "verbose": 635, "dcmake_verbose_makefile": 636, "dcmake_c_compiler_launcher": 637, "dcmake_cxx_compiler_launcher": 638, "dcmake_cuda_compiler_launcher": 639, "dcmake_hip_compiler_launcher": 640, "elif": 641, "pass": 642, "python": 643, "executable": 644, "can": 645, "find": 646, "exact": 647, "match": 648, "dvllm_python_executable": 649, "reuse": 650, "dependencies": 651, "subsequent": 652, "calls": 653, "dvllm_python_path": 654, "override": 655, "base": 656, "directory": 657, "fetchcontent": 658, "downloads": 659, "root": 660, "deps": 661, "allows": 662, "sharing": 663, "profiles": 664, "plays": 665, "nicely": 666, "fetchcontent_base_dir": 667, "fc_base_dir": 668, "environ": 669, "dfetchcontent_base_dir": 670, "parallelism": 671, "tool": 672, "num_job": 673, "dnvcc_threads": 674, "build_tool": 675, "dcmake_job_pool_compile": 676, "string": 677, "dcmake_job_pools": 678, "default": 679, "whatever": 680, "picks": 681, "sure": 682, "dcmake_cuda_compiler": 683, "bin": 684, "check_call": 685, "cwd": 686, "build_temp": 687, "build_extensions": 688, "ensure": 689, "present": 690, "working": 691, "check_output": 692, "oserror": 693, "raise": 694, "runtimeerror": 695, "cannot": 696, "create": 697, "does": 698, "exist": 699, "exists": 700, "makedirs": 701, "targets": 702, "target_name": 703, "removeprefix": 704, "vllm_flash_attn": 705, "extensions": 706, "append": 707, "build_args": 708, "target": 709, "install": 710, "libraries": 711, "proper": 712, "location": 713, "outdir": 714, "get_ext_fullpath": 715, "absolute": 716, "skip": 717, "directo": 718, "ry": 719, "same": 720, "continue": 721, "appends": 722, "prefix": 723, "contains": 724, "need": 725, "range": 726, "count": 727, "should": 728, "actually": 729, "components": 730, "install_args": 731, "component": 732, "run": 733, "first": 734, "standard": 735, "copy": 736, "build_lib": 737, "current": 738, "editable": 739, "glob": 740, "files": 741, "recursive": 742, "file": 743, "dst_file": 744, "split": 745, "dirname": 746, "exist_ok": 747, "copy_file": 748, "precompiled_build_ext": 749, "disables": 750, "building": 751, "precompiled": 752, "binaries": 753, "assert": 754, "vllm_use_precompiled": 755, "only": 756, "supported": 757, "builds": 758, "skipping": 759, "precompiled_wheel_utils": 760, "extracts": 761, "existing": 762, "wheel": 763, "staticmethod": 764, "extract_precompiled_and_patch_package": 765, "wheel_url_or_path": 766, "tempfile": 767, "zipfile": 768, "temp_dir": 769, "isfile": 770, "wheel_filename": 771, "mkdtemp": 772, "wheels": 773, "wheel_path": 774, "downloading": 775, "urlretrieve": 776, "filename": 777, "package_data_patch": 778, "files_to_copy": 779, "_c": 780, "abi3": 781, "_moe_c": 782, "_flashmla_c": 783, "_vllm_fa2_c": 784, "_vllm_fa3_c": 785, "cumem_allocator": 786, "compiled_regex": 787, "file_members": 788, "list": 789, "filter": 790, "filelist": 791, "extract": 792, "target_path": 793, "target_pa": 794, "th": 795, "src": 796, "wb": 797, "dst": 798, "copyfileobj": 799, "pkg": 800, "replace": 801, "setdefault": 802, "basename": 803, "finally": 804, "removing": 805, "rmtree": 806, "get_base_commit_in_main_branch": 807, "force": 808, "nightly": 809, "mainly": 810, "used": 811, "ci": 812, "testing": 813, "vllm_test_use_precompiled_nightly_wheel": 814, "commit": 815, "upstream": 816, "branch": 817, "resp_json": 818, "curl": 819, "api": 820, "repos": 821, "decode": 822, "utf": 823, "upstream_main_commit": 824, "loads": 825, "sha": 826, "docker": 827, "context": 828, "git": 829, "immutable": 830, "missing": 831, "vllm_docker_build_context": 832, "check": 833, "repo": 834, "cat": 835, "calledprocesserror": 836, "fetch": 837, "repository": 838, "update": 839, "branches": 840, "ensures": 841, "ref": 842, "its": 843, "history": 844, "current_branch": 845, "show": 846, "base_commit": 847, "merge": 848, "valueerror": 849, "err": 850, "failed": 851, "compatible": 852, "your": 853, "dev": 854, "_no_device": 855, "empty": 856, "has_cuda": 857, "_is_neuron": 858, "_is_tpu": 859, "_is_hip": 860, "rocm": 861, "hip": 862, "neuron": 863, "tpu": 864, "_is_cpu": 865, "cpu": 866, "_is_xpu": 867, "xpu": 868, "_build_custom_ops": 869, "get_rocm_version": 870, "librocm": 871, "core": 872, "d11f5c20d500f729c393680a01fa902ebf92094b": 873, "rocm_version": 874, "cpp": 875, "l21": 876, "librocm_core_file": 877, "lib": 878, "is_file": 879, "librocm_core": 880, "cdll": 881, "vererrors": 882, "c_uint32": 883, "get_rocm_core_version": 884, "getrocmversion": 885, "restype": 886, "argtypes": 887, "pointer": 888, "major": 889, "byref": 890, "get_neuronxcc_version": 891, "sysconfig": 892, "site_dir": 893, "get_paths": 894, "purelib": 895, "version_file": 896, "neuronxcc": 897, "executed": 898, "successfully": 899, "fp": 900, "content": 901, "read": 902, "regular": 903, "search": 904, "__version__": 905, "output": 906, "nvidia": 907, "apex": 908, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 909, "nvcc_output": 910, "universal_newlines": 911, "release_idx": 912, "index": 913, "nvcc_cuda_version": 914, "get_gaudi_sw_version": 915, "returns": 916, "driver": 917, "enable": 918, "console": 919, "printing": 920, "hl": 921, "smi": 922, "shell": 923, "text": 924, "capture_output": 925, "env": 926, "enable_console": 927, "returncode": 928, "stdout": 929, "get_vllm_version": 930, "write_to": 931, "_version": 932, "sep": 933, "might": 934, "contain": 935, "cuda_version": 936, "cuda_version_str": 937, "source": 938, "tarball": 939, "pypi": 940, "sdist": 941, "argv": 942, "cu": 943, "neuron_version": 944, "neuron_version_str": 945, "unknown": 946, "runtime": 947, "get_requirements": 948, "package": 949, "requirements": 950, "requirements_dir": 951, "_read_requirements": 952, "resolved_requirements": 953, "line": 954, "startswith": 955, "cuda_major": 956, "cuda_minor": 957, "modified_requirements": 958, "req": 959, "flash": 960, "attn": 961, "built": 962, "unsupported": 963, "platform": 964, "ext_modules": 965, "package_data": 966, "typed": 967, "layers": 968, "fused_moe": 969, "configs": 970, "quantization": 971, "releasing": 972, "releases": 973, "reliable": 974, "packaged": 975, "binary": 976, "conveniently": 977, "accessed": 978, "serve": 979, "key": 980, "milestones": 981, "development": 982, "newly": 983, "features": 984, "improvements": 985, "upcoming": 986, "changes": 987, "affect": 988, "users": 989, "potential": 990, "breaking": 991, "versioning": 992, "uses": 993, "shifted": 994, "scheme": 995, "out": 996, "every": 997, "weeks": 998, "bug": 999, "opposed": 1000, "semver": 1001, "backwards": 1002, "made": 1003, "special": 1004, "post1": 1005, "released": 1006, "_major_": 1007, "architectural": 1008, "milestone": 1009, "incompatible": 1010, "similar": 1011, "_minor_": 1012, "_patch_": 1013, "_post1_": 1014, "_patch": 1015, "1_": 1016, "implicit": 1017, "post": 1018, "cadence": 1019, "bi": 1020, "weekly": 1021, "after": 1022, "year": 1023, "2025": 1024, "dates": 1025, "below": 1026, "tentative": 1027, "optional": 1028, "date": 1029, "jan": 1030, "feb": 1031, "mar": 1032, "apr": 1033, "jun": 1034, "10": 1035, "jul": 1036, "13": 1037, "aug": 1038, "14": 1039, "15": 1040, "16": 1041, "17": 1042, "oct": 1043, "18": 1044, "19": 1045, "nov": 1046, "20": 1047, "21": 1048, "dec": 1049, "22": 1050, "23": 1051, "dedicated": 1052, "cut": 1053, "performed": 1054, "live": 1055, "previously": 1056, "reused": 1057, "triggered": 1058, "push": 1059, "rc": 1060, "tag": 1061, "vx": 1062, "rc1": 1063, "enables": 1064, "test": 1065, "multiple": 1066, "rcs": 1067, "final": 1068, "trigger": 1069, "notes": 1070, "assets": 1071, "created": 1072, "monitor": 1073, "reverts": 1074, "apply": 1075, "cherry": 1076, "pick": 1077, "criteria": 1078, "approach": 1079, "finalizing": 1080, "clear": 1081, "process": 1082, "land": 1083, "pr": 1084, "has": 1085, "sufficient": 1086, "complete": 1087, "thorough": 1088, "round": 1089, "stable": 1090, "regression": 1091, "functional": 1092, "performance": 1093, "against": 1094, "most": 1095, "recent": 1096, "silent": 1097, "incorrectness": 1098, "compatibility": 1099, "crashes": 1100, "deadlocks": 1101, "large": 1102, "memory": 1103, "leaks": 1104, "introduced": 1105, "identifiers": 1106, "feature": 1107, "work": 1108, "prs": 1109, "merged": 1110, "trunk": 1111, "manual": 1112, "validations": 1113, "e2e": 1114, "validation": 1115, "end": 1116, "regressions": 1117, "benchmark": 1118, "workflow": 1119, "integration": 1120, "workflows": 1121, "yml": 1122, "coverage": 1123, "llama3": 1124, "llama4": 1125, "mixtral": 1126, "hardware": 1127, "h100": 1128, "amd": 1129, "mi300x": 1130, "_note": 1131, "availability_": 1132, "step": 1133, "write": 1134, "review": 1135, "familiarize": 1136, "yourself": 1137, "configurations": 1138, "tree": 1139, "benchmarks": 1140, "navigate": 1141, "v0": 1142, "results": 1143, "once": 1144, "completes": 1145, "dashboard": 1146, "hud": 1147, "llms": 1148, "reponame": 1149, "2fvllm": 1150, "under": 1151, "corresponding": 1152, "comparison": 1153, "compare": 1154, "previous": 1155, "verify": 1156, "occurred": 1157, "example": 1158, "vs": 1159, "starttime": 1160, "thu": 1161, "2c": 1162, "2017": 1163, "20apr": 1164, "202025": 1165, "2021": 1166, "3a43": 1167, "3a50": 1168, "20gmt": 1169, "stoptime": 1170, "wed": 1171, "2016": 1172, "20jul": 1173, "granularity": 1174, "week": 1175, "lbranch": 1176, "lcommit": 1177, "b6553be1bc75f046b00046a4ad7576364d03c835": 1178, "rbranch": 1179, "rcommit": 1180, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 1181, "benchmarkname": 1182, "modelname": 1183, "20models": 1184, "backendname": 1185, "20backends": 1186, "modename": 1187, "20modes": 1188, "dtypename": 1189, "20dtype": 1190, "devicename": 1191, "20devices": 1192, "archname": 1193, "20platforms": 1194, "markdownlint": 1195, "disable": 1196, "md001": 1197, "md041": 1198, "align": 1199, "center": 1200, "picture": 1201, "prefers": 1202, "dark": 1203, "srcset": 1204, "raw": 1205, "githubusercontent": 1206, "logos": 1207, "logo": 1208, "png": 1209, "img": 1210, "alt": 1211, "light": 1212, "width": 1213, "55": 1214, "h3": 1215, "easy": 1216, "fast": 1217, "cheap": 1218, "llm": 1219, "serving": 1220, "href": 1221, "blog": 1222, "arxiv": 1223, "abs": 1224, "2309": 1225, "06180": 1226, "paper": 1227, "vllm_project": 1228, "twitter": 1229, "discuss": 1230, "user": 1231, "forum": 1232, "developer": 1233, "news": 1234, "08": 1235, "hosted": 1236, "beijing": 1237, "meetup": 1238, "mp": 1239, "weixin": 1240, "qq": 1241, "dgkwg1wfpwgo2jcdtqqhxa": 1242, "scale": 1243, "slides": 1244, "drive": 1245, "google": 1246, "folders": 1247, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 1248, "recording": 1249, "chaspark": 1250, "1166916873711665152": 1251, "05": 1252, "nyc": 1253, "lu": 1254, "ma": 1255, "c1rqyf1f": 1256, "presentation": 1257, "1_q_aw_iomjwuimf1s1ym": 1258, "zhjxz8cuel0ijvaquoybea": 1259, "usp": 1260, "now": 1261, "foundation": 1262, "announcement": 1263, "welcomes": 1264, "01": 1265, "excited": 1266, "announce": 1267, "alpha": 1268, "v1": 1269, "upgrade": 1270, "7x": 1271, "speedup": 1272, "clean": 1273, "optimized": 1274, "loop": 1275, "zero": 1276, "overhead": 1277, "caching": 1278, "enhanced": 1279, "multimodal": 1280, "support": 1281, "27": 1282, "details": 1283, "summary": 1284, "04": 1285, "asia": 1286, "day": 1287, "sginnovate": 1288, "morning": 1289, "evening": 1290, "slots": 1291, "remaining": 1292, "inaugural": 1293, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 1294, "03": 1295, "ollama": 1296, "inference": 1297, "night": 1298, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 1299, "china": 1300, "n77gibl2coratqhtveazfg": 1301, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 1302, "east": 1303, "coast": 1304, "7mu4k4xx": 1305, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 1306, "slide": 1307, "id": 1308, "g31441846c39_0_0": 1309, "02": 1310, "ninth": 1311, "h7g3kuj9": 1312, "meta": 1313, "1jzc_pzvxrvnsfvcw": 1314, "v4cfxb6pn7zz2cyp_flwo05aqg": 1315, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 1316, "view": 1317, "posted": 1318, "eighth": 1319, "zep56hui": 1320, "cloud": 1321, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 1322, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 1323, "2024": 1324, "joins": 1325, "ecosystem": 1326, "seventh": 1327, "h0qvrajz": 1328, "snowflake": 1329, "1e3cxqbv3jsfgp30swyvs3em_tw": 1330, "ghohj9pajgk6kr54": 1331, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 1332, "coordinating": 1333, "discussing": 1334, "feel": 1335, "ray": 1336, "summit": 1337, "held": 1338, "track": 1339, "opening": 1340, "talk": 1341, "1b_kqxphbtra_mdf": 1342, "tr6i8rwdou5qotznceg2mkzxehm": 1343, "learn": 1344, "talks": 1345, "youtube": 1346, "playlist": 1347, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 1348, "09": 1349, "sixth": 1350, "87q3nvnh": 1351, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 1352, "9wqyp7ny93xrs": 1353, "07": 1354, "fifth": 1355, "lp0gyjqr": 1356, "aws": 1357, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 1358, "partnership": 1359, "supports": 1360, "llama": 1361, "fp8": 1362, "pipeline": 1363, "llama31": 1364, "06": 1365, "fourth": 1366, "agivllm": 1367, "cloudflare": 1368, "bentoml": 1369, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 1370, "third": 1371, "robloxandvllmmeetup2024": 1372, "splashthat": 1373, "roblox": 1374, "1a": 1375, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 1376, "second": 1377, "ygxbpzhl": 1378, "ibm": 1379, "12mi2skabnuw5rbwxdyy": 1380, "hthth4imsnceoq10jdqbxga": 1381, "2023": 1382, "a16z": 1383, "1ql": 1384, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 1385, "would": 1386, "express": 1387, "sincere": 1388, "gratitude": 1389, "andreessen": 1390, "horowitz": 1391, "30": 1392, "supporting": 1393, "generous": 1394, "grant": 1395, "research": 1396, "fastchat": 1397, "powered": 1398, "lmsys": 1399, "vicuna": 1400, "chatbot": 1401, "arena": 1402, "chat": 1403, "since": 1404, "mid": 1405, "april": 1406, "library": 1407, "originally": 1408, "developed": 1409, "sky": 1410, "computing": 1411, "lab": 1412, "cs": 1413, "berkeley": 1414, "edu": 1415, "uc": 1416, "evolved": 1417, "driven": 1418, "both": 1419, "academia": 1420, "industry": 1421, "state": 1422, "art": 1423, "throughput": 1424, "efficient": 1425, "pagedattention": 1426, "continuous": 1427, "batching": 1428, "incoming": 1429, "requests": 1430, "graph": 1431, "quantizations": 1432, "gptq": 1433, "2210": 1434, "17323": 1435, "awq": 1436, "2306": 1437, "00978": 1438, "autoround": 1439, "05516": 1440, "int4": 1441, "int8": 1442, "kernels": 1443, "flashattention": 1444, "flashinfer": 1445, "speculative": 1446, "decoding": 1447, "chunked": 1448, "prefill": 1449, "flexible": 1450, "seamless": 1451, "popular": 1452, "hugging": 1453, "face": 1454, "various": 1455, "algorithms": 1456, "parallel": 1457, "sampling": 1458, "beam": 1459, "tensor": 1460, "expert": 1461, "distributed": 1462, "streaming": 1463, "outputs": 1464, "openai": 1465, "server": 1466, "gpus": 1467, "intel": 1468, "powerpc": 1469, "lora": 1470, "seamlessly": 1471, "huggingface": 1472, "transformer": 1473, "mixture": 1474, "deepseek": 1475, "v3": 1476, "embedding": 1477, "e5": 1478, "mistral": 1479, "modal": 1480, "supported_models": 1481, "getting": 1482, "started": 1483, "pip": 1484, "getting_started": 1485, "installation": 1486, "gpu": 1487, "bash": 1488, "visit": 1489, "quickstart": 1490, "welcome": 1491, "collaborations": 1492, "sponsors": 1493, "compute": 1494, "resources": 1495, "thank": 1496, "them": 1497, "alphabetical": 1498, "order": 1499, "keep": 1500, "consistent": 1501, "cash": 1502, "donations": 1503, "dropbox": 1504, "sequoia": 1505, "capital": 1506, "skywork": 1507, "zhenfund": 1508, "alibaba": 1509, "anyscale": 1510, "crusoe": 1511, "databricks": 1512, "deepinfra": 1513, "nebius": 1514, "novita": 1515, "replicate": 1516, "runpod": 1517, "trainy": 1518, "san": 1519, "diego": 1520, "sponsor": 1521, "fundraising": 1522, "venue": 1523, "opencollective": 1524, "plan": 1525, "fund": 1526, "maintenance": 1527, "adoption": 1528, "citation": 1529, "cite": 1530, "bibtex": 1531, "inproceedings": 1532, "kwon2023efficient": 1533, "title": 1534, "author": 1535, "woosuk": 1536, "kwon": 1537, "zhuohan": 1538, "li": 1539, "siyuan": 1540, "zhuang": 1541, "ying": 1542, "sheng": 1543, "lianmin": 1544, "zheng": 1545, "cody": 1546, "hao": 1547, "yu": 1548, "joseph": 1549, "gonzalez": 1550, "zhang": 1551, "ion": 1552, "stoica": 1553, "booktitle": 1554, "proceedings": 1555, "acm": 1556, "sigops": 1557, "29th": 1558, "symposium": 1559, "operating": 1560, "systems": 1561, "principles": 1562, "start": 1563, "technical": 1564, "fellow": 1565, "partnerships": 1566, "lists": 1567, "mailto": 1568, "kit": 1569, "refer": 1570, "requires_files": 1571, "pyproject": 1572, "toml": 1573, "cleaning": 1574, "lines": 1575, "readlines": 1576, "lower": 1577, "removed": 1578, "done": 1579, "dataclasses": 1580, "random": 1581, "transformers": 1582, "pretrainedtokenizerbase": 1583, "samplingparams": 1584, "engine": 1585, "arg_utils": 1586, "engineargs": 1587, "flexibleargumentparser": 1588, "prompt": 1589, "helpful": 1590, "assistant": 1591, "recognizes": 1592, "tables": 1593, "markdown": 1594, "table": 1595, "fellows": 1596, "answer": 1597, "my": 1598, "question": 1599, "sl": 1600, "film": 1601, "cast": 1602, "director": 1603, "music": 1604, "agni": 1605, "pushpam": 1606, "jayabharathi": 1607, "kamalahasan": 1608, "jeassy": 1609, "arjunan": 1610, "priyamvada": 1611, "mohan": 1612, "sharma": 1613, "lakshmi": 1614, "kpac": 1615, "lalitha": 1616, "sethumadhavan": 1617, "dakshinamoorthy": 1618, "yakshagaanam": 1619, "madhu": 1620, "sheela": 1621, "viswanathan": 1622, "paalkkadal": 1623, "sharada": 1624, "prasad": 1625, "ummer": 1626, "amma": 1627, "srividya": 1628, "krishnan": 1629, "nair": 1630, "appooppan": 1631, "thikkurissi": 1632, "sukumaran": 1633, "kamal": 1634, "haasan": 1635, "bhaskaran": 1636, "baburaj": 1637, "srishti": 1638, "chowalloor": 1639, "krishnankutty": 1640, "ravi": 1641, "alummoodu": 1642, "muhammad": 1643, "vanadevatha": 1644, "prem": 1645, "nazir": 1646, "madhubala": 1647, "yusufali": 1648, "kechery": 1649, "devarajan": 1650, "samasya": 1651, "kamalahaasan": 1652, "thankappan": 1653, "shyam": 1654, "yudhabhoomi": 1655, "vidhubala": 1656, "crossbelt": 1657, "mani": 1658, "shekhar": 1659, "seemantha": 1660, "puthran": 1661, "raj": 1662, "swapnadanam": 1663, "rani": 1664, "chandra": 1665, "dr": 1666, "mohandas": 1667, "george": 1668, "bhaskar": 1669, "chandavarkar": 1670, "thulavarsham": 1671, "sreedevi": 1672, "sudheer": 1673, "sankaran": 1674, "aruthu": 1675, "kaviyoor": 1676, "ponnamma": 1677, "26": 1678, "swimming": 1679, "pool": 1680, "soman": 1681, "sasikumar": 1682, "nwhat": 1683, "cells": 1684, "test_prefix": 1685, "sampling_params": 1686, "prompts": 1687, "start_time": 1688, "generate": 1689, "end_time": 1690, "cost": 1691, "prompt_len": 1692, "output_len": 1693, "sample_tokens": 1694, "tokenizer": 1695, "length": 1696, "vocab": 1697, "get_vocab": 1698, "all_special_ids": 1699, "tokens": 1700, "choices": 1701, "items": 1702, "sample_requests_from_dataset": 1703, "dataset_path": 1704, "num_requests": 1705, "input_length_range": 1706, "tuple": 1707, "fixed_output_len": 1708, "too": 1709, "small": 1710, "load": 1711, "dataset": 1712, "conversations": 1713, "turns": 1714, "two": 1715, "conversation": 1716, "shuffle": 1717, "min_len": 1718, "max_len": 1719, "sequences": 1720, "long": 1721, "short": 1722, "filtered_requests": 1723, "break": 1724, "tokenize": 1725, "completions": 1726, "prompt_token_ids": 1727, "input_ids": 1728, "completion": 1729, "completion_token_ids": 1730, "sample_requests_from_random": 1731, "prefix_len": 1732, "prefix_token_ids": 1733, "unique_part_token_ids": 1734, "randint": 1735, "repeat_and_sort_requests": 1736, "repeat_count": 1737, "repeated_requests": 1738, "args": 1739, "get_tokenizer": 1740, "trust_remote_code": 1741, "map": 1742, "seed": 1743, "provided": 1744, "sample": 1745, "num_prompts": 1746, "stats": 1747, "sampled": 1748, "prompt_lens": 1749, "average": 1750, "input": 1751, "sum": 1752, "p50": 1753, "sorted": 1754, "min": 1755, "engine_args": 1756, "from_cli_args": 1757, "asdict": 1758, "temperature": 1759, "max_tokens": 1760, "detokenize": 1761, "disable_detokenize": 1762, "filtered": 1763, "generating": 1764, "test_": 1765, "create_argument_parser": 1766, "parser": 1767, "description": 1768, "automatic": 1769, "add_argument": 1770, "help": 1771, "num": 1772, "repeat": 1773, "times": 1774, "store_true": 1775, "lengths": 1776, "128": 1777, "256": 1778, "specifies": 1779, "subtract": 1780, "filtering": 1781, "responses": 1782, "detokenization": 1783, "latency": 1784, "measurement": 1785, "add_cli_args": 1786, "io": 1787, "dataclass": 1788, "field": 1789, "union": 1790, "aiohttp": 1791, "huggingface_hub": 1792, "constants": 1793, "tqdm": 1794, "asyncio": 1795, "autotokenizer": 1796, "pretrainedtokenizer": 1797, "pretrainedtokenizerfast": 1798, "aiohttp_timeout": 1799, "clienttimeout": 1800, "total": 1801, "60": 1802, "requestfuncinput": 1803, "api_url": 1804, "model_name": 1805, "logprobs": 1806, "extra_body": 1807, "multi_modal_content": 1808, "ignore_eos": 1809, "requestfuncoutput": 1810, "generated_text": 1811, "success": 1812, "float": 1813, "output_tokens": 1814, "ttft": 1815, "token": 1816, "itl": 1817, "default_factory": 1818, "inter": 1819, "latencies": 1820, "tpot": 1821, "avg": 1822, "next": 1823, "get_model": 1824, "pretrained_model_name_or_path": 1825, "vllm_use_modelscope": 1826, "modelscope": 1827, "snapshot_download": 1828, "model_loader": 1829, "weight_utils": 1830, "get_lock": 1831, "lock": 1832, "prevent": 1833, "processes": 1834, "weights": 1835, "model_path": 1836, "model_id": 1837, "local_files_only": 1838, "hf_hub_offline": 1839, "ignore_file_pattern": 1840, "pt": 1841, "safetensors": 1842, "tokenizer_mode": 1843, "auto": 1844, "kwargs": 1845, "slow": 1846, "use_fast": 1847, "mode": 1848, "transformers_utils": 1849, "mistraltokenizer": 1850, "importerror": 1851, "requires": 1852, "from_pretrained": 1853, "async_request_funcs": 1854, "tgi": 1855, "async_request_tgi": 1856, "async_request_openai_completions": 1857, "lmdeploy": 1858, "deepspeed": 1859, "mii": 1860, "async_request_deepspeed_mii": 1861, "async_request_openai_chat_completions": 1862, "audio": 1863, "async_request_openai_audio": 1864, "tensorrt": 1865, "async_request_trt_llm": 1866, "scalellm": 1867, "sglang": 1868, "openai_compatible_backends": 1869, "base64": 1870, "abc": 1871, "abstractmethod": 1872, "collections": 1873, "mapping": 1874, "functools": 1875, "cache": 1876, "bytesio": 1877, "numpy": 1878, "np": 1879, "pandas": 1880, "pd": 1881, "datasets": 1882, "load_dataset": 1883, "pil": 1884, "image": 1885, "lorarequest": 1886, "get_adapter_absolute_path": 1887, "multimodaldatadict": 1888, "convert_image_mode": 1889, "anytokenizer": 1890, "get_lora_tokenizer": 1891, "samplerequest": 1892, "represents": 1893, "benchmarking": 1894, "expected_output_len": 1895, "multi_modal_data": 1896, "lora_request": 1897, "benchmarkdataset": 1898, "default_seed": 1899, "is_multimodal": 1900, "random_seed": 1901, "initialize": 1902, "indicates": 1903, "reproducible": 1904, "shuffling": 1905, "ensuring": 1906, "replaced": 1907, "apply_multimodal_chat_transformation": 1908, "mm_content": 1909, "transform": 1910, "method": 1911, "expect": 1912, "role": 1913, "load_data": 1914, "must": 1915, "overridden": 1916, "subclasses": 1917, "vary": 1918, "depending": 1919, "raises": 1920, "notimplementederror": 1921, "subclass": 1922, "implement": 1923, "todo": 1924, "jenniferzhao": 1925, "add": 1926, "implemented": 1927, "get_random_lora_request": 1928, "max_loras": 1929, "option": 1930, "al": 1931, "lora_path": 1932, "associated": 1933, "parameters": 1934, "randomly": 1935, "selects": 1936, "retrieves": 1937, "cached": 1938, "selected": 1939, "maximum": 1940, "loras": 1941, "disk": 1942, "element": 1943, "applicable": 1944, "lora_id": 1945, "lora_name": 1946, "lora_int_id": 1947, "lora_path_on_disk": 1948, "lora_tokenizer_cache": 1949, "abstract": 1950, "subcl": 1951, "asses": 1952, "logic": 1953, "objects": 1954, "processing": 1955, "generated": 1956, "maybe_oversample_requests": 1957, "oversamples": 1958, "desired": 1959, "additional": 1960, "extend": 1961, "oversampled": 1962, "reach": 1963, "samples": 1964, "is_valid_sequence": 1965, "max_prompt_len": 1966, "1024": 1967, "max_total_len": 1968, "2048": 1969, "skip_min_output_len_check": 1970, "validate": 1971, "sequence": 1972, "pruning": 1973, "copied": 1974, "original": 1975, "sample_hf_requests": 1976, "sample_sharegpt_requests": 1977, "functions": 1978, "benchmark_serving": 1979, "sample_requests": 1980, "benchmark_throughput": 1981, "invalid": 1982, "prompt_too_short": 1983, "output_too_short": 1984, "prompt_too_long": 1985, "combined_too_long": 1986, "met": 1987, "process_image": 1988, "multimedia": 1989, "dictionary": 1990, "three": 1991, "types": 1992, "bytes": 1993, "expects": 1994, "containing": 1995, "converts": 1996, "rgb": 1997, "saves": 1998, "jpeg": 1999, "encodes": 2000, "treats": 2001, "prepends": 2002, "doesn": 2003, "http": 2004, "isinstance": 2005, "image_data": 2006, "save": 2007, "image_base64": 2008, "b64encode": 2009, "getvalue": 2010, "image_url": 2011, "randomdataset": 2012, "values": 2013, "default_prefix_len": 2014, "default_range_ratio": 2015, "default_input_len": 2016, "default_output_len": 2017, "range_ratio": 2018, "input_len": 2019, "enforce": 2020, "random_range_ratio": 2021, "valid": 2022, "vocab_size": 2023, "num_special_tokens": 2024, "num_special_tokens_to_add": 2025, "real_input_len": 2026, "tolist": 2027, "input_low": 2028, "input_high": 2029, "output_low": 2030, "bound": 2031, "least": 2032, "failures": 2033, "output_high": 2034, "debugging": 2035, "input_lens": 2036, "output_lens": 2037, "offsets": 2038, "inner_seq": 2039, "arange": 2040, "token_sequence": 2041, "encode": 2042, "again": 2043, "because": 2044, "consecutive": 2045, "give": 2046, "tokenized": 2047, "gpt2tokenizer": 2048, "6880": 2049, "6881": 2050, "ġcalls": 2051, "1650": 2052, "939": 2053, "486": 2054, "ġcall": 2055, "sh": 2056, "ere": 2057, "uncontrolled": 2058, "encoded": 2059, "truncated": 2060, "total_input_len": 2061, "re_encoded_sequence": 2062, "add_special_tokens": 2063, "sharegptdataset": 2064, "implements": 2065, "sharegpt": 2066, "generates": 2067, "loading": 2068, "encoding": 2069, "entries": 2070, "entry": 2071, "enable_multimodal_chat": 2072, "prompt_ids": 2073, "completion_ids": 2074, "new_output_len": 2075, "sharegpt4video": 2076, "image_path": 2077, "customdataset": 2078, "custom": 2079, "jsonl": 2080, "india": 2081, "iran": 2082, "dictionaries": 2083, "standardized": 2084, "convert": 2085, "filetype": 2086, "assume": 2087, "endswith": 2088, "jsonl_data": 2089, "read_json": 2090, "path_or_buf": 2091, "column": 2092, "columns": 2093, "row": 2094, "dataframe": 2095, "corresponds": 2096, "want": 2097, "iterrows": 2098, "to_dict": 2099, "skip_chat_template": 2100, "sampled_requests": 2101, "item": 2102, "template": 2103, "apply_chat_template": 2104, "add_generation_prompt": 2105, "sonnetdataset": 2106, "simplified": 2107, "implementation": 2108, "sonnet": 2109, "poem": 2110, "550": 2111, "150": 2112, "return_prompt_formatted": 2113, "calculate": 2114, "tokenized_lines": 2115, "avg_len": 2116, "base_prompt": 2117, "many": 2118, "base_msg": 2119, "base_fmt": 2120, "base_offset": 2121, "higher": 2122, "num_input_lines": 2123, "num_prefix_lines": 2124, "prefix_lines": 2125, "while": 2126, "extra_lines": 2127, "msg": 2128, "prompt_formatted": 2129, "burstgptdataset": 2130, "burstgpt": 2131, "csv": 2132, "synthetic": 2133, "generation": 2134, "rows": 2135, "gpt": 2136, "df": 2137, "read_csv": 2138, "gpt4_df": 2139, "_sample_loaded_data": 2140, "random_state": 2141, "lora_req": 2142, "ist": 2143, "ids": 2144, "computed": 2145, "modulo": 2146, "token_ids": 2147, "huggingfacedataset": 2148, "supported_dataset_paths": 2149, "dataset_split": 2150, "no_stream": 2151, "dataset_subset": 2152, "load_stream": 2153, "conversationdataset": 2154, "lmms": 2155, "onevision": 2156, "aeala": 2157, "sharegpt_vicuna_unfiltered": 2158, "filtered_data": 2159, "dynamic_output": 2160, "conv": 2161, "completion_len": 2162, "enabled": 2163, "longer": 2164, "accurate": 2165, "actual": 2166, "visionarenadataset": 2167, "vision": 2168, "lmarena": 2169, "visionarena": 2170, "bench": 2171, "parser_fn": 2172, "images": 2173, "instructcoderdataset": 2174, "instructcoder": 2175, "co": 2176, "likaixin": 2177, "designed": 2178, "general": 2179, "editing": 2180, "consists": 2181, "114": 2182, "239": 2183, "instruction": 2184, "triplets": 2185, "covers": 2186, "distinct": 2187, "scenario": 2188, "mtbenchdataset": 2189, "mt": 2190, "philschmid": 2191, "turn": 2192, "9d98ab5ec": 2193, "offline_inference": 2194, "eagle": 2195, "l14": 2196, "l18": 2197, "noqa": 2198, "e501": 2199, "sd": 2200, "aimodataset": 2201, "aimo": 2202, "reasoning": 2203, "mo": 2204, "aime": 2205, "numinamath": 2206, "cot": 2207, "problem": 2208, "solution": 2209, "32000": 2210, "zeta_prompt": 2211, "task": 2212, "analyze": 2213, "rewrite": 2214, "excerpt": 2215, "provides": 2216, "suggesting": 2217, "cursor": 2218, "_format_zeta_prompt": 2219, "original_start_marker": 2220, "editable_region_start": 2221, "zeta": 2222, "prediction": 2223, "nep": 2224, "formats": 2225, "expected": 2226, "further": 2227, "extended": 2228, "events": 2229, "inputs": 2230, "marker": 2231, "indicating": 2232, "region": 2233, "formatted": 2234, "focused": 2235, "output_start_index": 2236, "output_focused_region": 2237, "expected_output": 2238, "nexteditpredictiondataset": 2239, "zed": 2240, "industries": 2241, "mapping_prompt_funcs": 2242, "formatting_prompt_func": 2243, "asrdataset": 2244, "asr": 2245, "transcription": 2246, "tested": 2247, "domain": 2248, "speaking": 2249, "style": 2250, "hf": 2251, "subset": 2252, "ted": 2253, "lium": 2254, "oratory": 2255, "release1": 2256, "release2": 2257, "release3": 2258, "speaker": 2259, "adaptation": 2260, "voxpopuli": 2261, "european": 2262, "parliament": 2263, "de": 2264, "fr": 2265, "librispeech": 2266, "audiobook": 2267, "narrated": 2268, "tedlium": 2269, "gigaspeech": 2270, "podcast": 2271, "spontaneous": 2272, "xs": 2273, "xl": 2274, "spgispeech": 2275, "financial": 2276, "meetings": 2277, "ami": 2278, "ihm": 2279, "sdm": 2280, "openslr": 2281, "librispeech_asr": 2282, "facebook": 2283, "edinburghcstr": 2284, "speechcolab": 2285, "kensho": 2286, "whisper": 2287, "interface": 2288, "transcription_preamble": 2289, "startoftranscript": 2290, "transcribe": 2291, "notimestamps": 2292, "skip_long_audios": 2293, "librosa": 2294, "skipped": 2295, "sr": 2296, "array": 2297, "sampling_rate": 2298, "duration_s": 2299, "get_duration": 2300, "duration": 2301, "discarded": 2302, "due": 2303, "greater": 2304, "argparse": 2305, "get_random_flag": 2306, "filtered_dataset": 2307, "prune": 2308, "priority": 2309, "run_vllm": 2310, "llm_engine": 2311, "model_config": 2312, "max_model_len": 2313, "_priority": 2314, "top_p": 2315, "perf_counter": 2316, "use_tqdm": 2317, "namespace": 2318, "synthesize": 2319, "given": 2320, "hi": 2321, "backend": 2322, "elapsed_time": 2323, "total_num_tokens": 2324, "2f": 2325, "output_json": 2326, "requests_per_second": 2327, "tokens_per_second": 2328, "dump": 2329, "indent": 2330, "overrides": 2331, "per": 2332, "gc": 2333, "warnings": 2334, "iterable": 2335, "datetime": 2336, "literal": 2337, "typing_extensions": 2338, "deprecated": 2339, "backend_request_func": 2340, "benchmark_dataset": 2341, "benchmark_utils": 2342, "convert_to_pytorch_benchmark_format": 2343, "write_to_json": 2344, "get_request": 2345, "milliseconds_to_seconds_conversion": 2346, "1000": 2347, "benchmarkmetrics": 2348, "completed": 2349, "total_input": 2350, "total_output": 2351, "request_throughput": 2352, "request_goodput": 2353, "output_throughput": 2354, "total_token_throughput": 2355, "mean_ttft_ms": 2356, "median_ttft_ms": 2357, "std_ttft_ms": 2358, "percentiles_ttft_ms": 2359, "mean_tpot_ms": 2360, "median_tpot_ms": 2361, "std_tpot_ms": 2362, "percentiles_tpot_ms": 2363, "mean_itl_ms": 2364, "median_itl_ms": 2365, "std_itl_ms": 2366, "percentiles_itl_ms": 2367, "e2el": 2368, "stands": 2369, "taken": 2370, "client": 2371, "sending": 2372, "mean_e2el_ms": 2373, "median_e2el_ms": 2374, "std_e2el_ms": 2375, "percentiles_e2el_ms": 2376, "calculate_metrics": 2377, "input_requests": 2378, "dur_s": 2379, "selected_percentile_metrics": 2380, "selected_percentiles": 2381, "goodput_config_dict": 2382, "actual_output_lens": 2383, "good_completed": 2384, "itls": 2385, "tpots": 2386, "all_tpots": 2387, "ttfts": 2388, "e2els": 2389, "backends": 2390, "instead": 2391, "looking": 2392, "bundled": 2393, "together": 2394, "inflate": 2395, "slightly": 2396, "latency_minus_ttft": 2397, "regard": 2398, "goodput": 2399, "valid_metrics": 2400, "slo_values": 2401, "req_metric": 2402, "zip": 2403, "is_good_req": 2404, "warn": 2405, "likely": 2406, "misconfiguration": 2407, "arguments": 2408, "stacklevel": 2409, "metrics": 2410, "mean": 2411, "std": 2412, "median": 2413, "percentile": 2414, "check_goodput_args": 2415, "valid_names": 2416, "parse_goodput": 2417, "slo_name": 2418, "slo_val": 2419, "metric": 2420, "found": 2421, "objective": 2422, "one": 2423, "negative": 2424, "slo_pairs": 2425, "slo_pair": 2426, "argumenttypeerror": 2427, "objectives": 2428, "specify": 2429, "pairs": 2430, "milliseconds": 2431, "save_to_pytorch_benchmark_format": 2432, "file_name": 2433, "p99_ttft_ms": 2434, "p99_tpot_ms": 2435, "p99_itl_ms": 2436, "useful": 2437, "rather": 2438, "big": 2439, "later": 2440, "ignored_metrics": 2441, "generated_texts": 2442, "pt_records": 2443, "extra_info": 2444, "don": 2445, "suffix": 2446, "up": 2447, "pt_file": 2448, "splitext": 2449, "served_model_name": 2450, "tokenizer_id": 2451, "ramp": 2452, "ramp_up_strategy": 2453, "request_rate": 2454, "inf": 2455, "rate": 2456, "controlled": 2457, "argument": 2458, "ramp_up_start_rps": 2459, "ramp_up_end_rps": 2460, "strategy": 2461, "rps": 2462, "exponential": 2463, "base_url": 2464, "endpoint": 2465, "host": 2466, "port": 2467, "dataset_name": 2468, "ataset_name": 2469, "custom_output_len": 2470, "custom_skip_chat_template": 2471, "formatting": 2472, "depends": 2473, "sonnet_input_len": 2474, "sonnet_output_len": 2475, "sonnet_prefix_len": 2476, "chat_template": 2477, "default_chat_template": 2478, "dataset_class": 2479, "hf_split": 2480, "train": 2481, "hf_subset": 2482, "dataset_c": 2483, "lass": 2484, "supported_datasets": 2485, "cls": 2486, "__subclasses__": 2487, "consider": 2488, "hf_output_len": 2489, "structure": 2490, "dataset_mapping": 2491, "sharegpt_output_len": 2492, "random_prefix_len": 2493, "random_input_len": 2494, "random_output_len": 2495, "keyerror": 2496, "collect": 2497, "top_k": 2498, "min_p": 2499, "greedy": 2500, "ackend": 2501, "cache_prompt": 2502, "static": 2503, "pause": 2504, "freeze": 2505, "benchmark_result": 2506, "burstiness": 2507, "disable_tqdm": 2508, "profile": 2509, "percentile_metrics": 2510, "metric_percentiles": 2511, "max_concurrency": 2512, "lora_modules": 2513, "config": 2514, "save_result": 2515, "append_result": 2516, "result_json": 2517, "current_dt": 2518, "strftime": 2519, "metadata": 2520, "kvstring": 2521, "valueer": 2522, "ror": 2523, "traffic": 2524, "result": 2525, "save_detailed": 2526, "fields": 2527, "points": 2528, "del": 2529, "base_model_id": 2530, "max_concurrency_str": 2531, "concurrency": 2532, "qps": 2533, "result_filename": 2534, "result_dir": 2535, "outfile": 2536, "newline": 2537, "tell": 2538, "keys": 2539, "127": 2540, "localhost": 2541, "ipv4": 2542, "8000": 2543, "stream": 2544, "concurrent": 2545, "simulate": 2546, "controls": 2547, "initiated": 2548, "means": 2549, "combination": 2550, "enough": 2551, "part": 2552, "unspecified": 2553, "disabled": 2554, "dummy": 2555, "logprob": 2556, "returned": 2557, "sent": 2558, "poisson": 2559, "gamma": 2560, "distribution": 2561, "arrival": 2562, "factor": 2563, "effect": 2564, "follows": 2565, "intervals": 2566, "bursty": 2567, "uniform": 2568, "arser": 2569, "progress": 2570, "bar": 2571, "profiler": 2572, "launched": 2573, "vllm_torch_profiler_dir": 2574, "detailed": 2575, "saving": 2576, "whether": 2577, "ttfs": 2578, "etc": 2579, "metavar": 2580, "nargs": 2581, "tp": 2582, "saved": 2583, "record": 2584, "keeping": 2585, "purposes": 2586, "dir": 2587, "ignore": 2588, "eos": 2589, "flag": 2590, "deepspeed_mii": 2591, "comma": 2592, "separated": 2593, "percentils": 2594, "percentiles": 2595, "names": 2596, "99": 2597, "25": 2598, "50": 2599, "75": 2600, "definition": 2601, "distserve": 2602, "pdf": 2603, "2401": 2604, "09670": 2605, "blogs": 2606, "custom_group": 2607, "add_argument_group": 2608, "options": 2609, "applying": 2610, "sonnet_group": 2611, "sharegpt_group": 2612, "random_group": 2613, "ratio": 2614, "define": 2615, "symmetric": 2616, "fixed": 2617, "om": 2618, "hf_group": 2619, "sampling_group": 2620, "top": 2621, "parameter": 2622, "always": 2623, "mistral_common": 2624, "preregistered": 2625, "served": 2626, "passed": 2627, "launching": 2628, "script": 2629, "chooses": 2630, "linear": 2631, "initial": 2632, "over": 2633, "starting": 2634, "needs": 2635, "ending": 2636, "math": 2637, "tracebacktype": 2638, "oss": 2639, "integrate": 2640, "database": 2641, "records": 2642, "benchmark_values": 2643, "vars": 2644, "tensor_parallel_size": 2645, "infencoder": 2646, "jsonencoder": 2647, "clear_inf": 2648, "isinf": 2649, "iterencode": 2650, "serializable": 2651, "timecollector": 2652, "ns": 2653, "ms": 2654, "cnt": 2655, "_sum": 2656, "_max": 2657, "monotonic_ns": 2658, "dump_avg_max": 2659, "__enter__": 2660, "__exit__": 2661, "exc_type": 2662, "baseexception": 2663, "exc_value": 2664, "exc_traceback": 2665, "prompttype": 2666, "beamsearchparams": 2667, "avg_latency": 2668, "processed": 2669, "batch": 2670, "automatically": 2671, "batches": 2672, "dummy_prompt_token_ids": 2673, "10000": 2674, "batch_size": 2675, "dummy_prompts": 2676, "llm_generate": 2677, "use_beam_search": 2678, "beam_search": 2679, "beam_width": 2680, "run_to_completion": 2681, "profile_dir": 2682, "start_profile": 2683, "stop_profile": 2684, "warming": 2685, "num_iters_warmup": 2686, "desc": 2687, "warmup": 2688, "iterations": 2689, "vllm_torc": 2690, "h_profiler_dir": 2691, "profiling": 2692, "num_iters": 2693, "percentages": 2694, "90": 2695, "seconds": 2696, "percentage": 2697, "till": 2698, "32": 2699, "iters": 2700, "skews": 2701, "numbers": 2702, "set_defaults": 2703, "enable_prefix_caching": 2704, "uuid": 2705, "asyncgenerator": 2706, "structured_output": 2707, "backend_xgrammar": 2708, "has_xgrammar_unsupported_json_features": 2709, "attributes": 2710, "schema": 2711, "structure_type": 2712, "unique": 2713, "json_schema_path": 2714, "dir_path": 2715, "realpath": 2716, "structured_schemas": 2717, "structured_schema_1": 2718, "json_schemas": 2719, "deepcopy": 2720, "properties": 2721, "__optional_field_": 2722, "uuid4": 2723, "schemas": 2724, "gen_prompt": 2725, "brief": 2726, "dumps": 2727, "get_schema": 2728, "grammar": 2729, "select_statement": 2730, "condition": 2731, "col_1": 2732, "col_2": 2733, "table_1": 2734, "table_2": 2735, "sql": 2736, "query": 2737, "username": 2738, "regex": 2739, "alan": 2740, "turing": 2741, "works": 2742, "enigma": 2743, "choice": 2744, "classify": 2745, "sentiment": 2746, "wonderful": 2747, "datas": 2748, "et": 2749, "xgrammar_bench": 2750, "nousresearch": 2751, "eval": 2752, "full_dataset_len": 2753, "_filter_func": 2754, "num_filtered_out": 2755, "len_dataset": 2756, "data_point_idx": 2757, "idx": 2758, "mill": 