{"contributing": 0, "vllm": 1, "you": 2, "may": 3, "find": 4, "information": 5, "about": 6, "docs": 7, "ai": 8, "https": 9, "en": 10, "latest": 11, "markdownlint": 12, "disable": 13, "md001": 14, "md041": 15, "align": 16, "center": 17, "picture": 18, "source": 19, "media": 20, "prefers": 21, "color": 22, "scheme": 23, "dark": 24, "srcset": 25, "raw": 26, "githubusercontent": 27, "com": 28, "project": 29, "main": 30, "assets": 31, "logos": 32, "logo": 33, "text": 34, "png": 35, "img": 36, "alt": 37, "src": 38, "light": 39, "width": 40, "55": 41, "h3": 42, "easy": 43, "fast": 44, "cheap": 45, "llm": 46, "serving": 47, "everyone": 48, "href": 49, "documentation": 50, "blog": 51, "arxiv": 52, "org": 53, "abs": 54, "2309": 55, "06180": 56, "paper": 57, "vllm_project": 58, "twitter": 59, "discuss": 60, "user": 61, "forum": 62, "slack": 63, "developer": 64, "news": 65, "2025": 66, "08": 67, "we": 68, "hosted": 69, "beijing": 70, "meetup": 71, "mp": 72, "weixin": 73, "qq": 74, "dgkwg1wfpwgo2jcdtqqhxa": 75, "focusing": 76, "large": 77, "scale": 78, "deployment": 79, "please": 80, "slides": 81, "here": 82, "drive": 83, "google": 84, "folders": 85, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 86, "recording": 87, "www": 88, "chaspark": 89, "live": 90, "1166916873711665152": 91, "05": 92, "nyc": 93, "lu": 94, "ma": 95, "c1rqyf1f": 96, "presentation": 97, "1_q_aw_iomjwuimf1s1ym": 98, "zhjxz8cuel0ijvaquoybea": 99, "edit": 100, "usp": 101, "sharing": 102, "now": 103, "under": 104, "pytorch": 105, "foundation": 106, "announcement": 107, "welcomes": 108, "01": 109, "excited": 110, "announce": 111, "alpha": 112, "release": 113, "v1": 114, "major": 115, "architectural": 116, "upgrade": 117, "7x": 118, "speedup": 119, "clean": 120, "code": 121, "optimized": 122, "execution": 123, "loop": 124, "zero": 125, "overhead": 126, "prefix": 127, "caching": 128, "enhanced": 129, "multimodal": 130, "support": 131, "more": 132, "check": 133, "out": 134, "our": 135, "post": 136, "27": 137, "html": 138, "details": 139, "summary": 140, "previous": 141, "04": 142, "asia": 143, "day": 144, "sginnovate": 145, "event": 146, "limited": 147, "availability": 148, "morning": 149, "evening": 150, "slots": 151, "remaining": 152, "inaugural": 153, "from": 154, "team": 155, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 156, "03": 157, "ollama": 158, "inference": 159, "night": 160, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 161, "first": 162, "china": 163, "n77gibl2coratqhtveazfg": 164, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 165, "east": 166, "coast": 167, "7mu4k4xx": 168, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 169, "slide": 170, "id": 171, "g31441846c39_0_0": 172, "02": 173, "ninth": 174, "h7g3kuj9": 175, "meta": 176, "1jzc_pzvxrvnsfvcw": 177, "v4cfxb6pn7zz2cyp_flwo05aqg": 178, "amd": 179, "file": 180, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 181, "view": 182, "posted": 183, "eighth": 184, "zep56hui": 185, "cloud": 186, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 187, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 188, "2024": 189, "12": 190, "joins": 191, "ecosystem": 192, "11": 193, "seventh": 194, "h0qvrajz": 195, "snowflake": 196, "1e3cxqbv3jsfgp30swyvs3em_tw": 197, "ghohj9pajgk6kr54": 198, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 199, "10": 200, "have": 201, "just": 202, "created": 203, "coordinating": 204, "contributions": 205, "discussing": 206, "features": 207, "feel": 208, "free": 209, "join": 210, "us": 211, "ray": 212, "summit": 213, "held": 214, "special": 215, "track": 216, "opening": 217, "talk": 218, "1b_kqxphbtra_mdf": 219, "tr6i8rwdou5qotznceg2mkzxehm": 220, "learn": 221, "talks": 222, "youtube": 223, "playlist": 224, "list": 225, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 226, "other": 227, "contributors": 228, "users": 229, "09": 230, "sixth": 231, "87q3nvnh": 232, "nvidia": 233, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 234, "9wqyp7ny93xrs": 235, "07": 236, "fifth": 237, "lp0gyjqr": 238, "aws": 239, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 240, "partnership": 241, "officially": 242, "supports": 243, "llama": 244, "fp8": 245, "quantization": 246, "pipeline": 247, "parallelism": 248, "23": 249, "llama31": 250, "06": 251, "fourth": 252, "agivllm": 253, "cloudflare": 254, "bentoml": 255, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 256, "third": 257, "robloxandvllmmeetup2024": 258, "splashthat": 259, "roblox": 260, "1a": 261, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 262, "second": 263, "ygxbpzhl": 264, "ibm": 265, "12mi2skabnuw5rbwxdyy": 266, "hthth4imsnceoq10jdqbxga": 267, "2023": 268, "a16z": 269, "1ql": 270, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 271, "would": 272, "like": 273, "express": 274, "sincere": 275, "gratitude": 276, "andreessen": 277, "horowitz": 278, "30": 279, "supporting": 280, "open": 281, "community": 282, "providing": 283, "generous": 284, "grant": 285, "development": 286, "research": 287, "released": 288, "fastchat": 289, "integration": 290, "has": 291, "powered": 292, "lmsys": 293, "vicuna": 294, "chatbot": 295, "arena": 296, "chat": 297, "since": 298, "mid": 299, "april": 300, "use": 301, "library": 302, "originally": 303, "developed": 304, "sky": 305, "computing": 306, "lab": 307, "cs": 308, "berkeley": 309, "edu": 310, "uc": 311, "evolved": 312, "driven": 313, "both": 314, "academia": 315, "industry": 316, "state": 317, "art": 318, "throughput": 319, "efficient": 320, "management": 321, "attention": 322, "key": 323, "value": 324, "memory": 325, "pagedattention": 326, "20": 327, "continuous": 328, "batching": 329, "incoming": 330, "requests": 331, "model": 332, "cuda": 333, "hip": 334, "graph": 335, "quantizations": 336, "gptq": 337, "2210": 338, "17323": 339, "awq": 340, "2306": 341, "00978": 342, "autoround": 343, "05516": 344, "int4": 345, "int8": 346, "kernels": 347, "including": 348, "flashattention": 349, "flashinfer": 350, "speculative": 351, "decoding": 352, "chunked": 353, "prefill": 354, "flexible": 355, "seamless": 356, "popular": 357, "hugging": 358, "face": 359, "models": 360, "high": 361, "various": 362, "algorithms": 363, "parallel": 364, "sampling": 365, "beam": 366, "search": 367, "tensor": 368, "data": 369, "expert": 370, "distributed": 371, "streaming": 372, "outputs": 373, "openai": 374, "compatible": 375, "api": 376, "server": 377, "gpus": 378, "cpus": 379, "intel": 380, "powerpc": 381, "tpu": 382, "neuron": 383, "multi": 384, "lora": 385, "seamlessly": 386, "most": 387, "huggingface": 388, "transformer": 389, "llms": 390, "mixture": 391, "mixtral": 392, "deepseek": 393, "v2": 394, "v3": 395, "embedding": 396, "e5": 397, "mistral": 398, "modal": 399, "llava": 400, "full": 401, "supported": 402, "supported_models": 403, "getting": 404, "started": 405, "install": 406, "pip": 407, "getting_started": 408, "installation": 409, "gpu": 410, "index": 411, "build": 412, "wheel": 413, "bash": 414, "visit": 415, "quickstart": 416, "welcome": 417, "any": 418, "collaborations": 419, "how": 420, "get": 421, "involved": 422, "sponsors": 423, "compute": 424, "resources": 425, "testing": 426, "following": 427, "organizations": 428, "thank": 429, "your": 430, "note": 431, "sort": 432, "them": 433, "alphabetical": 434, "order": 435, "keep": 436, "consistent": 437, "md": 438, "cash": 439, "donations": 440, "dropbox": 441, "sequoia": 442, "capital": 443, "skywork": 444, "zhenfund": 445, "import": 446, "ctypes": 447, "importlib": 448, "util": 449, "json": 450, "logging": 451, "os": 452, "re": 453, "shutil": 454, "subprocess": 455, "sys": 456, "pathlib": 457, "path": 458, "which": 459, "torch": 460, "packaging": 461, "version": 462, "parse": 463, "setuptools": 464, "extension": 465, "setup": 466, "command": 467, "build_ext": 468, "setuptools_scm": 469, "get_version": 470, "utils": 471, "cpp_extension": 472, "cuda_home": 473, "rocm_home": 474, "def": 475, "load_module_from_path": 476, "module_name": 477, "spec": 478, "spec_from_file_location": 479, "module": 480, "module_from_spec": 481, "modules": 482, "loader": 483, "exec_module": 484, "return": 485, "root_dir": 486, "__file__": 487, "parent": 488, "logger": 489, "getlogger": 490, "__name__": 491, "envs": 492, "py": 493, "vllm_target_device": 494, "main_cuda_version": 495, "is_sccache_available": 496, "bool": 497, "sccache": 498, "none": 499, "int": 500, "getenv": 501, "vllm_disable_sccache": 502, "is_ccache_available": 503, "ccache": 504, "is_ninja_available": 505, "ninja": 506, "is_url_available": 507, "url": 508, "str": 509, "urllib": 510, "request": 511, "urlopen": 512, "status": 513, "try": 514, "except": 515, "exception": 516, "false": 517, "200": 518, "class": 519, "cmakeextension": 520, "__init__": 521, "self": 522, "name": 523, "cmake_lists_dir": 524, "kwa": 525, "super": 526, "sources": 527, "py_limited_api": 528, "true": 529, "abspath": 530, "cmake_build_ext": 531, "dict": 532, "directories": 533, "been": 534, "configured": 535, "did_config": 536, "determine": 537, "number": 538, "compilation": 539, "jobs": 540, "optionally": 541, "nvcc": 542, "compile": 543, "threads": 544, "compute_num_jobs": 545, "num_jobs": 546, "either": 547, "max_jobs": 548, "environment": 549, "variable": 550, "defined": 551, "available": 552, "info": 553, "using": 554, "else": 555, "sched_getaffinity": 556, "isn": 557, "universally": 558, "so": 559, "fall": 560, "back": 561, "cpu_count": 562, "error": 563, "len": 564, "attributeerror": 565, "nvcc_threads": 566, "_is_cuda": 567, "get_nvcc_cuda_version": 568, "when": 569, "set": 570, "reduce": 571, "avoid": 572, "overloading": 573, "system": 574, "max": 575, "perform": 576, "cmake": 577, "configuration": 578, "single": 579, "configure": 580, "ext": 581, "ve": 582, "already": 583, "cmakelists": 584, "txt": 585, "exit": 586, "early": 587, "select": 588, "type": 589, "optimization": 590, "level": 591, "debug": 592, "default_cfg": 593, "relwithdebinfo": 594, "cfg": 595, "cmake_build_type": 596, "cmake_args": 597, "dcmake_build_type": 598, "format": 599, "dvllm_target_device": 600, "verbose": 601, "dcmake_verbose_makefile": 602, "dcmake_c_compiler_launcher": 603, "dcmake_cxx_compiler_launcher": 604, "dcmake_cuda_compiler_launcher": 605, "dcmake_hip_compiler_launcher": 606, "elif": 607, "pass": 608, "python": 609, "executable": 610, "can": 611, "exact": 612, "match": 613, "dvllm_python_executable": 614, "reuse": 615, "dependencies": 616, "subsequent": 617, "calls": 618, "dvllm_python_path": 619, "override": 620, "base": 621, "directory": 622, "fetchcontent": 623, "downloads": 624, "root": 625, "deps": 626, "allows": 627, "between": 628, "profiles": 629, "plays": 630, "nicely": 631, "fetchcontent_base_dir": 632, "fc_base_dir": 633, "environ": 634, "dfetchcontent_base_dir": 635, "tool": 636, "num_job": 637, "dnvcc_threads": 638, "build_tool": 639, "dcmake_job_pool_compile": 640, "string": 641, "dcmake_job_pools": 642, "default": 643, "whatever": 644, "picks": 645, "make": 646, "sure": 647, "dcmake_cuda_compiler": 648, "bin": 649, "check_call": 650, "cwd": 651, "build_temp": 652, "build_extensions": 653, "ensure": 654, "present": 655, "working": 656, "check_output": 657, "oserror": 658, "raise": 659, "runtimeerror": 660, "cannot": 661, "create": 662, "does": 663, "exist": 664, "exists": 665, "makedirs": 666, "targets": 667, "target_name": 668, "removeprefix": 669, "vllm_flash_attn": 670, "all": 671, "extensions": 672, "append": 673, "build_args": 674, "target": 675, "libraries": 676, "proper": 677, "location": 678, "outdir": 679, "get_ext_fullpath": 680, "absolute": 681, "skip": 682, "directo": 683, "ry": 684, "same": 685, "continue": 686, "appends": 687, "contains": 688, "need": 689, "remove": 690, "range": 691, "count": 692, "should": 693, "actually": 694, "components": 695, "install_args": 696, "component": 697, "run": 698, "standard": 699, "copy": 700, "build_lib": 701, "current": 702, "included": 703, "editable": 704, "glob": 705, "files": 706, "recursive": 707, "dst_file": 708, "split": 709, "print": 710, "copying": 711, "dirname": 712, "exist_ok": 713, "copy_file": 714, "precompiled_build_ext": 715, "disables": 716, "building": 717, "precompiled": 718, "binaries": 719, "assert": 720, "vllm_use_precompiled": 721, "only": 722, "builds": 723, "skipping": 724, "precompiled_wheel_utils": 725, "extracts": 726, "existing": 727, "staticmethod": 728, "extract_precompiled_and_patch_package": 729, "wheel_url_or_path": 730, "tempfile": 731, "zipfile": 732, "temp_dir": 733, "isfile": 734, "wheel_filename": 735, "mkdtemp": 736, "wheels": 737, "wheel_path": 738, "downloading": 739, "urlretrieve": 740, "filename": 741, "package_data_patch": 742, "files_to_copy": 743, "_c": 744, "abi3": 745, "_moe_c": 746, "_flashmla_c": 747, "_vllm_fa2_c": 748, "_vllm_fa3_c": 749, "cumem_allocator": 750, "compiled_regex": 751, "file_members": 752, "filter": 753, "lambda": 754, "filelist": 755, "extract": 756, "target_path": 757, "target_pa": 758, "th": 759, "wb": 760, "dst": 761, "copyfileobj": 762, "pkg": 763, "replace": 764, "setdefault": 765, "basename": 766, "finally": 767, "removing": 768, "temporary": 769, "rmtree": 770, "get_base_commit_in_main_branch": 771, "force": 772, "nightly": 773, "mainly": 774, "used": 775, "ci": 776, "vllm_test_use_precompiled_nightly_wheel": 777, "commit": 778, "hash": 779, "upstream": 780, "branch": 781, "resp_json": 782, "curl": 783, "github": 784, "repos": 785, "commits": 786, "decode": 787, "utf": 788, "upstream_main_commit": 789, "loads": 790, "sha": 791, "docker": 792, "context": 793, "git": 794, "immutable": 795, "missing": 796, "vllm_docker_build_context": 797, "local": 798, "repo": 799, "cat": 800, "calledprocesserror": 801, "fetch": 802, "remote": 803, "repository": 804, "update": 805, "branches": 806, "ensures": 807, "ref": 808, "its": 809, "history": 810, "current_branch": 811, "show": 812, "strip": 813, "base_commit": 814, "merge": 815, "valueerror": 816, "err": 817, "warning": 818, "failed": 819, "dev": 820, "_no_device": 821, "empty": 822, "has_cuda": 823, "_is_neuron": 824, "_is_tpu": 825, "_is_hip": 826, "rocm": 827, "_is_cpu": 828, "cpu": 829, "_is_xpu": 830, "xpu": 831, "_build_custom_ops": 832, "get_rocm_version": 833, "librocm": 834, "core": 835, "see": 836, "blob": 837, "d11f5c20d500f729c393680a01fa902ebf92094b": 838, "rocm_version": 839, "cpp": 840, "l21": 841, "librocm_core_file": 842, "lib": 843, "is_file": 844, "librocm_core": 845, "cdll": 846, "vererrors": 847, "c_uint32": 848, "get_rocm_core_version": 849, "getrocmversion": 850, "restype": 851, "argtypes": 852, "pointer": 853, "minor": 854, "patch": 855, "byref": 856, "get_neuronxcc_version": 857, "sysconfig": 858, "site_dir": 859, "get_paths": 860, "purelib": 861, "version_file": 862, "neuronxcc": 863, "executed": 864, "successfully": 865, "fp": 866, "content": 867, "read": 868, "regular": 869, "expression": 870, "__version__": 871, "group": 872, "could": 873, "output": 874, "adapted": 875, "apex": 876, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 877, "nvcc_output": 878, "universal_newlines": 879, "release_idx": 880, "nvcc_cuda_version": 881, "get_gaudi_sw_version": 882, "returns": 883, "driver": 884, "enable": 885, "console": 886, "printing": 887, "hl": 888, "smi": 889, "shell": 890, "capture_output": 891, "env": 892, "enable_console": 893, "returncode": 894, "stdout": 895, "get_vllm_version": 896, "write_to": 897, "_version": 898, "sep": 899, "versions": 900, "might": 901, "contain": 902, "cuda_version": 903, "cuda_version_str": 904, "tarball": 905, "required": 906, "pypi": 907, "sdist": 908, "argv": 909, "cu": 910, "neuron_version": 911, "neuron_version_str": 912, "unknown": 913, "runtime": 914, "get_requirements": 915, "package": 916, "requirements": 917, "requirements_dir": 918, "_read_requirements": 919, "resolved_requirements": 920, "line": 921, "startswith": 922, "common": 923, "cuda_major": 924, "cuda_minor": 925, "modified_requirements": 926, "req": 927, "flash": 928, "attn": 929, "built": 930, "unsupported": 931, "platform": 932, "ext_modules": 933, "package_data": 934, "typed": 935, "model_executor": 936, "layers": 937, "fused_moe": 938, "configs": 939, "spdx": 940, "license": 941, "identifier": 942, "apache": 943, "filecopyrighttext": 944, "copyright": 945, "requires_files": 946, "pyproject": 947, "toml": 948, "cleaning": 949, "lines": 950, "readlines": 951, "lower": 952, "removed": 953, "write": 954, "done": 955, "releasing": 956, "releases": 957, "offer": 958, "reliable": 959, "packaged": 960, "binary": 961, "conveniently": 962, "accessed": 963, "via": 964, "also": 965, "serve": 966, "milestones": 967, "communicate": 968, "newly": 969, "improvements": 970, "upcoming": 971, "changes": 972, "affect": 973, "potential": 974, "breaking": 975, "versioning": 976, "uses": 977, "right": 978, "shifted": 979, "where": 980, "new": 981, "every": 982, "weeks": 983, "bug": 984, "fixes": 985, "opposed": 986, "semver": 987, "backwards": 988, "critical": 989, "made": 990, "post1": 991, "_major_": 992, "milestone": 993, "incompatible": 994, "similar": 995, "_minor_": 996, "_patch_": 997, "_post1_": 998, "_patch": 999, "1_": 1000, "explicit": 1001, "implicit": 1002, "cadence": 1003, "bi": 1004, "weekly": 1005, "basis": 1006, "days": 1007, "after": 1008, "year": 1009, "future": 1010, "dates": 1011, "below": 1012, "tentative": 1013, "optional": 1014, "date": 1015, "jan": 1016, "feb": 1017, "mar": 1018, "apr": 1019, "jun": 1020, "jul": 1021, "13": 1022, "aug": 1023, "14": 1024, "15": 1025, "16": 1026, "17": 1027, "oct": 1028, "18": 1029, "19": 1030, "nov": 1031, "21": 1032, "dec": 1033, "22": 1034, "each": 1035, "dedicated": 1036, "cut": 1037, "performed": 1038, "before": 1039, "previously": 1040, "reused": 1041, "triggered": 1042, "push": 1043, "rc": 1044, "tag": 1045, "vx": 1046, "rc1": 1047, "enables": 1048, "test": 1049, "multiple": 1050, "rcs": 1051, "final": 1052, "trigger": 1053, "notes": 1054, "monitor": 1055, "reverts": 1056, "apply": 1057, "cherry": 1058, "pick": 1059, "criteria": 1060, "approach": 1061, "finalizing": 1062, "clear": 1063, "what": 1064, "allowed": 1065, "process": 1066, "land": 1067, "pr": 1068, "typically": 1069, "sufficient": 1070, "time": 1071, "complete": 1072, "thorough": 1073, "round": 1074, "stable": 1075, "regression": 1076, "address": 1077, "functional": 1078, "performance": 1079, "against": 1080, "recent": 1081, "severe": 1082, "issue": 1083, "silent": 1084, "incorrectness": 1085, "compatibility": 1086, "crashes": 1087, "deadlocks": 1088, "leaks": 1089, "introduced": 1090, "specific": 1091, "change": 1092, "identifiers": 1093, "feature": 1094, "work": 1095, "prs": 1096, "considered": 1097, "merged": 1098, "trunk": 1099, "manual": 1100, "validations": 1101, "e2e": 1102, "validation": 1103, "end": 1104, "regressions": 1105, "benchmark": 1106, "workflow": 1107, "actions": 1108, "workflows": 1109, "yml": 1110, "coverage": 1111, "llama3": 1112, "llama4": 1113, "hardware": 1114, "h100": 1115, "mi300x": 1116, "_note": 1117, "based": 1118, "availability_": 1119, "conduct": 1120, "pledge": 1121, "members": 1122, "leaders": 1123, "participation": 1124, "harassment": 1125, "experience": 1126, "regardless": 1127, "age": 1128, "body": 1129, "size": 1130, "visible": 1131, "invisible": 1132, "disability": 1133, "ethnicity": 1134, "sex": 1135, "characteristics": 1136, "gender": 1137, "identity": 1138, "education": 1139, "socioeconomic": 1140, "nationality": 1141, "personal": 1142, "appearance": 1143, "race": 1144, "caste": 1145, "religion": 1146, "sexual": 1147, "orientation": 1148, "act": 1149, "interact": 1150, "ways": 1151, "contribute": 1152, "welcoming": 1153, "diverse": 1154, "inclusive": 1155, "healthy": 1156, "standards": 1157, "examples": 1158, "behavior": 1159, "contributes": 1160, "positive": 1161, "include": 1162, "demonstrating": 1163, "empathy": 1164, "kindness": 1165, "toward": 1166, "people": 1167, "being": 1168, "respectful": 1169, "differing": 1170, "opinions": 1171, "viewpoints": 1172, "experiences": 1173, "giving": 1174, "gracefully": 1175, "accepting": 1176, "constructive": 1177, "feedback": 1178, "responsibility": 1179, "apologizing": 1180, "those": 1181, "affected": 1182, "mistakes": 1183, "learning": 1184, "best": 1185, "individuals": 1186, "overall": 1187, "unacceptable": 1188, "sexualized": 1189, "language": 1190, "imagery": 1191, "advances": 1192, "kind": 1193, "trolling": 1194, "insulting": 1195, "derogatory": 1196, "comments": 1197, "political": 1198, "attacks": 1199, "public": 1200, "private": 1201, "publishing": 1202, "others": 1203, "physical": 1204, "email": 1205, "without": 1206, "permission": 1207, "reasonably": 1208, "inappropriate": 1209, "professional": 1210, "setting": 1211, "enforcement": 1212, "responsibilities": 1213, "responsible": 1214, "clarifying": 1215, "enforcing": 1216, "acceptable": 1217, "take": 1218, "appropriate": 1219, "fair": 1220, "corrective": 1221, "action": 1222, "response": 1223, "deem": 1224, "threatening": 1225, "offensive": 1226, "harmful": 1227, "reject": 1228, "wiki": 1229, "edits": 1230, "issues": 1231, "aligned": 1232, "reasons": 1233, "moderation": 1234, "decisions": 1235, "scope": 1236, "applies": 1237, "within": 1238, "spaces": 1239, "individual": 1240, "representing": 1241, "official": 1242, "posting": 1243, "social": 1244, "account": 1245, "acting": 1246, "appointed": 1247, "representative": 1248, "online": 1249, "offline": 1250, "irl": 1251, "instances": 1252, "abusive": 1253, "harassing": 1254, "otherwise": 1255, "reported": 1256, "channel": 1257, "complaints": 1258, "reviewed": 1259, "investigated": 1260, "promptly": 1261, "fairly": 1262, "obligated": 1263, "respect": 1264, "privacy": 1265, "security": 1266, "reporter": 1267, "incident": 1268, "guidelines": 1269, "follow": 1270, "impact": 1271, "determining": 1272, "consequences": 1273, "violation": 1274, "correction": 1275, "deemed": 1276, "unprofessional": 1277, "unwelcome": 1278, "consequence": 1279, "written": 1280, "clarity": 1281, "around": 1282, "nature": 1283, "explanation": 1284, "why": 1285, "apology": 1286, "requested": 1287, "through": 1288, "series": 1289, "continued": 1290, "interaction": 1291, "unsolicited": 1292, "specified": 1293, "period": 1294, "includes": 1295, "avoiding": 1296, "interactions": 1297, "well": 1298, "external": 1299, "channels": 1300, "violating": 1301, "terms": 1302, "lead": 1303, "permanent": 1304, "ban": 1305, "traceback": 1306, "typing": 1307, "callable": 1308, "unittest": 1309, "mock": 1310, "find_cuda_init": 1311, "fn": 1312, "object": 1313, "helper": 1314, "function": 1315, "initialization": 1316, "errors": 1317, "initializes": 1318, "prints": 1319, "stack": 1320, "trace": 1321, "happens": 1322, "_lazy_init": 1323, "wrapper": 1324, "nonlocal": 1325, "extract_stack": 1326, "initialized": 1327, "format_list": 1328, "__main__": 1329, "import_module": 1330, "policy": 1331, "reporting": 1332, "report": 1333, "privately": 1334, "vulnerability": 1335, "submission": 1336, "form": 1337, "advisories": 1338, "triage": 1339, "reports": 1340, "triaged": 1341, "vulnerability_management": 1342, "threat": 1343, "guide": 1344, "usage": 1345, "assumptions": 1346, "recommendations": 1347, "securely": 1348, "severity": 1349, "risk": 1350, "taking": 1351, "dealing": 1352, "past": 1353, "defaults": 1354, "cases": 1355, "categories": 1356, "vulnerabilities": 1357, "allow": 1358, "attackers": 1359, "execute": 1360, "arbitrary": 1361, "control": 1362, "significantly": 1363, "compromise": 1364, "confidentiality": 1365, "integrity": 1366, "privileges": 1367, "needed": 1368, "network": 1369, "deserialization": 1370, "exploit": 1371, "chains": 1372, "generally": 1373, "rated": 1374, "cvss": 1375, "serious": 1376, "flaws": 1377, "elevated": 1378, "rce": 1379, "contexts": 1380, "significant": 1381, "loss": 1382, "require": 1383, "advanced": 1384, "conditions": 1385, "some": 1386, "trust": 1387, "modes": 1388, "node": 1389, "privileged": 1390, "access": 1391, "scores": 1392, "moderate": 1393, "cause": 1394, "denial": 1395, "service": 1396, "partial": 1397, "disruption": 1398, "do": 1399, "breach": 1400, "rating": 1401, "low": 1402, "argparse": 1403, "hipify": 1404, "hipify_python": 1405, "vllm_max_size_mb": 1406, "defaulting": 1407, "400": 1408, "mib": 1409, "quota": 1410, "wisely": 1411, "3792": 1412, "sync": 1413, "one": 1414, "dockerfile": 1415, "print_top_10_largest_files": 1416, "zip_file": 1417, "top": 1418, "largest": 1419, "given": 1420, "zip": 1421, "file_sizes": 1422, "getinfo": 1423, "file_size": 1424, "namelist": 1425, "reverse": 1426, "1024": 1427, "2f": 1428, "mbs": 1429, "uncompressed": 1430, "check_wheel_size": 1431, "whl": 1432, "walk": 1433, "file_name": 1434, "endswith": 1435, "wheel_size_mb": 1436, "getsize": 1437, "larger": 1438, "mb": 1439, "than": 1440, "limit": 1441, "template": 1442, "doctype": 1443, "h1": 1444, "links": 1445, "wheel_html_escaped": 1446, "br": 1447, "parser": 1448, "argumentparser": 1449, "add_argument": 1450, "help": 1451, "args": 1452, "parse_args": 1453, "generated": 1454, "cloudfront": 1455, "requires": 1456, "escaping": 1457, "character": 1458, "2b": 1459, "suite": 1460, "introduction": 1461, "two": 1462, "sets": 1463, "workload": 1464, "developers": 1465, "gain": 1466, "whether": 1467, "improves": 1468, "degrades": 1469, "compare": 1470, "alternatives": 1471, "tgi": 1472, "trt": 1473, "lmdeploy": 1474, "know": 1475, "choose": 1476, "dashboard": 1477, "hud": 1478, "reponame": 1479, "2fvllm": 1480, "results": 1481, "readme": 1482, "quick": 1483, "overview": 1484, "benchmarking": 1485, "latency": 1486, "fix": 1487, "qps": 1488, "a100": 1489, "coming": 1490, "xeon": 1491, "processors": 1492, "different": 1493, "duration": 1494, "1hr": 1495, "constraint": 1496, "hr": 1497, "won": 1498, "forever": 1499, "8b": 1500, "70b": 1501, "8x7b": 1502, "engines": 1503, "5hrs": 1504, "perf": 1505, "benchmarks": 1506, "label": 1507, "ready": 1508, "manually": 1509, "buildkite": 1510, "scripts": 1511, "sh": 1512, "variables": 1513, "on_cpu": 1514, "serving_json": 1515, "tests": 1516, "latency_json": 1517, "throughput_json": 1518, "throughout": 1519, "remote_host": 1520, "ip": 1521, "remote_port": 1522, "port": 1523, "descriptions": 1524, "detailed": 1525, "instead": 1526, "example": 1527, "inside": 1528, "test_name": 1529, "latency_llama8b_tp1": 1530, "parameters": 1531, "tensor_parallel_size": 1532, "load_format": 1533, "dummy": 1534, "num_iters_warmup": 1535, "num_iters": 1536, "attributes": 1537, "unique": 1538, "must": 1539, "start": 1540, "latency_": 1541, "attribute": 1542, "arguments": 1543, "bench": 1544, "underline": 1545, "dash": 1546, "specifying": 1547, "convert": 1548, "feeding": 1549, "corresponding": 1550, "load": 1551, "num": 1552, "iters": 1553, "warmup": 1554, "numbers": 1555, "highly": 1556, "sensitive": 1557, "correctly": 1558, "script": 1559, "save": 1560, "itself": 1561, "parameter": 1562, "syntax": 1563, "fed": 1564, "forward": 1565, "slight": 1566, "vary": 1567, "lot": 1568, "rate": 1569, "inf": 1570, "cover": 1571, "serving_llama8b_tp1_sharegpt": 1572, "qps_list": 1573, "server_parameters": 1574, "swap_space": 1575, "disable_log_stats": 1576, "client_parameters": 1577, "backend": 1578, "dataset_name": 1579, "sharegpt": 1580, "dataset_path": 1581, "sharegpt_v3_unfiltered_cleaned_split": 1582, "num_prompts": 1583, "serving_": 1584, "client": 1585, "controls": 1586, "less": 1587, "compared": 1588, "delay": 1589, "due": 1590, "randomized": 1591, "dataset": 1592, "benchmark_serving": 1593, "still": 1594, "greatly": 1595, "saving": 1596, "related": 1597, "visualizing": 1598, "markdown": 1599, "helps": 1600, "put": 1601, "table": 1602, "formatting": 1603, "real": 1604, "result": 1605, "presented": 1606, "job": 1607, "page": 1608, "wait": 1609, "till": 1610, "finish": 1611, "running": 1612, "together": 1613, "attached": 1614, "artifacts": 1615, "tab": 1616, "converted": 1617, "generates": 1618, "folder": 1619, "along": 1620, "benchmark_results": 1621, "compares": 1622, "provides": 1623, "ratio": 1624, "tput": 1625, "median": 1626, "ttft": 1627, "tpot": 1628, "passed": 1629, "tp": 1630, "pp": 1631, "configurations": 1632, "result_a": 1633, "result_b": 1634, "input": 1635, "lenght": 1636, "concurrency": 1637, "python3": 1638, "results_a": 1639, "results_b": 1640, "perf_ratio": 1641, "instruct": 1642, "random": 1643, "128": 1644, "1000": 1645, "142": 1646, "633982": 1647, "156": 1648, "526018": 1649, "097396": 1650, "241": 1651, "620334": 1652, "294": 1653, "018783": 1654, "216863": 1655, "comparison": 1656, "diagram": 1657, "96c": 1658, "results_gnr_96c_091_tp2pp3": 1659, "128c": 1660, "results_gnr_128c_091_tp2pp3": 1661, "1886": 1662, "height": 1663, "828": 1664, "image": 1665, "attachments": 1666, "c02a43ef": 1667, "25d0": 1668, "4fd6": 1669, "90e5": 1670, "2169a28682dd": 1671, "description": 1672, "containers": 1673, "yaml": 1674, "specifies": 1675, "container": 1676, "probe": 1677, "engine": 1678, "annotation": 1679, "link": 1680, "artifact": 1681, "download": 1682, "visualization": 1683, "reproduction": 1684, "deploy": 1685, "export": 1686, "hf_token": 1687, "hf": 1688, "token": 1689, "apt": 1690, "unzip": 1691, "vllm_source_code_loc": 1692, "aims": 1693, "provide": 1694, "tensorrt": 1695, "sglang": 1696, "leads": 1697, "reproducible": 1698, "commands": 1699, "reproducing": 1700, "instructions": 1701, "scroll": 1702, "guilde": 1703, "8176": 1704, "images": 1705, "v0": 1706, "lmsysorg": 1707, "cu121": 1708, "openmmlab": 1709, "cu12": 1710, "nvcr": 1711, "io": 1712, "tritonserver": 1713, "24": 1714, "trtllm": 1715, "py3": 1716, "r24": 1717, "implementation": 1718, "works": 1719, "going": 1720, "bump": 1721, "up": 1722, "concrete": 1723, "specs": 1724, "8x": 1725, "heavy": 1726, "average": 1727, "462": 1728, "tokens": 1729, "256": 1730, "datasets": 1731, "2105": 1732, "query": 1733, "per": 1734, "32": 1735, "queries": 1736, "randomly": 1737, "sampled": 1738, "arrival": 1739, "patterns": 1740, "determined": 1741, "poisson": 1742, "fixed": 1743, "seed": 1744, "evaluation": 1745, "metrics": 1746, "higher": 1747, "better": 1748, "itl": 1749, "inter": 1750, "known": 1751, "length": 1752, "batch": 1753, "mean": 1754, "p99": 1755, "latency_tests_markdown_table": 1756, "sample": 1757, "prompts": 1758, "dynamically": 1759, "achieve": 1760, "maximum": 1761, "throughput_tests_markdown_table": 1762, "pattern": 1763, "means": 1764, "come": 1765, "once": 1766, "values": 1767, "added": 1768, "100": 1769, "serving_tests_markdown_table": 1770, "platform_markdown_table": 1771, "tables": 1772, "section": 1773, "above": 1774, "pandas": 1775, "dataframes": 1776, "follows": 1777, "pd": 1778, "benchmarking_results_json": 1779, "numpy": 1780, "np": 1781, "tabulate": 1782, "parse_arguments": 1783, "stored": 1784, "get_perf": 1785, "df": 1786, "method": 1787, "metric": 1788, "qps_": 1789, "filtered_df": 1790, "array": 1791, "get_perf_w_std": 1792, "ms": 1793, "tolist": 1794, "std": 1795, "success": 1796, "successful": 1797, "sqrt": 1798, "tok": 1799, "results_folder": 1800, "collect": 1801, "test_file": 1802, "_nightly_results": 1803, "generate": 1804, "dataframe": 1805, "from_dict": 1806, "md_table": 1807, "headers": 1808, "keys": 1809, "tablefmt": 1810, "pipe": 1811, "showindex": 1812, "nightly_results_benchmarking_table": 1813, "nightly_results": 1814, "transformers": 1815, "autotokenizer": 1816, "cachedir": 1817, "tokenizer": 1818, "from_pretrained": 1819, "save_pretrained": 1820, "saved": 1821, "api_client": 1822, "apiclient": 1823, "http": 1824, "localhost": 1825, "8000": 1826, "model_name": 1827, "available_models": 1828, "compare_data_columns": 1829, "name_column": 1830, "data_column": 1831, "info_cols": 1832, "drop_column": 1833, "ncompare_data_column": 1834, "frames": 1835, "raw_data_cols": 1836, "compare_frames": 1837, "data_df": 1838, "read_json": 1839, "serving_df": 1840, "dropna": 1841, "subset": 1842, "ignore_index": 1843, "columns": 1844, "couple": 1845, "col": 1846, "column": 1847, "mode": 1848, "rename": 1849, "_name": 1850, "among": 1851, "ratio_df": 1852, "pop": 1853, "concat_df": 1854, "concat": 1855, "axis": 1856, "split_json_by_tp_pp": 1857, "input_file": 1858, "output_root": 1859, "separate": 1860, "creates": 1861, "_pp": 1862, "paths": 1863, "encoding": 1864, "isinstance": 1865, "serving_results": 1866, "break": 1867, "handle": 1868, "alias": 1869, "names": 1870, "rename_map": 1871, "tp_size": 1872, "pp_size": 1873, "pipeline_parallel_size": 1874, "items": 1875, "inplace": 1876, "numeric": 1877, "ints": 1878, "nan": 1879, "to_numeric": 1880, "coerce": 1881, "fillna": 1882, "astype": 1883, "saved_paths": 1884, "group_df": 1885, "groupby": 1886, "folder_name": 1887, "filepath": 1888, "to_json": 1889, "orient": 1890, "records": 1891, "indent": 1892, "force_ascii": 1893, "datetime": 1894, "serving_column_mapping": 1895, "gpu_type": 1896, "completed": 1897, "request_throughput": 1898, "mean_ttft_ms": 1899, "std_ttft_ms": 1900, "median_ttft_ms": 1901, "mean_itl_ms": 1902, "std_itl_ms": 1903, "median_itl_ms": 1904, "mean_tpot_ms": 1905, "std_tpot_ms": 1906, "median_tpot_ms": 1907, "total_token_throughput": 1908, "total": 1909, "output_throughput": 1910, "total_input_tokens": 1911, "total_output_tokens": 1912, "shlex": 1913, "psutil": 1914, "regex": 1915, "latency_results": 1916, "latency_column_mapping": 1917, "avg_latency": 1918, "p10": 1919, "p25": 1920, "p50": 1921, "p75": 1922, "p90": 1923, "throughput_results": 1924, "throughput_results_column_mapping": 1925, "num_requests": 1926, "total_num_tokens": 1927, "elapsed_time": 1928, "elapsed": 1929, "requests_per_second": 1930, "tokens_per_second": 1931, "model_id": 1932, "input_len": 1933, "output_len": 1934, "dtype": 1935, "max_concurrency": 1936, "p99_ttft_ms": 1937, "p99_tpot_ms": 1938, "p99_itl_ms": 1939, "read_markdown": 1940, "found": 1941, "results_to_json": 1942, "dumps": 1943, "to_dict": 1944, "get_size_with_unit": 1945, "bytes": 1946, "suffix": 1947, "1253656": 1948, "20mb": 1949, "1253656678": 1950, "17gb": 1951, "factor": 1952, "unit": 1953, "_coerce": 1954, "val": 1955, "effort": 1956, "coercion": 1957, "types": 1958, "null": 1959, "integers": 1960, "fullmatch": 1961, "floats": 1962, "strings": 1963, "float": 1964, "parse_client_command": 1965, "cmd": 1966, "client_command": 1967, "toks": 1968, "while": 1969, "boolean": 1970, "flag": 1971, "metadata": 1972, "consume": 1973, "pairs": 1974, "until": 1975, "next": 1976, "pair": 1977, "lone": 1978, "unexpected": 1979, "positional": 1980, "executab": 1981, "le": 1982, "lm": 1983, "eval": 1984, "harness": 1985, "vs": 1986, "baseline": 1987, "computed": 1988, "pytest": 1989, "test_lm_eval_correctness": 1990, "config": 1991, "small": 1992, "lm_eval": 1993, "rtol": 1994, "launch_lm_eval": 1995, "eval_config": 1996, "trust_remote_code": 1997, "max_model_len": 1998, "4096": 1999, "model_args": 2000, "pretrained": 2001, "enforce_eager": 2002, "add_bos_token": 2003, "simple_evaluate": 2004, "tasks": 2005, "task": 2006, "num_fewshot": 2007, "batch_size": 2008, "auto": 2009, "test_lm_eval_correctness_param": 2010, "config_filename": 2011, "safe_load": 2012, "read_text": 2013, "ground_truth": 2014, "measured_value": 2015, "measured": 2016, "isclose": 2017, "pytest_addoption": 2018, "addoption": 2019, "store": 2020, "listing": 2021, "yamls": 2022, "fixture": 2023, "session": 2024, "config_list_file": 2025, "pytestconfig": 2026, "config_dir": 2027, "rel_path": 2028, "getoption": 2029, "pytest_generate_tests": 2030, "metafunc": 2031, "fixturenames": 2032, "resolve": 2033, "parametrize": 2034, "specialized": 2035, "reads": 2036, "splits": 2037, "nightly_torch_test": 2038, "torch_nightly_test": 2039, "packages": 2040, "output_file": 2041, "white": 2042, "directly": 2043, "add": 2044, "dependency": 2045, "fails": 2046, "white_list": 2047, "torchaudio": 2048, "torchvision": 2049, "mamba_ssm": 2050, "skip_next": 2051, "__future__": 2052, "annotations": 2053, "forbidden_patterns": 2054, "allowed_patterns": 2055, "get_staged_python_files": 2056, "diff": 2057, "cached": 2058, "am": 2059, "is_forbidden_import": 2060, "check_file": 2061, "tuple": 2062, "violations": 2063, "line_num": 2064, "enumerate": 2065, "unicodedecodeerror": 2066, "total_violations": 2067, "noqa": 2068, "e501": 2069, "imports": 2070, "ast": 2071, "collections": 2072, "abc": 2073, "iterable": 2074, "_is_internal": 2075, "_fail": 2076, "disallowed": 2077, "eager": 2078, "stderr": 2079, "lineno": 2080, "msg": 2081, "init_path": 2082, "tree": 2083, "visitor": 2084, "nodevisitor": 2085, "_in_type_checking": 2086, "visit_if": 2087, "guard_is_type_checking": 2088, "attr": 2089, "type_checking": 2090, "prev": 2091, "child": 2092, "orelse": 2093, "generic_visit": 2094, "visit_import": 2095, "allowed_imports": 2096, "visit_importfrom": 2097, "importfrom": 2098, "module_as_written": 2099, "allowed_from_modules": 2100, "multiprocessing": 2101, "get_python_executable": 2102, "get_cpu_cores": 2103, "cores": 2104, "generate_presets": 2105, "output_path": 2106, "cmakeuserpresets": 2107, "attempting": 2108, "detect": 2109, "nvcc_path": 2110, "prospective_path": 2111, "nvcc_path_input": 2112, "automatically": 2113, "usr": 2114, "python_executable": 2115, "python_executable_prompt": 2116, "virtual": 2117, "home": 2118, "venvs": 2119, "cpu_cores": 2120, "min": 2121, "cmake_jobs": 2122, "detected": 2123, "assuming": 2124, "tools": 2125, "project_root": 2126, "resolvable": 2127, "isabs": 2128, "cache_variables": 2129, "cmake_cuda_compiler": 2130, "vllm_python_executable": 2131, "cmake_install_prefix": 2132, "sourcedir": 2133, "cmake_cuda_flags": 2134, "compiler": 2135, "cache": 2136, "launcher": 2137, "cxx": 2138, "cmake_": 2139, "_compiler_launcher": 2140, "configure_preset": 2141, "binarydir": 2142, "cachevariables": 2143, "generator": 2144, "cmake_job_pools": 2145, "slower": 2146, "presets": 2147, "cmakeminimumrequired": 2148, "26": 2149, "configurepresets": 2150, "buildpresets": 2151, "configurepreset": 2152, "output_file_path": 2153, "overwrite": 2154, "generation": 2155, "cancelled": 2156, "dump": 2157, "nto": 2158, "preset": 2159, "cd": 2160, "initialize": 2161, "writing": 2162, "errno": 2163, "fnmatch": 2164, "defaultdict": 2165, "long_count": 2166, "long_ext_count": 2167, "represents": 2168, "ninja_log": 2169, "passing": 2170, "times": 2171, "seconds": 2172, "appended": 2173, "owner": 2174, "weighted_duration": 2175, "setweightedduration": 2176, "weightedduration": 2177, "weighted": 2178, "takes": 2179, "divides": 2180, "many": 2181, "were": 2182, "thus": 2183, "approximate": 2184, "serialized": 2185, "serializing": 2186, "steps": 2187, "ending": 2188, "much": 2189, "longer": 2190, "durations": 2191, "always": 2192, "shorter": 2193, "modest": 2194, "floating": 2195, "point": 2196, "epsilon": 2197, "000002": 2198, "describetargets": 2199, "printable": 2200, "summarizes": 2201, "dozens": 2202, "sanely": 2203, "max_length": 2204, "chosen": 2205, "fit": 2206, "long": 2207, "minimizing": 2208, "word": 2209, "wrapping": 2210, "65": 2211, "readtargets": 2212, "log": 2213, "show_all": 2214, "log_file": 2215, "sorted": 2216, "objects": 2217, "header": 2218, "readline": 2219, "v5": 2220, "unrecognized": 2221, "targets_dict": 2222, "last_end_seen": 2223, "parts": 2224, "exe": 2225, "rudely": 2226, "halted": 2227, "corrupt": 2228, "silently": 2229, "cmdhash": 2230, "ignore": 2231, "restart": 2232, "integral": 2233, "milliseconds": 2234, "earlier": 2235, "stamp": 2236, "step": 2237, "possibly": 2238, "incremental": 2239, "throw": 2240, "away": 2241, "displayed": 2242, "independently": 2243, "comparing": 2244, "because": 2245, "guaranteed": 2246, "several": 2247, "row": 2248, "go": 2249, "last": 2250, "however": 2251, "repeated": 2252, "changed": 2253, "stop": 2254, "points": 2255, "identified": 2256, "reset": 2257, "dictionary": 2258, "getextension": 2259, "extra_patterns": 2260, "important": 2261, "canonical": 2262, "ultimately": 2263, "goal": 2264, "fn_pattern": 2265, "good": 2266, "grouping": 2267, "type_mappings": 2268, "capture": 2269, "javac": 2270, "jar": 2271, "distinguished": 2272, "interface": 2273, "ext1": 2274, "splitext": 2275, "ext2": 2276, "preserve": 2277, "pdb": 2278, "dll": 2279, "pefile": 2280, "linking": 2281, "grouped": 2282, "don": 2283, "listed": 2284, "toc": 2285, "attempt": 2286, "identify": 2287, "identifying": 2288, "obj": 2289, "categorized": 2290, "mojo": 2291, "jars": 2292, "java": 2293, "normalize": 2294, "mojom": 2295, "summarizeentries": 2296, "entries": 2297, "extra_step_types": 2298, "beginning": 2299, "starting": 2300, "stopping": 2301, "exactly": 2302, "iterate": 2303, "keeping": 2304, "calculate": 2305, "ends": 2306, "own": 2307, "easily": 2308, "calculated": 2309, "task_start_stop_times": 2310, "earliest": 2311, "total_cpu_time": 2312, "weighted_total": 2313, "happen": 2314, "starts": 2315, "stops": 2316, "alphabet": 2317, "making": 2318, "currently": 2319, "running_tasks": 2320, "record": 2321, "processed": 2322, "deltas": 2323, "last_time": 2324, "accumulated": 2325, "efficiently": 2326, "last_weighted_time": 2327, "scan": 2328, "events": 2329, "action_name": 2330, "accumulate": 2331, "num_running": 2332, "running_": 2333, "moment": 2334, "ran": 2335, "del": 2336, "warn": 2337, "sum": 2338, "off": 2339, "half": 2340, "500": 2341, "possible": 2342, "untrustworthy": 2343, "3f": 2344, "entries_by_ext": 2345, "longest": 2346, "1f": 2347, "dest": 2348, "build_directory": 2349, "semicolon": 2350, "separated": 2351, "analyze": 2352, "_extra_args": 2353, "parse_known_args": 2354, "step_types": 2355, "room": 2356, "extra": 2357, "global": 2358, "enoent": 2359, "forbidden_import_re": 2360, "triton": 2361, "allowed_lines": 2362, "triton_utils": 2363, "tl": 2364, "allowed_files": 2365, "importing": 2366, "is_allowed_file": 2367, "current_file": 2368, "stripped": 2369, "parse_diff": 2370, "current_lineno": 2371, "skip_allowed_file": 2372, "splitlines": 2373, "code_line": 2374, "get_diff": 2375, "diff_type": 2376, "staged": 2377, "unified": 2378, "unstaged": 2379, "all_violations": 2380, "diff_output": 2381, "extend": 2382, "forbidden": 2383, "direct": 2384, "pickle": 2385, "serial_utils": 2386, "executor": 2387, "multiproc_executor": 2388, "hasher": 2389, "transformers_utils": 2390, "registry": 2391, "utils_": 2392, "test_utils": 2393, "tokenization": 2394, "test_cached_tokenizer": 2395, "parallel_state": 2396, "device_communicators": 2397, "custom_all_reduce_utils": 2398, "shm_broadcast": 2399, "graph_machete_bench": 2400, "benchmark_lora": 2401, "benchmark_machete": 2402, "fused_kernels": 2403, "layernorm_rms_benchmarks": 2404, "cutlass_benchmarks": 2405, "w8a8_benchmarks": 2406, "sparse_benchmarks": 2407, "cloudpickle": 2408, "worker": 2409, "worker_base": 2410, "mp_distributed_executor": 2411, "ray_distributed_executor": 2412, "entrypoints": 2413, "pickle_re": 2414, "sas": 2415, "is_python_file": 2416, "scan_file": 2417, "load_gitignore": 2418, "repo_root": 2419, "gitignore_path": 2420, "gitignore": 2421, "pathspec": 2422, "from_lines": 2423, "gitwildmatch": 2424, "bad_files": 2425, "dirpath": 2426, "filenames": 2427, "abs_path": 2428, "relpath": 2429, "ignored": 2430, "match_file": 2431, "nerror": 2432, "nif": 2433, "intentional": 2434, "check_pickle_imports": 2435, "test_regex": 2436, "test_cases": 2437, "pkl": 2438, "cpkl": 2439, "timport": 2440, "somethingelse": 2441, "pickleas": 2442, "asdf": 2443, "should_match": 2444, "case": 2445, "expected": 2446, "got": 2447, "enum": 2448, "spdxstatus": 2449, "enumeration": 2450, "missing_license": 2451, "missing_copyright": 2452, "missing_both": 2453, "full_spdx_header": 2454, "license_line": 2455, "copyright_line": 2456, "check_spdx_header_status": 2457, "file_path": 2458, "shebang": 2459, "start_idx": 2460, "has_license": 2461, "has_copyright": 2462, "completely": 2463, "add_header": 2464, "supplement": 2465, "seek": 2466, "truncate": 2467, "writelines": 2468, "insert": 2469, "files_missing_both": 2470, "files_missing_copyright": 2471, "files_missing_license": 2472, "fixing": 2473, "all_files_to_fix": 2474, "inspect": 2475, "get_attr_docs": 2476, "cls_node": 2477, "classdef": 2478, "docstrings": 2479, "placed": 2480, "assignments": 2481, "davidism": 2482, "mit": 2483, "pairwise": 2484, "implement": 2485, "itertools": 2486, "dropped": 2487, "iterator": 2488, "iter": 2489, "yield": 2490, "consider": 2491, "nodes": 2492, "assignment": 2493, "constant": 2494, "assign": 2495, "annassign": 2496, "expr": 2497, "doc": 2498, "cleandoc": 2499, "annotated": 2500, "assigning": 2501, "plain": 2502, "configvalidator": 2503, "visit_classdef": 2504, "validate": 2505, "dataclass": 2506, "decorators": 2507, "decorator_list": 2508, "call": 2509, "func": 2510, "validate_class": 2511, "fail": 2512, "decorator": 2513, "class_node": 2514, "attr_docs": 2515, "stmt": 2516, "field": 2517, "classvar": 2518, "dataclasses": 2519, "subscript": 2520, "field_name": 2521, "docstring": 2522, "union": 2523, "slice": 2524, "elts": 2525, "literal_args": 2526, "arg": 2527, "literal": 2528, "literal1": 2529, "literal2": 2530, "validate_ast": 2531, "validate_file": 2532, "validating": 2533, "systemexit": 2534, "message": 2535, "cluster": 2536, "described": 2537, "technical": 2538, "2412": 2539, "19437": 2540, "way": 2541, "sparse": 2542, "moe": 2543, "experts": 2544, "beyond": 2545, "normal": 2546, "impossible": 2547, "bundle": 2548, "down": 2549, "pplx": 2550, "ppl": 2551, "deepep": 2552, "necessary": 2553, "nvshmem": 2554, "ibgda": 2555, "host": 2556, "machine": 2557, "accept": 2558, "argument": 2559, "workspace": 2560, "staging": 2561, "pwd": 2562, "ep_kernels_workspace": 2563, "hopper": 2564, "torch_cuda_arch_list": 2565, "install_python_libraries": 2566, "blackwell": 2567, "additional": 2568, "sudo": 2569, "configure_system_drivers": 2570, "reboot": 2571, "profiler": 2572, "layerwise_profile": 2573, "modelstatsentry": 2574, "summarystatsentry": 2575, "tableprinter": 2576, "indent_string": 2577, "flatten_entries": 2578, "entry_cls": 2579, "profile_dict": 2580, "entries_and_depth": 2581, "get_entries": 2582, "curr_depth": 2583, "entry": 2584, "children": 2585, "math": 2586, "matplotlib": 2587, "pyplot": 2588, "plt": 2589, "largest_dist_from_leaf": 2590, "depth": 2591, "get_entries_at_depth": 2592, "entries_and_traces": 2593, "kernel": 2594, "tall": 2595, "enough": 2596, "fold_nodes": 2597, "nodes_to_fold": 2598, "trim_string_back": 2599, "offset": 2600, "shorten_plot_legend_strings": 2601, "legend": 2602, "max_char_len": 2603, "get_texts": 2604, "set_text": 2605, "abbreviate_known_names": 2606, "get_text": 2607, "abbreviations": 2608, "mergedcolumnparallellinear": 2609, "mcplinear": 2610, "qkvparallellinear": 2611, "qkvplinear": 2612, "rowparallellinear": 2613, "rplinear": 2614, "weight": 2615, "bfloat16": 2616, "bf16": 2617, "float16": 2618, "f16": 2619, "attempt_to_make_names_unique": 2620, "non_unique_names": 2621, "all_the_same": 2622, "entries_and_traces_with_name": 2623, "zipped_traces": 2624, "first_trace_difference": 2625, "trace_eles": 2626, "leave": 2627, "aggregated": 2628, "pivot_table": 2629, "group_trace_by_operations": 2630, "trace_df": 2631, "is_rms_norm": 2632, "op_name": 2633, "rms_norm_kernel": 2634, "is_attention_block": 2635, "flash_fwd": 2636, "reshape_and_cache_flash_kernel": 2637, "is_quant": 2638, "scaled_fp8_quant": 2639, "scaled_int8_quant": 2640, "ops": 2641, "is_sgmv_shrink": 2642, "sgmv_shrink": 2643, "is_sgmv_expand": 2644, "sgmv_expand": 2645, "is_bgmv_shrink": 2646, "bgmv_shrink": 2647, "is_bgmv_expand": 2648, "bgmv_expand": 2649, "is_cutlass_gemm_op": 2650, "void": 2651, "cutlass": 2652, "device_kernel": 2653, "is_gemm_op": 2654, "xmma_gemm": 2655, "gemv2t_kernel": 2656, "splitkreduce": 2657, "s16816gemm": 2658, "is_elementwise_op": 2659, "elementwise_kernel": 2660, "is_mem_op": 2661, "memcpy": 2662, "memset": 2663, "is_vocab_embedding_op": 2664, "vocabparallelembed": 2665, "nccl": 2666, "is_nccl_op": 2667, "is_nccl_all_reduce": 2668, "all_reduce": 2669, "allreduce": 2670, "is_nccl_gather": 2671, "gather": 2672, "is_nccl_broadcas": 2673, "broadcast": 2674, "is_cross_device_reduce_1stage": 2675, "cross_device_reduce_1stage": 2676, "is_cross_device_reduce_2stage": 2677, "cross_device_reduce_2stage": 2678, "is_custom_ar_all_reduce": 2679, "_c_custom_ar": 2680, "is_reduce_kernel": 2681, "reduce_kernel": 2682, "deepcopy": 2683, "attention_ops": 2684, "quant_ops": 2685, "sgmv_shrink_ops": 2686, "sgmv_expand_ops": 2687, "bgmv_shrink_ops": 2688, "bgmv_expand_ops": 2689, "cutlass_gemm_ops": 2690, "gemm_ops": 2691, "rms_norm_ops": 2692, "vocab_embed_ops": 2693, "mem_ops": 2694, "mem_": 2695, "elementwise_ops": 2696, "nccl_all_reduce_ops": 2697, "nccl_gather_ops": 2698, "nccl_broadcast_ops": 2699, "is_nccl_broadcast": 2700, "nccl_other_ops": 2701, "cross_device_reduce_1stage_ops": 2702, "cross_device_reduce_2stage_ops": 2703, "custom_ar_all_reduce_ops": 2704, "reduce_kernel_ops": 2705, "agg": 2706, "bgmv_shrin": 2707, "k_ops": 2708, "cross_de": 2709, "vice_reduce_2stage_ops": 2710, "drop": 2711, "plot_trace_df": 2712, "traces_df": 2713, "plot_metric": 2714, "plot_title": 2715, "get_phase_description": 2716, "phase": 2717, "phase_df": 2718, "descs": 2719, "phase_desc": 2720, "to_list": 2721, "desc": 2722, "phases": 2723, "phase_descs": 2724, "aggfunc": 2725, "figure": 2726, "fig_size_x": 2727, "fig": 2728, "ax": 2729, "subplots": 2730, "figsize": 2731, "sharex": 2732, "draw": 2733, "stacked": 2734, "bars": 2735, "bottom": 2736, "op": 2737, "map": 2738, "isnan": 2739, "bar": 2740, "patches": 2741, "get_height": 2742, "get_x": 2743, "get_width": 2744, "get_y": 2745, "ha": 2746, "bold": 2747, "handles": 2748, "labels": 2749, "gca": 2750, "get_legend_handles_labels": 2751, "loc": 2752, "left": 2753, "bbox_to_anchor": 2754, "50": 2755, "abels": 2756, "title": 2757, "setp": 2758, "get_xticklabels": 2759, "rotation": 2760, "90": 2761, "set_ylabel": 2762, "suptitle": 2763, "savefig": 2764, "bbox_inches": 2765, "tight": 2766, "json_trace": 2767, "output_directory": 2768, "plot": 2769, "operations": 2770, "make_names_unique": 2771, "top_k": 2772, "json_nodes_to_fold": 2773, 