{"security": 0, "policy": 1, "reporting": 2, "issues": 3, "please": 4, "report": 5, "privately": 6, "using": 7, "vulnerability": 8, "submission": 9, "form": 10, "https": 11, "github": 12, "com": 13, "vllm": 14, "project": 15, "advisories": 16, "new": 17, "issue": 18, "triage": 19, "reports": 20, "triaged": 21, "management": 22, "team": 23, "docs": 24, "ai": 25, "en": 26, "latest": 27, "contributing": 28, "vulnerability_management": 29, "html": 30, "threat": 31, "model": 32, "see": 33, "guide": 34, "documentation": 35, "usage": 36, "more": 37, "information": 38, "assumptions": 39, "recommendations": 40, "pytorch": 41, "blob": 42, "main": 43, "md": 44, "how": 45, "securely": 46, "interact": 47, "models": 48, "severity": 49, "we": 50, "determine": 51, "risk": 52, "each": 53, "taking": 54, "account": 55, "our": 56, "experience": 57, "dealing": 58, "past": 59, "versions": 60, "affected": 61, "common": 62, "defaults": 63, "use": 64, "cases": 65, "following": 66, "categories": 67, "critical": 68, "vulnerabilities": 69, "allow": 70, "remote": 71, "attackers": 72, "execute": 73, "arbitrary": 74, "code": 75, "take": 76, "full": 77, "control": 78, "system": 79, "significantly": 80, "compromise": 81, "confidentiality": 82, "integrity": 83, "availability": 84, "without": 85, "any": 86, "interaction": 87, "privileges": 88, "needed": 89, "examples": 90, "include": 91, "execution": 92, "via": 93, "network": 94, "deserialization": 95, "exploit": 96, "chains": 97, "generally": 98, "those": 99, "which": 100, "rated": 101, "cvss": 102, "high": 103, "serious": 104, "flaws": 105, "elevated": 106, "impact": 107, "like": 108, "rce": 109, "specific": 110, "limited": 111, "contexts": 112, "significant": 113, "data": 114, "loss": 115, "require": 116, "advanced": 117, "conditions": 118, "some": 119, "trust": 120, "deployment": 121, "modes": 122, "multi": 123, "node": 124, "where": 125, "sort": 126, "privileged": 127, "access": 128, "required": 129, "typically": 130, "have": 131, "scores": 132, "between": 133, "moderate": 134, "cause": 135, "denial": 136, "service": 137, "partial": 138, "disruption": 139, "do": 140, "breach": 141, "rating": 142, "low": 143, "minor": 144, "informational": 145, "disclosures": 146, "logging": 147, "errors": 148, "non": 149, "exploitable": 150, "weaknesses": 151, "local": 152, "privilege": 153, "offer": 154, "negligible": 155, "side": 156, "channel": 157, "attacks": 158, "hash": 159, "collisions": 160, "often": 161, "less": 162, "than": 163, "prenotification": 164, "certain": 165, "level": 166, "may": 167, "prenotify": 168, "organizations": 169, "vendors": 170, "ship": 171, "purpose": 172, "coordinated": 173, "release": 174, "fixes": 175, "severe": 176, "private": 177, "email": 178, "notification": 179, "also": 180, "adding": 181, "contacts": 182, "advisory": 183, "few": 184, "days": 185, "before": 186, "you": 187, "wish": 188, "added": 189, "group": 190, "send": 191, "copying": 192, "all": 193, "members": 194, "vendor": 195, "contact": 196, "analyzed": 197, "case": 198, "basis": 199, "withdraw": 200, "from": 201, "receiving": 202, "future": 203, "prenotifications": 204, "other": 205, "about": 206, "public": 207, "membership": 208, "change": 209, "based": 210, "refinements": 211, "who": 212, "included": 213, "conduct": 214, "pledge": 215, "contributors": 216, "leaders": 217, "make": 218, "participation": 219, "community": 220, "harassment": 221, "free": 222, "everyone": 223, "regardless": 224, "age": 225, "body": 226, "size": 227, "visible": 228, "invisible": 229, "disability": 230, "ethnicity": 231, "sex": 232, "characteristics": 233, "gender": 234, "identity": 235, "expression": 236, "education": 237, "socioeconomic": 238, "status": 239, "nationality": 240, "personal": 241, "appearance": 242, "race": 243, "caste": 244, "color": 245, "religion": 246, "sexual": 247, "orientation": 248, "act": 249, "ways": 250, "contribute": 251, "open": 252, "welcoming": 253, "diverse": 254, "inclusive": 255, "healthy": 256, "standards": 257, "behavior": 258, "contributes": 259, "positive": 260, "environment": 261, "demonstrating": 262, "empathy": 263, "kindness": 264, "toward": 265, "people": 266, "being": 267, "respectful": 268, "differing": 269, "opinions": 270, "viewpoints": 271, "experiences": 272, "giving": 273, "gracefully": 274, "accepting": 275, "constructive": 276, "feedback": 277, "responsibility": 278, "apologizing": 279, "mistakes": 280, "learning": 281, "focusing": 282, "what": 283, "best": 284, "just": 285, "us": 286, "individuals": 287, "overall": 288, "unacceptable": 289, "sexualized": 290, "language": 291, "imagery": 292, "attention": 293, "advances": 294, "kind": 295, "trolling": 296, "insulting": 297, "derogatory": 298, "comments": 299, "political": 300, "publishing": 301, "others": 302, "physical": 303, "address": 304, "explicit": 305, "permission": 306, "could": 307, "reasonably": 308, "considered": 309, "inappropriate": 310, "professional": 311, "setting": 312, "enforcement": 313, "responsibilities": 314, "responsible": 315, "clarifying": 316, "enforcing": 317, "acceptable": 318, "appropriate": 319, "fair": 320, "corrective": 321, "action": 322, "response": 323, "deem": 324, "threatening": 325, "offensive": 326, "harmful": 327, "right": 328, "remove": 329, "edit": 330, "reject": 331, "commits": 332, "wiki": 333, "edits": 334, "contributions": 335, "aligned": 336, "communicate": 337, "reasons": 338, "moderation": 339, "decisions": 340, "when": 341, "scope": 342, "applies": 343, "within": 344, "spaces": 345, "individual": 346, "officially": 347, "representing": 348, "official": 349, "posting": 350, "social": 351, "media": 352, "acting": 353, "appointed": 354, "representative": 355, "online": 356, "offline": 357, "irl": 358, "event": 359, "instances": 360, "abusive": 361, "harassing": 362, "otherwise": 363, "reported": 364, "slack": 365, "complaints": 366, "reviewed": 367, "investigated": 368, "promptly": 369, "fairly": 370, "obligated": 371, "respect": 372, "privacy": 373, "reporter": 374, "incident": 375, "guidelines": 376, "follow": 377, "determining": 378, "consequences": 379, "violation": 380, "correction": 381, "deemed": 382, "unprofessional": 383, "unwelcome": 384, "consequence": 385, "written": 386, "warning": 387, "providing": 388, "clarity": 389, "around": 390, "nature": 391, "explanation": 392, "why": 393, "apology": 394, "requested": 395, "through": 396, "single": 397, "series": 398, "actions": 399, "continued": 400, "involved": 401, "including": 402, "unsolicited": 403, "specified": 404, "period": 405, "time": 406, "includes": 407, "avoiding": 408, "interactions": 409, "well": 410, "external": 411, "channels": 412, "violating": 413, "terms": 414, "lead": 415, "temporary": 416, "permanent": 417, "ban": 418, "sustained": 419, "communication": 420, "allowed": 421, "during": 422, "pattern": 423, "aggression": 424, "disparagement": 425, "classes": 426, "attribution": 427, "adapted": 428, "contributor": 429, "covenant": 430, "www": 431, "org": 432, "version": 433, "available": 434, "v2": 435, "code_of_conduct": 436, "were": 437, "inspired": 438, "mozilla": 439, "ladder": 440, "inclusion": 441, "answers": 442, "questions": 443, "faq": 444, "translations": 445, "releasing": 446, "releases": 447, "reliable": 448, "base": 449, "packaged": 450, "binary": 451, "format": 452, "can": 453, "conveniently": 454, "accessed": 455, "pypi": 456, "serve": 457, "key": 458, "milestones": 459, "development": 460, "newly": 461, "features": 462, "improvements": 463, "upcoming": 464, "changes": 465, "affect": 466, "users": 467, "potential": 468, "breaking": 469, "versioning": 470, "uses": 471, "shifted": 472, "scheme": 473, "patch": 474, "out": 475, "every": 476, "weeks": 477, "contain": 478, "bug": 479, "opposed": 480, "semver": 481, "contains": 482, "only": 483, "backwards": 484, "compatible": 485, "need": 486, "made": 487, "special": 488, "post1": 489, "released": 490, "_major_": 491, "major": 492, "architectural": 493, "milestone": 494, "incompatible": 495, "api": 496, "similar": 497, "_minor_": 498, "_patch_": 499, "_post1_": 500, "_patch": 501, "1_": 502, "either": 503, "implicit": 504, "post": 505, "cadence": 506, "bi": 507, "weekly": 508, "after": 509, "same": 510, "branch": 511, "year": 512, "2025": 513, "dates": 514, "below": 515, "tentative": 516, "note": 517, "optional": 518, "date": 519, "jan": 520, "feb": 521, "mar": 522, "apr": 523, "jun": 524, "10": 525, "11": 526, "jul": 527, "12": 528, "13": 529, "aug": 530, "14": 531, "15": 532, "sep": 533, "16": 534, "17": 535, "oct": 536, "18": 537, "19": 538, "nov": 539, "20": 540, "21": 541, "dec": 542, "22": 543, "23": 544, "built": 545, "dedicated": 546, "cut": 547, "performed": 548, "live": 549, "previously": 550, "reused": 551, "builds": 552, "triggered": 553, "push": 554, "rc": 555, "tag": 556, "vx": 557, "rc1": 558, "enables": 559, "build": 560, "test": 561, "multiple": 562, "rcs": 563, "final": 564, "does": 565, "trigger": 566, "used": 567, "notes": 568, "assets": 569, "created": 570, "monitor": 571, "reverts": 572, "apply": 573, "cherry": 574, "pick": 575, "criteria": 576, "approach": 577, "finalizing": 578, "clear": 579, "picks": 580, "process": 581, "land": 582, "pr": 583, "ensure": 584, "has": 585, "sufficient": 586, "complete": 587, "thorough": 588, "round": 589, "testing": 590, "stable": 591, "regression": 592, "functional": 593, "performance": 594, "against": 595, "most": 596, "recent": 597, "silent": 598, "incorrectness": 599, "compatibility": 600, "crashes": 601, "deadlocks": 602, "large": 603, "memory": 604, "leaks": 605, "introduced": 606, "identifiers": 607, "ci": 608, "feature": 609, "work": 610, "prs": 611, "merged": 612, "trunk": 613, "exception": 614, "manual": 615, "validations": 616, "e2e": 617, "validation": 618, "perform": 619, "end": 620, "regressions": 621, "benchmark": 622, "workflow": 623, "integration": 624, "workflows": 625, "yml": 626, "current": 627, "coverage": 628, "llama3": 629, "llama4": 630, "mixtral": 631, "hardware": 632, "nvidia": 633, "h100": 634, "amd": 635, "mi300x": 636, "_note": 637, "availability_": 638, "step": 639, "get": 640, "request": 641, "write": 642, "repository": 643, "run": 644, "review": 645, "setup": 646, "familiarize": 647, "yourself": 648, "configurations": 649, "cuda": 650, "tree": 651, "benchmarks": 652, "rocm": 653, "navigate": 654, "configure": 655, "set": 656, "v0": 657, "commit": 658, "results": 659, "once": 660, "completes": 661, "dashboard": 662, "hud": 663, "llms": 664, "reponame": 665, "2fvllm": 666, "under": 667, "corresponding": 668, "comparison": 669, "compare": 670, "previous": 671, "verify": 672, "occurred": 673, "here": 674, "example": 675, "vs": 676, "starttime": 677, "thu": 678, "2c": 679, "2017": 680, "20apr": 681, "202025": 682, "2021": 683, "3a43": 684, "3a50": 685, "20gmt": 686, "stoptime": 687, "wed": 688, "2016": 689, "20jul": 690, "granularity": 691, "week": 692, "lbranch": 693, "lcommit": 694, "b6553be1bc75f046b00046a4ad7576364d03c835": 695, "rbranch": 696, "rcommit": 697, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 698, "benchmarkname": 699, "modelname": 700, "20models": 701, "backendname": 702, "20backends": 703, "modename": 704, "20modes": 705, "dtypename": 706, "20dtype": 707, "devicename": 708, "20devices": 709, "archname": 710, "20platforms": 711, "markdownlint": 712, "disable": 713, "md001": 714, "md041": 715, "align": 716, "center": 717, "picture": 718, "source": 719, "prefers": 720, "dark": 721, "srcset": 722, "raw": 723, "githubusercontent": 724, "logos": 725, "logo": 726, "text": 727, "png": 728, "img": 729, "alt": 730, "src": 731, "light": 732, "width": 733, "55": 734, "h3": 735, "easy": 736, "fast": 737, "cheap": 738, "llm": 739, "serving": 740, "href": 741, "blog": 742, "arxiv": 743, "abs": 744, "2309": 745, "06180": 746, "paper": 747, "vllm_project": 748, "twitter": 749, "discuss": 750, "user": 751, "forum": 752, "developer": 753, "news": 754, "08": 755, "hosted": 756, "beijing": 757, "meetup": 758, "mp": 759, "weixin": 760, "qq": 761, "dgkwg1wfpwgo2jcdtqqhxa": 762, "scale": 763, "find": 764, "slides": 765, "drive": 766, "google": 767, "folders": 768, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 769, "recording": 770, "chaspark": 771, "1166916873711665152": 772, "05": 773, "nyc": 774, "lu": 775, "ma": 776, "c1rqyf1f": 777, "presentation": 778, "1_q_aw_iomjwuimf1s1ym": 779, "zhjxz8cuel0ijvaquoybea": 780, "usp": 781, "sharing": 782, "now": 783, "foundation": 784, "announcement": 785, "welcomes": 786, "01": 787, "excited": 788, "announce": 789, "alpha": 790, "v1": 791, "upgrade": 792, "7x": 793, "speedup": 794, "clean": 795, "optimized": 796, "loop": 797, "zero": 798, "overhead": 799, "prefix": 800, "caching": 801, "enhanced": 802, "multimodal": 803, "support": 804, "check": 805, "27": 806, "details": 807, "summary": 808, "04": 809, "asia": 810, "day": 811, "sginnovate": 812, "morning": 813, "evening": 814, "slots": 815, "remaining": 816, "inaugural": 817, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 818, "03": 819, "ollama": 820, "inference": 821, "night": 822, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 823, "first": 824, "china": 825, "n77gibl2coratqhtveazfg": 826, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 827, "east": 828, "coast": 829, "7mu4k4xx": 830, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 831, "slide": 832, "id": 833, "g31441846c39_0_0": 834, "02": 835, "ninth": 836, "h7g3kuj9": 837, "meta": 838, "1jzc_pzvxrvnsfvcw": 839, "v4cfxb6pn7zz2cyp_flwo05aqg": 840, "file": 841, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 842, "view": 843, "posted": 844, "eighth": 845, "zep56hui": 846, "cloud": 847, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 848, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 849, "2024": 850, "joins": 851, "ecosystem": 852, "seventh": 853, "h0qvrajz": 854, "snowflake": 855, "1e3cxqbv3jsfgp30swyvs3em_tw": 856, "ghohj9pajgk6kr54": 857, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 858, "coordinating": 859, "discussing": 860, "feel": 861, "join": 862, "ray": 863, "summit": 864, "held": 865, "track": 866, "opening": 867, "talk": 868, "1b_kqxphbtra_mdf": 869, "tr6i8rwdou5qotznceg2mkzxehm": 870, "learn": 871, "talks": 872, "youtube": 873, "playlist": 874, "list": 875, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 876, "09": 877, "sixth": 878, "87q3nvnh": 879, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 880, "9wqyp7ny93xrs": 881, "07": 882, "fifth": 883, "lp0gyjqr": 884, "aws": 885, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 886, "partnership": 887, "supports": 888, "llama": 889, "fp8": 890, "quantization": 891, "pipeline": 892, "parallelism": 893, "llama31": 894, "06": 895, "fourth": 896, "agivllm": 897, "cloudflare": 898, "bentoml": 899, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 900, "third": 901, "robloxandvllmmeetup2024": 902, "splashthat": 903, "roblox": 904, "1a": 905, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 906, "second": 907, "ygxbpzhl": 908, "ibm": 909, "12mi2skabnuw5rbwxdyy": 910, "hthth4imsnceoq10jdqbxga": 911, "2023": 912, "a16z": 913, "1ql": 914, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 915, "would": 916, "express": 917, "sincere": 918, "gratitude": 919, "andreessen": 920, "horowitz": 921, "30": 922, "supporting": 923, "generous": 924, "grant": 925, "research": 926, "fastchat": 927, "powered": 928, "lmsys": 929, "vicuna": 930, "chatbot": 931, "arena": 932, "chat": 933, "since": 934, "mid": 935, "april": 936, "library": 937, "originally": 938, "developed": 939, "sky": 940, "computing": 941, "lab": 942, "cs": 943, "berkeley": 944, "edu": 945, "uc": 946, "evolved": 947, "driven": 948, "both": 949, "academia": 950, "industry": 951, "state": 952, "art": 953, "throughput": 954, "efficient": 955, "value": 956, "pagedattention": 957, "continuous": 958, "batching": 959, "incoming": 960, "requests": 961, "hip": 962, "graph": 963, "quantizations": 964, "gptq": 965, "2210": 966, "17323": 967, "awq": 968, "2306": 969, "00978": 970, "autoround": 971, "05516": 972, "int4": 973, "int8": 974, "kernels": 975, "flashattention": 976, "flashinfer": 977, "speculative": 978, "decoding": 979, "chunked": 980, "prefill": 981, "flexible": 982, "seamless": 983, "popular": 984, "hugging": 985, "face": 986, "various": 987, "algorithms": 988, "parallel": 989, "sampling": 990, "beam": 991, "search": 992, "tensor": 993, "expert": 994, "distributed": 995, "streaming": 996, "outputs": 997, "openai": 998, "server": 999, "gpus": 1000, "cpus": 1001, "intel": 1002, "powerpc": 1003, "tpu": 1004, "neuron": 1005, "lora": 1006, "seamlessly": 1007, "huggingface": 1008, "transformer": 1009, "mixture": 1010, "deepseek": 1011, "v3": 1012, "embedding": 1013, "e5": 1014, "mistral": 1015, "modal": 1016, "llava": 1017, "supported": 1018, "supported_models": 1019, "getting": 1020, "started": 1021, "install": 1022, "pip": 1023, "getting_started": 1024, "installation": 1025, "gpu": 1026, "index": 1027, "wheel": 1028, "bash": 1029, "visit": 1030, "quickstart": 1031, "welcome": 1032, "collaborations": 1033, "sponsors": 1034, "compute": 1035, "resources": 1036, "thank": 1037, "your": 1038, "them": 1039, "alphabetical": 1040, "order": 1041, "keep": 1042, "consistent": 1043, "cash": 1044, "donations": 1045, "dropbox": 1046, "sequoia": 1047, "capital": 1048, "skywork": 1049, "zhenfund": 1050, "alibaba": 1051, "anyscale": 1052, "crusoe": 1053, "databricks": 1054, "deepinfra": 1055, "lambda": 1056, "nebius": 1057, "novita": 1058, "replicate": 1059, "runpod": 1060, "trainy": 1061, "san": 1062, "diego": 1063, "sponsor": 1064, "fundraising": 1065, "venue": 1066, "opencollective": 1067, "plan": 1068, "fund": 1069, "maintenance": 1070, "adoption": 1071, "citation": 1072, "cite": 1073, "bibtex": 1074, "inproceedings": 1075, "kwon2023efficient": 1076, "title": 1077, "author": 1078, "woosuk": 1079, "kwon": 1080, "zhuohan": 1081, "li": 1082, "siyuan": 1083, "zhuang": 1084, "ying": 1085, "sheng": 1086, "lianmin": 1087, "zheng": 1088, "cody": 1089, "hao": 1090, "yu": 1091, "joseph": 1092, "gonzalez": 1093, "zhang": 1094, "ion": 1095, "stoica": 1096, "booktitle": 1097, "proceedings": 1098, "acm": 1099, "sigops": 1100, "29th": 1101, "symposium": 1102, "operating": 1103, "systems": 1104, "principles": 1105, "start": 1106, "technical": 1107, "fellow": 1108, "partnerships": 1109, "lists": 1110, "mailto": 1111, "kit": 1112, "refer": 1113, "repo": 1114, "benchmarking": 1115, "readme": 1116, "guides": 1117, "running": 1118, "tests": 1119, "extensive": 1120, "datasets": 1121, "living": 1122, "document": 1123, "updated": 1124, "become": 1125, "dataset": 1126, "overview": 1127, "table": 1128, "style": 1129, "100": 1130, "border": 1131, "collapse": 1132, "thead": 1133, "tr": 1134, "th": 1135, "left": 1136, "65": 1137, "path": 1138, "tbody": 1139, "td": 1140, "strong": 1141, "sharegpt": 1142, "wget": 1143, "co": 1144, "anon8231489123": 1145, "sharegpt_vicuna_unfiltered": 1146, "resolve": 1147, "sharegpt_v3_unfiltered_cleaned_split": 1148, "json": 1149, "sharegpt4v": 1150, "image": 1151, "lin": 1152, "chen": 1153, "sharegpt4v_instruct_gpt4": 1154, "vision_cap100k": 1155, "br": 1156, "div": 1157, "images": 1158, "downloaded": 1159, "separately": 1160, "download": 1161, "coco": 1162, "train": 1163, "http": 1164, "cocodataset": 1165, "zips": 1166, "train2017": 1167, "zip": 1168, "burstgpt": 1169, "hpmll": 1170, "burstgpt_without_fails_2": 1171, "csv": 1172, "sonnet": 1173, "deprecated": 1174, "txt": 1175, "random": 1176, "synthetic": 1177, "repetition": 1178, "visionarena": 1179, "lmarena": 1180, "instructcoder": 1181, "likaixin": 1182, "aimo": 1183, "mo": 1184, "aime": 1185, "numinamath": 1186, "cot": 1187, "lmms": 1188, "onevision": 1189, "aeala": 1190, "custom": 1191, "jsonl": 1192, "name": 1193, "should": 1194, "hf": 1195, "show": 1196, "nousresearch": 1197, "hermes": 1198, "8b": 1199, "script": 1200, "bench": 1201, "backend": 1202, "endpoint": 1203, "completions": 1204, "num": 1205, "prompts": 1206, "successful": 1207, "output": 1208, "result": 1209, "duration": 1210, "78": 1211, "total": 1212, "input": 1213, "tokens": 1214, "1369": 1215, "generated": 1216, "2212": 1217, "req": 1218, "73": 1219, "token": 1220, "tok": 1221, "382": 1222, "89": 1223, "619": 1224, "85": 1225, "mean": 1226, "ttft": 1227, "ms": 1228, "71": 1229, "54": 1230, "median": 1231, "88": 1232, "p99": 1233, "79": 1234, "49": 1235, "per": 1236, "excl": 1237, "1st": 1238, "tpot": 1239, "91": 1240, "96": 1241, "inter": 1242, "latency": 1243, "itl": 1244, "74": 1245, "70": 1246, "39": 1247, "want": 1248, "yet": 1249, "even": 1250, "customdataset": 1251, "needs": 1252, "prompt": 1253, "field": 1254, "entry": 1255, "india": 1256, "iran": 1257, "vllm_use_v1": 1258, "instruct": 1259, "port": 1260, "9001": 1261, "save": 1262, "detailed": 1263, "skip": 1264, "template": 1265, "80": 1266, "max": 1267, "concurrency": 1268, "temperature": 1269, "top": 1270, "75": 1271, "dir": 1272, "log": 1273, "applying": 1274, "already": 1275, "vision": 1276, "capability": 1277, "qwen": 1278, "qwen2": 1279, "vl": 1280, "7b": 1281, "split": 1282, "1000": 1283, "config": 1284, "method": 1285, "ngram": 1286, "num_speculative_tokens": 1287, "prompt_lookup_max": 1288, "prompt_lookup_min": 1289, "2048": 1290, "huggingfacedataset": 1291, "subset": 1292, "chart2text": 1293, "cauldron": 1294, "qwq": 1295, "32b": 1296, "seed": 1297, "42": 1298, "philschmid": 1299, "mt": 1300, "parameters": 1301, "backends": 1302, "client": 1303, "command": 1304, "ramp": 1305, "up": 1306, "rate": 1307, "tool": 1308, "ramping": 1309, "over": 1310, "useful": 1311, "stress": 1312, "finding": 1313, "maximum": 1314, "handle": 1315, "given": 1316, "budget": 1317, "two": 1318, "strategies": 1319, "linear": 1320, "increases": 1321, "linearly": 1322, "exponential": 1323, "exponentially": 1324, "arguments": 1325, "strategy": 1326, "rps": 1327, "beginning": 1328, "4656": 1329, "00": 1330, "1072": 1331, "5014": 1332, "1500": 1333, "counts": 1334, "4036": 1335, "92": 1336, "326": 1337, "90": 1338, "14527": 1339, "1280": 1340, "vllm_worker_multiproc_method": 1341, "spawn": 1342, "len": 1343, "async": 1344, "engine": 1345, "104": 1346, "77": 1347, "23836": 1348, "10477": 1349, "261136": 1350, "204800": 1351, "adapters": 1352, "dataset_path": 1353, "dataset_name": 1354, "loras": 1355, "rank": 1356, "enable": 1357, "yard1": 1358, "sql": 1359, "structured": 1360, "generation": 1361, "grammar": 1362, "regex": 1363, "schema": 1364, "python3": 1365, "benchmark_serving_structured_output": 1366, "py": 1367, "ratio": 1368, "structure": 1369, "type": 1370, "choice": 1371, "xgrammar": 1372, "xgrammar_bench": 1373, "long": 1374, "qa": 1375, "question": 1376, "answering": 1377, "basic": 1378, "benchmark_long_document_qa_throughput": 1379, "documents": 1380, "length": 1381, "2000": 1382, "50": 1383, "repeat": 1384, "count": 1385, "different": 1386, "mode": 1387, "default": 1388, "shuffle": 1389, "randomly": 1390, "3000": 1391, "tile": 1392, "entire": 1393, "sequence": 1394, "interleave": 1395, "consecutively": 1396, "efficiency": 1397, "automatic": 1398, "fixed": 1399, "benchmark_prefix_caching": 1400, "range": 1401, "128": 1402, "256": 1403, "prefix_repetition": 1404, "512": 1405, "suffix": 1406, "prefixes": 1407, "prioritization": 1408, "benchmark_prioritization": 1409, "64": 1410, "scheduling": 1411, "priority": 1412, "sequences": 1413, "python": 1414, "entrypoints": 1415, "api_server": 1416, "dtype": 1417, "bfloat16": 1418, "limit": 1419, "mm": 1420, "benchmark_serving": 1421, "vllm_benchmark_results": 1422, "completion": 1423, "automated": 1424, "parameter": 1425, "tuning": 1426, "automates": 1427, "optimal": 1428, "combination": 1429, "seqs": 1430, "batched": 1431, "maximize": 1432, "additional": 1433, "constraints": 1434, "cache": 1435, "hit": 1436, "contents": 1437, "prerequisites": 1438, "configuration": 1439, "works": 1440, "steps": 1441, "completed": 1442, "clone": 1443, "desired": 1444, "git": 1445, "cd": 1446, "checkout": 1447, "update": 1448, "correct": 1449, "activate": 1450, "conda": 1451, "torch": 1452, "torch_xla": 1453, "customized": 1454, "its": 1455, "files": 1456, "correctly": 1457, "placed": 1458, "accessible": 1459, "must": 1460, "variables": 1461, "variable": 1462, "description": 1463, "absolute": 1464, "parent": 1465, "directory": 1466, "home": 1467, "identifier": 1468, "served": 1469, "choices": 1470, "might": 1471, "saving": 1472, "profiles": 1473, "tp": 1474, "download_dir": 1475, "load": 1476, "weights": 1477, "input_len": 1478, "4000": 1479, "output_len": 1480, "max_model_len": 1481, "4096": 1482, "min_cache_hit_pct": 1483, "percentage": 1484, "60": 1485, "max_latency_allowed_ms": 1486, "milliseconds": 1487, "very": 1488, "number": 1489, "100000000000": 1490, "effectively": 1491, "ignore": 1492, "constraint": 1493, "500": 1494, "num_seqs_list": 1495, "space": 1496, "separated": 1497, "string": 1498, "values": 1499, "num_batched_tokens_list": 1500, "1024": 1501, "medium": 1502, "sized": 1503, "inputs": 1504, "short": 1505, "larger": 1506, "section": 1507, "highly": 1508, "recommended": 1509, "terminal": 1510, "multiplexer": 1511, "tmux": 1512, "screen": 1513, "prevent": 1514, "stopping": 1515, "connection": 1516, "lost": 1517, "folder_of_this_script": 1518, "auto_tune": 1519, "sh": 1520, "cannot": 1521, "keyword": 1522, "pkill": 1523, "kill": 1524, "itself": 1525, "goals": 1526, "goal": 1527, "highest": 1528, "possible": 1529, "1800": 1530, "requirement": 1531, "500ms": 1532, "requirements": 1533, "assuming": 1534, "finishes": 1535, "timestamped": 1536, "inside": 1537, "auto": 1538, "yyyy_mm_dd_hh_mm": 1539, "logs": 1540, "vllm_log_": 1541, "bm_log_": 1542, "named": 1543, "tested": 1544, "concludes": 1545, "found": 1546, "content": 1547, "a1b2c3d4": 1548, "max_num_seqs": 1549, "max_num_batched_tokens": 1550, "request_rate": 1551, "e2el": 1552, "450": 1553, "goodput": 1554, "meet": 1555, "best_max_num_seqs": 1556, "best_num_batched_tokens": 1557, "best_throughput": 1558, "profile": 1559, "saved": 1560, "2024_08_01_10_30": 1561, "row": 1562, "due": 1563, "starting": 1564, "properly": 1565, "too": 1566, "strict": 1567, "profiler": 1568, "trace": 1569, "xplane": 1570, "pb": 1571, "performing": 1572, "follows": 1573, "systematic": 1574, "utilization": 1575, "determines": 1576, "safe": 1577, "98": 1578, "decreasing": 1579, "oom": 1580, "error": 1581, "launching": 1582, "ensures": 1583, "runs": 1584, "crashing": 1585, "iterate": 1586, "enters": 1587, "nested": 1588, "iterating": 1589, "provided": 1590, "aware": 1591, "infinite": 1592, "inf": 1593, "resulting": 1594, "performs": 1595, "iteratively": 1596, "until": 1597, "met": 1598, "finds": 1599, "sustainable": 1600, "throughout": 1601, "tracks": 1602, "yielded": 1603, "valid": 1604, "so": 1605, "far": 1606, "collection": 1607, "saves": 1608, "deep": 1609, "dive": 1610, "analysis": 1611, "tools": 1612, "tensorboard": 1613, "kv": 1614, "offloading": 1615, "turn": 1616, "conversations": 1617, "benchmark_serving_multi_turn": 1618, "export": 1619, "model_name": 1620, "gutenberg": 1621, "ebooks": 1622, "1184": 1623, "utf": 1624, "mv": 1625, "pg1184": 1626, "filename": 1627, "generate_multi_turn": 1628, "text_files": 1629, "prefer": 1630, "clients": 1631, "active": 1632, "conversation": 1633, "turns": 1634, "etc": 1635, "statistics": 1636, "runtime_sec": 1637, "215": 1638, "810": 1639, "requests_per_sec": 1640, "769": 1641, "std": 1642, "min": 1643, "25": 1644, "99": 1645, "ttft_ms": 1646, "166": 1647, "67": 1648, "63": 1649, "45": 1650, "59": 1651, "94": 1652, "62": 1653, "26": 1654, "43": 1655, "69": 1656, "66": 1657, "353": 1658, "567": 1659, "tpot_ms": 1660, "37": 1661, "57": 1662, "24": 1663, "40": 1664, "31": 1665, "84": 1666, "28": 1667, "latency_ms": 1668, "2591": 1669, "1998": 1670, "53": 1671, "2341": 1672, "2573": 1673, "2860": 1674, "3003": 1675, "3268": 1676, "46": 1677, "3862": 1678, "input_num_turns": 1679, "input_num_tokens": 1680, "2006": 1681, "893": 1682, "56": 1683, "522": 1684, "1247": 1685, "2019": 1686, "2718": 1687, "3233": 1688, "3736": 1689, "3899": 1690, "output_num_tokens": 1691, "109": 1692, "116": 1693, "120": 1694, "output_num_chunks": 1695, "108": 1696, "115": 1697, "119": 1698, "sharegpt_20230401_clean_lang_split": 1699, "convert_sharegpt_to_openai": 1700, "convert": 1701, "sharegpt_conv_128": 1702, "items": 1703, "standard": 1704, "assistant": 1705, "roles": 1706, "flag": 1707, "sample": 1708, "original": 1709, "deepgemm": 1710, "block": 1711, "existing": 1712, "triton": 1713, "cutlass": 1714, "currently": 1715, "dense": 1716, "gemms": 1717, "hopper": 1718, "usual": 1719, "fashion": 1720, "own": 1721, "recursive": 1722, "uv": 1723, "console": 1724, "benchmark_fp8_block_dense_gemm": 1725, "info": 1726, "__init__": 1727, "207": 1728, "automatically": 1729, "detected": 1730, "platform": 1731, "gemm": 1732, "cu124": 1733, "device": 1734, "80gb": 1735, "hbm3": 1736, "fp8_utils": 1737, "458": 1738, "w8a8": 1739, "kernel": 1740, "sub": 1741, "mgoin": 1742, "model_executor": 1743, "layers": 1744, "utils": 1745, "configs": 1746, "7168": 1747, "device_name": 1748, "nvidia_h100_80gb_hbm3": 1749, "fp8_w8a8": 1750, "block_shape": 1751, "449": 1752, "18432": 1753, "24576": 1754, "1536": 1755, "32768": 1756, "16384": 1757, "implementation": 1758, "μs": 1759, "tflops": 1760, "gb": 1761, "102": 1762, "286": 1763, "29": 1764, "1868": 1765, "1911": 1766, "439": 1767, "243": 1768, "1933": 1769, "240": 1770, "1917": 1771, "68": 1772, "584": 1773, "307": 1774, "216": 1775, "1718": 1776, "141": 1777, "222": 1778, "470": 1779, "1896": 1780, "488": 1781, "1988": 1782, "670": 1783, "502": 1784, "279": 1785, "969": 1786, "635": 1787, "175": 1788, "687": 1789, "347": 1790, "335": 1791, "717": 1792, "275": 1793, "398": 1794, "39x": 1795, "faster": 1796, "1478": 1797, "79x": 1798, "slower": 1799, "113": 1800, "1170": 1801, "61x": 1802, "47": 1803, "87x": 1804, "171": 1805, "1363": 1806, "70x": 1807, "1129": 1808, "59x": 1809, "1089": 1810, "86x": 1811, "38": 1812, "542": 1813, "77x": 1814, "86": 1815, "174": 1816, "1386": 1817, "81x": 1818, "82": 1819, "345": 1820, "56x": 1821, "144": 1822, "234": 1823, "946": 1824, "50x": 1825, "229": 1826, "147": 1827, "600": 1828, "30x": 1829, "242": 1830, "248": 1831, "186": 1832, "37x": 1833, "897": 1834, "301": 1835, "197": 1836, "31x": 1837, "463": 1838, "259": 1839, "131": 1840, "38x": 1841, "901": 1842, "266": 1843, "34": 1844, "852": 1845, "98x": 1846, "14x": 1847, "1677": 1848, "90x": 1849, "13x": 1850, "81": 1851, "1631": 1852, "85x": 1853, "36": 1854, "101": 1855, "822": 1856, "15x": 1857, "87": 1858, "193": 1859, "1535": 1860, "199": 1861, "1587": 1862, "83x": 1863, "41x": 1864, "172": 1865, "1465": 1866, "51x": 1867, "35x": 1868, "728": 1869, "34x": 1870, "1532": 1871, "89x": 1872, "11x": 1873, "192": 1874, "802": 1875, "32x": 1876, "93": 1877, "360": 1878, "1454": 1879, "54x": 1880, "394": 1881, "1608": 1882, "68x": 1883, "603": 1884, "452": 1885, "43x": 1886, "331": 1887, "816": 1888, "534": 1889, "84x": 1890, "71x": 1891, "198": 1892, "606": 1893, "306": 1894, "88x": 1895, "392": 1896, "613": 1897, "235": 1898, "average": 1899, "avg": 1900, "310": 1901, "1052": 1902, "715": 1903, "1076": 1904, "speedups": 1905, "94x": 1906, "accuracy": 1907, "diff": 1908, "reference": 1909, "000684": 1910, "leverages": 1911, "dictconfig": 1912, "functionality": 1913, "robust": 1914, "loggers": 1915, "offers": 1916, "accommodate": 1917, "simple": 1918, "inflexible": 1919, "complex": 1920, "vllm_configure_logging": 1921, "leaving": 1922, "vllm_logging_config_path": 1923, "unset": 1924, "leave": 1925, "fine": 1926, "grained": 1927, "controls": 1928, "whether": 1929, "takes": 1930, "enabled": 1931, "disabled": 1932, "root": 1933, "logger": 1934, "configured": 1935, "defer": 1936, "occur": 1937, "while": 1938, "allows": 1939, "specify": 1940, "alternative": 1941, "instead": 1942, "dictionary": 1943, "customize": 1944, "nhairs": 1945, "part": 1946, "container": 1947, "stdout": 1948, "begin": 1949, "create": 1950, "logging_config": 1951, "formatters": 1952, "class": 1953, "pythonjsonlogger": 1954, "jsonlogger": 1955, "jsonformatter": 1956, "handlers": 1957, "streamhandler": 1958, "formatter": 1959, "stream": 1960, "ext": 1961, "sys": 1962, "propagate": 1963, "false": 1964, "finally": 1965, "mistralai": 1966, "silence": 1967, "particular": 1968, "necessary": 1969, "provide": 1970, "target": 1971, "configures": 1972, "won": 1973, "messages": 1974, "overrides": 1975, "logging_utils": 1976, "newlineformatter": 1977, "datefmt": 1978, "levelname": 1979, "asctime": 1980, "lineno": 1981, "message": 1982, "debug": 1983, "example_noisy_logger": 1984, "configuring": 1985, "silences": 1986, "lmcache": 1987, "folder": 1988, "demonstrates": 1989, "disaggregated": 1990, "prefilling": 1991, "cpu": 1992, "nixl": 1993, "simply": 1994, "dynamo": 1995, "least": 1996, "hf_token": 1997, "disagg_prefill_lmcache_v1": 1998, "disagg_example_nixl": 1999, "components": 2000, "scripts": 2001, "disagg_vllm_launcher": 2002, "launches": 2003, "servers": 2004, "decode": 2005, "proxy": 2006, "disagg_proxy_server": 2007, "fastapi": 2008, "coordinates": 2009, "prefiller": 2010, "decoder": 2011, "yaml": 2012, "generates": 2013, "several": 2014, "offload": 2015, "cpu_offload_lmcache": 2016, "kv_cache_sharing_lmcache_v1": 2017, "share": 2018, "caches": 2019, "disaggregated_prefill_lmcache_v0": 2020, "provides": 2021, "batch": 2022, "important": 2023, "rest": 2024, "consists": 2025, "objects": 2026, "lines": 2027, "offline_inference": 2028, "openai_batch": 2029, "openai_example_batch": 2030, "line": 2031, "represents": 2032, "separate": 2033, "package": 2034, "requestinput": 2035, "embeddings": 2036, "score": 2037, "endpoints": 2038, "coming": 2039, "soon": 2040, "pre": 2041, "requisites": 2042, "hub": 2043, "machine": 2044, "cli": 2045, "login": 2046, "gated": 2047, "visiting": 2048, "card": 2049, "agreeing": 2050, "along": 2051, "working": 2052, "ve": 2053, "look": 2054, "cat": 2055, "custom_id": 2056, "url": 2057, "role": 2058, "helpful": 2059, "hello": 2060, "world": 2061, "max_completion_tokens": 2062, "unhelpful": 2063, "designed": 2064, "called": 2065, "run_batch": 2066, "383d1c59835645aeb2e07d004d62a826": 2067, "cmpl": 2068, "61c020e54b964d5a98fa7527bfcdd378": 2069, "object": 2070, "1715633336": 2071, "great": 2072, "help": 2073, "tasks": 2074, "mind": 2075, "today": 2076, "logprobs": 2077, "null": 2078, "finish_reason": 2079, "stop": 2080, "stop_reason": 2081, "prompt_tokens": 2082, "total_tokens": 2083, "completion_tokens": 2084, "42e3d09b14b04568afa3f1797751a267": 2085, "f44d049f6b3a42d4b2d7850bb1e31bcc": 2086, "32": 2087, "runner": 2088, "urls": 2089, "located": 2090, "integrating": 2091, "s3": 2092, "integrate": 2093, "storage": 2094, "recommend": 2095, "presigned": 2096, "bucket": 2097, "amazon": 2098, "amazons3": 2099, "userguide": 2100, "creating": 2101, "awscli": 2102, "credentials": 2103, "interactively": 2104, "boto3": 2105, "generate": 2106, "upload": 2107, "cp": 2108, "my_bucket": 2109, "my_input_file": 2110, "sdk": 2111, "sure": 2112, "replace": 2113, "my_output_file": 2114, "placeholders": 2115, "names": 2116, "awsdocs": 2117, "doc": 2118, "example_code": 2119, "s3_basics": 2120, "presigned_url": 2121, "import": 2122, "botocore": 2123, "exceptions": 2124, "clienterror": 2125, "def": 2126, "generate_presigned_url": 2127, "s3_client": 2128, "client_method": 2129, "method_parameters": 2130, "expires_in": 2131, "param": 2132, "seconds": 2133, "return": 2134, "try": 2135, "clientmethod": 2136, "params": 2137, "expiresin": 2138, "except": 2139, "raise": 2140, "input_url": 2141, "get_object": 2142, "3600": 2143, "output_url": 2144, "put_object": 2145, "print": 2146, "west": 2147, "amazonaws": 2148, "awsaccesskeyid": 2149, "abcdefghijklmnopqrst": 2150, "signature": 2151, "abcdefghijklmnopqrstuvwxyz12345": 2152, "expires": 2153, "1715800091": 2154, "add": 2155, "intfloat": 2156, "mix": 2157, "earlier": 2158, "db0f71f7dec244e6bce530e0b4ef908b": 2159, "status_code": 2160, "200": 2161, "request_id": 2162, "3580bf4d4ae54d52b67eee266a6eab20": 2163, "embd": 2164, "33ac2efa7996430184461f2e38529746": 2165, "444647": 2166, "016204833984375": 2167, "0092010498046875": 2168, "0018358230590820312": 2169, "0028228759765625": 2170, "001422882080078125": 2171, "0031147003173828125": 2172, "baai": 2173, "bge": 2174, "reranker": 2175, "m3": 2176, "text_1": 2177, "france": 2178, "text_2": 2179, "brazil": 2180, "brasilia": 2181, "paris": 2182, "f87c5c4539184f618e555744a2965987": 2183, "806ab64512e44071b37d3f7ccd291413": 2184, "4ee45236897b4d29907d49b01298cdb1": 2185, "1737847944": 2186, "0010900497436523438": 2187, "prompt_tokens_details": 2188, "41990c51a26d4fac8419077f12871099": 2189, "73ce66379026482699f81974e14e1e99": 2190, "13f2ffe6ba40460fbf9f7f00ad667d75": 2191, "001094818115234375": 2192, "demonstrate": 2193, "helper": 2194, "prefill_example": 2195, "decode_example": 2196, "sequentially": 2197, "local_storage": 2198, "loading": 2199, "primary": 2200, "interface": 2201, "doing": 2202, "interacting": 2203, "shows": 2204, "argument": 2205, "parser": 2206, "argparse": 2207, "pass": 2208, "classify": 2209, "embed": 2210, "accept": 2211, "inference_params": 2212, "max_tokens": 2213, "top_p": 2214, "top_k": 2215, "passing": 2216, "experiment": 2217, "specifies": 2218, "loaded": 2219, "calling": 2220, "get_default_sampling_params": 2221, "max_new_tokens": 2222, "sets": 2223, "wide": 2224, "gguf": 2225, "quantized": 2226, "one": 2227, "downloading": 2228, "huggingface_hub": 2229, "hf_hub_download": 2230, "repo_id": 2231, "bartowski": 2232, "phi": 2233, "4k": 2234, "iq2_m": 2235, "printed": 2236, "above": 2237, "tokenizer": 2238, "microsoft": 2239, "seen": 2240, "virtual": 2241, "way": 2242, "increase": 2243, "virtually": 2244, "think": 2245, "13b": 2246, "bf16": 2247, "weight": 2248, "requires": 2249, "26gb": 2250, "interconnect": 2251, "fly": 2252, "forward": 2253, "profiling": 2254, "shapes": 2255, "actual": 2256, "many": 2257, "assume": 2258, "v6e": 2259, "installed": 2260, "according": 2261, "google_tpu": 2262, "warmups": 2263, "enforce": 2264, "eager": 2265, "okay": 2266, "attempt": 2267, "operations": 2268, "xla_hlo_debug": 2269, "vllm_tpu_profile_duration_ms": 2270, "vllm_tpu_profile_delay_ms": 2271, "70b": 2272, "decodes": 2273, "having": 2274, "extremely": 2275, "small": 2276, "hopefully": 2277, "rm": 2278, "rf": 2279, "xla_cache": 2280, "visualizing": 2281, "collected": 2282, "visualize": 2283, "xla": 2284, "vm": 2285, "likely": 2286, "dependencies": 2287, "tensorflow": 2288, "plugin": 2289, "etils": 2290, "importlib_resources": 2291, "point": 2292, "localhost": 2293, "6006": 2294, "browser": 2295, "logdir": 2296, "omni": 2297, "thinker": 2298, "audio": 2299, "video": 2300, "qwen2_5_omni": 2301, "only_thinker": 2302, "mixed_modalities": 2303, "read": 2304, "interleaved": 2305, "modalities": 2306, "use_audio_in_video": 2307, "audios": 2308, "multi_audios": 2309, "modality": 2310, "audio_language": 2311, "vision_language": 2312, "prometheus": 2313, "grafana": 2314, "connect": 2315, "metric": 2316, "stack": 2317, "launch": 2318, "docker": 2319, "methods": 2320, "io": 2321, "websites": 2322, "compose": 2323, "linux": 2324, "entrypoint": 2325, "submit": 2326, "navigating": 2327, "8000": 2328, "metrics": 2329, "exposed": 2330, "username": 2331, "admin": 2332, "password": 2333, "connections": 2334, "datasources": 2335, "select": 2336, "page": 2337, "containers": 2338, "creates": 2339, "dns": 2340, "9090": 2341, "click": 2342, "green": 2343, "saying": 2344, "successfully": 2345, "queried": 2346, "datasource": 2347, "looks": 2348, "imgur": 2349, "r2vh9vw": 2350, "disagg_proxy_demo": 2351, "xpyd": 2352, "kv_events": 2353, "helm": 2354, "charts": 2355, "chart": 2356, "deploying": 2357, "application": 2358, "autoscaling": 2359, "resource": 2360, "defines": 2361, "metadata": 2362, "maintainers": 2363, "ct": 2364, "lintconf": 2365, "linting": 2366, "rules": 2367, "validating": 2368, "templates": 2369, "_helpers": 2370, "tpl": 2371, "defining": 2372, "configmap": 2373, "configmaps": 2374, "kubernetes": 2375, "deployments": 2376, "hpa": 2377, "horizontal": 2378, "pod": 2379, "autoscaler": 2380, "job": 2381, "jobs": 2382, "poddisruptionbudget": 2383, "pvc": 2384, "persistent": 2385, "volume": 2386, "claims": 2387, "secrets": 2388, "services": 2389, "opentelemetry": 2390, "poc": 2391, "packages": 2392, "exporter": 2393, "otlp": 2394, "semantic": 2395, "conventions": 2396, "jaeger": 2397, "jaegertracing": 2398, "collector_zipkin_host_port": 2399, "9411": 2400, "6831": 2401, "udp": 2402, "6832": 2403, "5778": 2404, "16686": 2405, "4317": 2406, "4318": 2407, "14250": 2408, "14268": 2409, "14269": 2410, "shell": 2411, "ip": 2412, "jaeger_ip": 2413, "inspect": 2414, "networksettings": 2415, "ipaddress": 2416, "otel_exporter_otlp_traces_endpoint": 2417, "grpc": 2418, "insecure": 2419, "otel_service_name": 2420, "otel_exporter_otlp_traces_insecure": 2421, "true": 2422, "facebook": 2423, "opt": 2424, "125m": 2425, "traces": 2426, "context": 2427, "dummy": 2428, "dummy_client": 2429, "webui": 2430, "pane": 2431, "gyhhfjo": 2432, "clicking": 2433, "spans": 2434, "tags": 2435, "demo": 2436, "containing": 2437, "opf6cbl": 2438, "protocol": 2439, "protobuf": 2440, "transport": 2441, "otel_exporter_otlp_traces_protocol": 2442, "instrumentation": 2443, "instrument": 2444, "hywvooj": 2445, "processing": 2446, "exceeds": 2447, "quick": 2448, "texts": 2449, "3m": 2450, "jinaai": 2451, "jina": 2452, "max_embed_len": 2453, "1048576": 2454, "multilingual": 2455, "3072000": 2456, "comprehensive": 2457, "startup": 2458, "override": 2459, "pooler": 2460, "pooling_type": 2461, "normalize": 2462, "enable_chunked_processing": 2463, "pooling": 2464, "chunk": 2465, "cross": 2466, "aggregation": 2467, "native": 2468, "component": 2469, "chunks": 2470, "always": 2471, "weighted": 2472, "averaging": 2473, "processed": 2474, "31090": 2475, "gpu_count": 2476, "cls": 2477, "last": 2478, "affects": 2479, "api_key": 2480, "empty": 2481, "authentication": 2482, "longer": 2483, "smart": 2484, "chunking": 2485, "max_position_embeddings": 2486, "maintain": 2487, "unified": 2488, "combined": 2489, "across": 2490, "dimensionality": 2491, "handling": 2492, "accepted": 2493, "rejected": 2494, "vllm_allow_long_max_model_len": 2495, "extreme": 2496, "academic": 2497, "papers": 2498, "references": 2499, "legal": 2500, "contracts": 2501, "books": 2502, "chapters": 2503, "repositories": 2504, "codebases": 2505, "aspect": 2506, "minimal": 2507, "proportional": 2508, "scalable": 2509, "quality": 2510, "normal": 2511, "baseline": 2512, "100k": 2513, "mixed": 2514, "consistency": 2515, "reproducible": 2516, "troubleshooting": 2517, "valueerror": 2518, "position": 2519, "solution": 2520, "reduce": 2521, "runtimeerror": 2522, "adjusting": 2523, "fewer": 2524, "slow": 2525, "expected": 2526, "calls": 2527, "activity": 2528, "150000": 2529, "max_chunk_size": 2530, "extend": 2531, "architecture": 2532, "lengths": 2533, "validate": 2534, "compared": 2535, "updates": 2536, "simplified": 2537, "millions": 2538, "better": 2539, "exceed": 2540, "limits": 2541, "backward": 2542, "continue": 2543, "capabilities": 2544, "responses": 2545, "concurrent": 2546, "3b": 2547, "reasoning": 2548, "r1": 2549, "distill": 2550, "deepseek_r1": 2551, "standalone": 2552, "uvx": 2553, "subdirectory": 2554, "online_serving": 2555, "structured_outputs": 2556, "tip": 2557, "remotely": 2558, "openai_base_url": 2559, "remote_url": 2560, "structural_tag": 2561, "descriptions": 2562, "8x7b": 2563, "evaluation": 2564, "latency_tests_markdown_table": 2565, "dynamically": 2566, "determined": 2567, "achieve": 2568, "throughput_tests_markdown_table": 2569, "arrival": 2570, "qps": 2571, "query": 2572, "means": 2573, "come": 2574, "poisson": 2575, "serving_tests_markdown_table": 2576, "platform_markdown_table": 2577, "tables": 2578, "markdown": 2579, "pandas": 2580, "dataframes": 2581, "pd": 2582, "benchmarking_results_json": 2583, "benchmarking_results": 2584, "loads": 2585, "latency_results": 2586, "dataframe": 2587, "from_dict": 2588, "throughput_results": 2589, "serving_results": 2590, "benchmarking_results_in_json_string": 2591, "artifact": 2592, "tab": 2593, "buildkite": 2594, "nightly": 2595, "aims": 2596, "tensorrt": 2597, "lmdeploy": 2598, "sglang": 2599, "leads": 2600, "workload": 2601, "exact": 2602, "commands": 2603, "reproducing": 2604, "instructions": 2605, "link": 2606, "perf": 2607, "scroll": 2608, "reproduction": 2609, "guilde": 2610, "8176": 2611, "lmsysorg": 2612, "cu121": 2613, "openmmlab": 2614, "cu12": 2615, "nvcr": 2616, "tritonserver": 2617, "trtllm": 2618, "py3": 2619, "r24": 2620, "going": 2621, "bump": 2622, "concrete": 2623, "specs": 2624, "8x": 2625, "a100": 2626, "heavy": 2627, "462": 2628, "trt": 2629, "2105": 2630, "queries": 2631, "sampled": 2632, "patterns": 2633, "higher": 2634, "lower": 2635, "known": 2636, "tgi": 2637, "eos": 2638, "annotation": 2639, "visualization": 2640, "deploy": 2641, "apt": 2642, "unzip": 2643, "vllm_source_code_loc": 2644, "suite": 2645, "introduction": 2646, "developers": 2647, "gain": 2648, "improves": 2649, "degrades": 2650, "alternatives": 2651, "know": 2652, "choose": 2653, "fix": 2654, "xeon": 2655, "processors": 2656, "1hr": 2657, "hr": 2658, "forever": 2659, "engines": 2660, "5hrs": 2661, "label": 2662, "ready": 2663, "manually": 2664, "runtime": 2665, "on_cpu": 2666, "serving_json": 2667, "latency_json": 2668, "throughput_json": 2669, "remote_host": 2670, "remote_port": 2671, "test_name": 2672, "latency_llama8b_tp1": 2673, "tensor_parallel_size": 2674, "load_format": 2675, "num_iters_warmup": 2676, "num_iters": 2677, "attributes": 2678, "unique": 2679, "latency_": 2680, "attribute": 2681, "underline": 2682, "dash": 2683, "specifying": 2684, "feeding": 2685, "iters": 2686, "warmup": 2687, "numbers": 2688, "sensitive": 2689, "syntax": 2690, "fed": 2691, "slight": 2692, "vary": 2693, "lot": 2694, "cover": 2695, "serving_llama8b_tp1_sharegpt": 2696, "qps_list": 2697, "server_parameters": 2698, "swap_space": 2699, "disable_log_stats": 2700, "client_parameters": 2701, "num_prompts": 2702, "serving_": 2703, "delay": 2704, "randomized": 2705, "still": 2706, "greatly": 2707, "related": 2708, "helps": 2709, "put": 2710, "formatting": 2711, "real": 2712, "presented": 2713, "wait": 2714, "till": 2715, "finish": 2716, "together": 2717, "attached": 2718, "artifacts": 2719, "converted": 2720, "benchmark_results": 2721, "compares": 2722, "tput": 2723, "passed": 2724, "pp": 2725, "result_a": 2726, "result_b": 2727, "lenght": 2728, "results_a": 2729, "results_b": 2730, "perf_ratio": 2731, "142": 2732, "633982": 2733, "156": 2734, "526018": 2735, "097396": 2736, "241": 2737, "620334": 2738, "294": 2739, "018783": 2740, "216863": 2741, "diagram": 2742, "96c": 2743, "results_gnr_96c_091_tp2pp3": 2744, "128c": 2745, "results_gnr_128c_091_tp2pp3": 2746, "1886": 2747, "height": 2748, "828": 2749, "attachments": 2750, "c02a43ef": 2751, "25d0": 2752, "4fd6": 2753, "90e5": 2754, "2169a28682dd": 2755, "probe": 2756, "parse": 2757, "described": 2758, "collect": 2759, "plot": 2760, "hard": 2761, "coded": 2762, "populating": 2763, "updating": 2764, "neuralmagic": 2765, "fill": 2766, "ensuring": 2767, "checklist": 2768, "bottom": 2769, "been": 2770, "essential": 2771, "elements": 2772, "effective": 2773, "pasting": 2774, "submitting": 2775, "anything": 2776, "removed": 2777, "machete": 2778, "precision": 2779, "spiritual": 2780, "successor": 2781, "marlin": 2782, "architectures": 2783, "pairs": 2784, "epilogues": 2785, "easier": 2786, "scale_type": 2787, "w_s": 2788, "compute_type": 2789, "w_q": 2790, "w_z": 2791, "matrix": 2792, "scales": 2793, "zeropoints": 2794, "fma": 2795, "applied": 2796, "supplied": 2797, "subtracted": 2798, "optimization": 2799, "prepacking": 2800, "closely": 2801, "match": 2802, "core": 2803, "layouts": 2804, "allowing": 2805, "wider": 2806, "shared": 2807, "prepacked": 2808, "machete_gemm": 2809, "flow": 2810, "something": 2811, "_custom_ops": 2812, "ops": 2813, "w_q_packed": 2814, "machete_prepack_b": 2815, "wtype": 2816, "b_q": 2817, "b_type": 2818, "b_scales": 2819, "b_group_size": 2820, "group_size": 2821, "instantiations": 2822, "typeconfig": 2823, "appended": 2824, "impl_configs": 2825, "implconfig": 2826, "bundles": 2827, "scheduleconfig": 2828, "specialization": 2829, "heuristic": 2830, "scheduler": 2831, "differently": 2832, "problem": 2833, "almost": 2834, "never": 2835, "beneficial": 2836, "comes": 2837, "maps": 2838, "schedule": 2839, "define": 2840, "combinations": 2841, "with_zeropoints": 2842, "with_scales": 2843, "compile": 2844, "times": 2845, "limiting": 2846, "describes": 2847, "implemented": 2848, "fusing": 2849, "de": 2850, "onto": 2851, "symmetric": 2852, "asymmetric": 2853, "activations": 2854, "scaledepilogue": 2855, "bias": 2856, "scaledepiloguebias": 2857, "scaledepilogueazp": 2858, "scaledepilogueazppertoken": 2859, "epilogue": 2860, "induces": 2861, "redundant": 2862, "addition": 2863, "operation": 2864, "underlying": 2865, "algebra": 2866, "activation": 2867, "rfc": 2868, "3975": 2869, "widehat": 2870, "matrices": 2871, "math": 2872, "s_a": 2873, "j_a": 2874, "z_a": 2875, "s_b": 2876, "respectively": 2877, "ones": 2878, "dimensions": 2879, "expanding": 2880, "further": 2881, "calculate": 2882, "ahead": 2883, "equal": 2884, "mathbf": 2885, "vector": 2886, "column": 2887, "sums": 2888, "computes": 2889, "meaning": 2890, "scale_a": 2891, "scalar": 2892, "scale_b": 2893, "because": 2894, "term": 2895, "precomputed": 2896, "stored": 2897, "azp_with_adj": 2898, "points": 2899, "efficiently": 2900, "precompute": 2901, "becomes": 2902, "outer": 2903, "product": 2904, "azp_adj": 2905, "adjustment": 2906, "azp": 2907, "computation": 2908, "dq": 2909, "hide": 2910, "navigation": 2911, "toc": 2912, "figure": 2913, "span": 2914, "buttons": 2915, "js": 2916, "button": 2917, "aria": 2918, "star": 2919, "subscription": 2920, "icon": 2921, "octicon": 2922, "eye": 2923, "watch": 2924, "fork": 2925, "forked": 2926, "depends": 