{"vllm": 0, "code": 1, "conduct": 2, "our": 3, "pledge": 4, "we": 5, "members": 6, "contributors": 7, "leaders": 8, "make": 9, "participation": 10, "community": 11, "harassment": 12, "free": 13, "experience": 14, "everyone": 15, "regardless": 16, "age": 17, "body": 18, "size": 19, "visible": 20, "invisible": 21, "disability": 22, "ethnicity": 23, "sex": 24, "characteristics": 25, "gender": 26, "identity": 27, "expression": 28, "level": 29, "education": 30, "socioeconomic": 31, "status": 32, "nationality": 33, "personal": 34, "appearance": 35, "race": 36, "caste": 37, "color": 38, "religion": 39, "sexual": 40, "orientation": 41, "act": 42, "interact": 43, "ways": 44, "contribute": 45, "open": 46, "welcoming": 47, "diverse": 48, "inclusive": 49, "healthy": 50, "standards": 51, "examples": 52, "behavior": 53, "contributes": 54, "positive": 55, "environment": 56, "include": 57, "demonstrating": 58, "empathy": 59, "kindness": 60, "toward": 61, "other": 62, "people": 63, "being": 64, "respectful": 65, "differing": 66, "opinions": 67, "viewpoints": 68, "experiences": 69, "giving": 70, "gracefully": 71, "accepting": 72, "constructive": 73, "feedback": 74, "responsibility": 75, "apologizing": 76, "those": 77, "affected": 78, "mistakes": 79, "learning": 80, "from": 81, "focusing": 82, "what": 83, "best": 84, "just": 85, "us": 86, "individuals": 87, "overall": 88, "unacceptable": 89, "use": 90, "sexualized": 91, "language": 92, "imagery": 93, "attention": 94, "advances": 95, "any": 96, "kind": 97, "trolling": 98, "insulting": 99, "derogatory": 100, "comments": 101, "political": 102, "attacks": 103, "public": 104, "private": 105, "publishing": 106, "others": 107, "information": 108, "physical": 109, "email": 110, "address": 111, "without": 112, "explicit": 113, "permission": 114, "which": 115, "could": 116, "reasonably": 117, "considered": 118, "inappropriate": 119, "professional": 120, "setting": 121, "enforcement": 122, "responsibilities": 123, "responsible": 124, "clarifying": 125, "enforcing": 126, "acceptable": 127, "take": 128, "appropriate": 129, "fair": 130, "corrective": 131, "action": 132, "response": 133, "deem": 134, "threatening": 135, "offensive": 136, "harmful": 137, "have": 138, "right": 139, "remove": 140, "edit": 141, "reject": 142, "commits": 143, "wiki": 144, "edits": 145, "issues": 146, "contributions": 147, "aligned": 148, "communicate": 149, "reasons": 150, "moderation": 151, "decisions": 152, "when": 153, "scope": 154, "applies": 155, "within": 156, "all": 157, "spaces": 158, "also": 159, "individual": 160, "officially": 161, "representing": 162, "using": 163, "official": 164, "posting": 165, "via": 166, "social": 167, "media": 168, "account": 169, "acting": 170, "appointed": 171, "representative": 172, "online": 173, "offline": 174, "irl": 175, "event": 176, "instances": 177, "abusive": 178, "harassing": 179, "otherwise": 180, "may": 181, "reported": 182, "channel": 183, "slack": 184, "https": 185, "ai": 186, "complaints": 187, "reviewed": 188, "investigated": 189, "promptly": 190, "fairly": 191, "obligated": 192, "respect": 193, "privacy": 194, "security": 195, "reporter": 196, "incident": 197, "guidelines": 198, "follow": 199, "impact": 200, "determining": 201, "consequences": 202, "violation": 203, "correction": 204, "deemed": 205, "unprofessional": 206, "unwelcome": 207, "consequence": 208, "written": 209, "warning": 210, "providing": 211, "clarity": 212, "around": 213, "nature": 214, "explanation": 215, "why": 216, "apology": 217, "requested": 218, "through": 219, "single": 220, "series": 221, "actions": 222, "continued": 223, "interaction": 224, "involved": 225, "including": 226, "unsolicited": 227, "specified": 228, "period": 229, "time": 230, "includes": 231, "avoiding": 232, "interactions": 233, "well": 234, "external": 235, "channels": 236, "like": 237, "violating": 238, "terms": 239, "lead": 240, "temporary": 241, "permanent": 242, "ban": 243, "serious": 244, "sustained": 245, "sort": 246, "communication": 247, "allowed": 248, "during": 249, "pattern": 250, "aggression": 251, "disparagement": 252, "classes": 253, "attribution": 254, "adapted": 255, "contributor": 256, "covenant": 257, "www": 258, "org": 259, "version": 260, "available": 261, "v2": 262, "code_of_conduct": 263, "html": 264, "were": 265, "inspired": 266, "mozilla": 267, "ladder": 268, "github": 269, "com": 270, "inclusion": 271, "answers": 272, "common": 273, "questions": 274, "about": 275, "see": 276, "faq": 277, "translations": 278, "contributing": 279, "you": 280, "find": 281, "docs": 282, "en": 283, "latest": 284, "markdownlint": 285, "disable": 286, "md001": 287, "md041": 288, "align": 289, "center": 290, "picture": 291, "source": 292, "prefers": 293, "scheme": 294, "dark": 295, "srcset": 296, "raw": 297, "githubusercontent": 298, "project": 299, "main": 300, "assets": 301, "logos": 302, "logo": 303, "text": 304, "png": 305, "img": 306, "alt": 307, "src": 308, "light": 309, "width": 310, "55": 311, "h3": 312, "easy": 313, "fast": 314, "cheap": 315, "llm": 316, "serving": 317, "href": 318, "documentation": 319, "blog": 320, "arxiv": 321, "abs": 322, "2309": 323, "06180": 324, "paper": 325, "vllm_project": 326, "twitter": 327, "discuss": 328, "user": 329, "forum": 330, "developer": 331, "news": 332, "2025": 333, "08": 334, "hosted": 335, "beijing": 336, "meetup": 337, "mp": 338, "weixin": 339, "qq": 340, "dgkwg1wfpwgo2jcdtqqhxa": 341, "large": 342, "scale": 343, "deployment": 344, "please": 345, "slides": 346, "here": 347, "drive": 348, "google": 349, "folders": 350, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 351, "recording": 352, "chaspark": 353, "live": 354, "1166916873711665152": 355, "05": 356, "nyc": 357, "lu": 358, "ma": 359, "c1rqyf1f": 360, "presentation": 361, "1_q_aw_iomjwuimf1s1ym": 362, "zhjxz8cuel0ijvaquoybea": 363, "usp": 364, "sharing": 365, "now": 366, "under": 367, "pytorch": 368, "foundation": 369, "announcement": 370, "welcomes": 371, "01": 372, "excited": 373, "announce": 374, "alpha": 375, "release": 376, "v1": 377, "major": 378, "architectural": 379, "upgrade": 380, "7x": 381, "speedup": 382, "clean": 383, "optimized": 384, "execution": 385, "loop": 386, "zero": 387, "overhead": 388, "prefix": 389, "caching": 390, "enhanced": 391, "multimodal": 392, "support": 393, "more": 394, "check": 395, "out": 396, "post": 397, "27": 398, "details": 399, "summary": 400, "previous": 401, "04": 402, "asia": 403, "day": 404, "sginnovate": 405, "limited": 406, "availability": 407, "morning": 408, "evening": 409, "slots": 410, "remaining": 411, "inaugural": 412, "team": 413, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 414, "03": 415, "ollama": 416, "inference": 417, "night": 418, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 419, "first": 420, "china": 421, "n77gibl2coratqhtveazfg": 422, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 423, "east": 424, "coast": 425, "7mu4k4xx": 426, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 427, "slide": 428, "id": 429, "g31441846c39_0_0": 430, "02": 431, "ninth": 432, "h7g3kuj9": 433, "meta": 434, "1jzc_pzvxrvnsfvcw": 435, "v4cfxb6pn7zz2cyp_flwo05aqg": 436, "amd": 437, "file": 438, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 439, "view": 440, "posted": 441, "eighth": 442, "zep56hui": 443, "cloud": 444, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 445, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 446, "2024": 447, "12": 448, "joins": 449, "ecosystem": 450, "11": 451, "seventh": 452, "h0qvrajz": 453, "snowflake": 454, "1e3cxqbv3jsfgp30swyvs3em_tw": 455, "ghohj9pajgk6kr54": 456, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 457, "10": 458, "created": 459, "coordinating": 460, "discussing": 461, "features": 462, "feel": 463, "join": 464, "ray": 465, "summit": 466, "held": 467, "special": 468, "track": 469, "opening": 470, "talk": 471, "1b_kqxphbtra_mdf": 472, "tr6i8rwdou5qotznceg2mkzxehm": 473, "learn": 474, "talks": 475, "youtube": 476, "playlist": 477, "list": 478, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 479, "users": 480, "09": 481, "sixth": 482, "87q3nvnh": 483, "nvidia": 484, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 485, "9wqyp7ny93xrs": 486, "07": 487, "fifth": 488, "lp0gyjqr": 489, "aws": 490, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 491, "partnership": 492, "supports": 493, "llama": 494, "fp8": 495, "quantization": 496, "pipeline": 497, "parallelism": 498, "23": 499, "llama31": 500, "06": 501, "fourth": 502, "agivllm": 503, "cloudflare": 504, "bentoml": 505, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 506, "third": 507, "robloxandvllmmeetup2024": 508, "splashthat": 509, "roblox": 510, "1a": 511, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 512, "second": 513, "ygxbpzhl": 514, "ibm": 515, "12mi2skabnuw5rbwxdyy": 516, "hthth4imsnceoq10jdqbxga": 517, "2023": 518, "a16z": 519, "1ql": 520, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 521, "would": 522, "express": 523, "sincere": 524, "gratitude": 525, "andreessen": 526, "horowitz": 527, "30": 528, "supporting": 529, "generous": 530, "grant": 531, "development": 532, "research": 533, "released": 534, "fastchat": 535, "integration": 536, "has": 537, "powered": 538, "lmsys": 539, "vicuna": 540, "chatbot": 541, "arena": 542, "chat": 543, "since": 544, "mid": 545, "april": 546, "library": 547, "originally": 548, "developed": 549, "sky": 550, "computing": 551, "lab": 552, "cs": 553, "berkeley": 554, "edu": 555, "uc": 556, "evolved": 557, "driven": 558, "both": 559, "academia": 560, "industry": 561, "state": 562, "art": 563, "throughput": 564, "efficient": 565, "management": 566, "key": 567, "value": 568, "memory": 569, "pagedattention": 570, "20": 571, "continuous": 572, "batching": 573, "incoming": 574, "requests": 575, "model": 576, "cuda": 577, "hip": 578, "graph": 579, "quantizations": 580, "gptq": 581, "2210": 582, "17323": 583, "awq": 584, "2306": 585, "00978": 586, "autoround": 587, "05516": 588, "int4": 589, "int8": 590, "kernels": 591, "flashattention": 592, "flashinfer": 593, "speculative": 594, "decoding": 595, "chunked": 596, "prefill": 597, "flexible": 598, "seamless": 599, "popular": 600, "hugging": 601, "face": 602, "models": 603, "high": 604, "various": 605, "algorithms": 606, "parallel": 607, "sampling": 608, "beam": 609, "search": 610, "tensor": 611, "data": 612, "expert": 613, "distributed": 614, "streaming": 615, "outputs": 616, "openai": 617, "compatible": 618, "api": 619, "server": 620, "gpus": 621, "cpus": 622, "intel": 623, "powerpc": 624, "tpu": 625, "neuron": 626, "multi": 627, "lora": 628, "seamlessly": 629, "most": 630, "huggingface": 631, "transformer": 632, "llms": 633, "mixture": 634, "mixtral": 635, "deepseek": 636, "v3": 637, "embedding": 638, "e5": 639, "mistral": 640, "modal": 641, "llava": 642, "full": 643, "supported": 644, "supported_models": 645, "getting": 646, "started": 647, "install": 648, "pip": 649, "getting_started": 650, "installation": 651, "gpu": 652, "index": 653, "build": 654, "wheel": 655, "bash": 656, "visit": 657, "quickstart": 658, "welcome": 659, "collaborations": 660, "how": 661, "get": 662, "sponsors": 663, "compute": 664, "resources": 665, "testing": 666, "following": 667, "organizations": 668, "thank": 669, "your": 670, "note": 671, "them": 672, "alphabetical": 673, "order": 674, "keep": 675, "consistent": 676, "md": 677, "cash": 678, "donations": 679, "dropbox": 680, "sequoia": 681, "capital": 682, "skywork": 683, "zhenfund": 684, "alibaba": 685, "anyscale": 686, "crusoe": 687, "databricks": 688, "deepinfra": 689, "lambda": 690, "nebius": 691, "novita": 692, "replicate": 693, "runpod": 694, "trainy": 695, "san": 696, "diego": 697, "sponsor": 698, "fundraising": 699, "venue": 700, "opencollective": 701, "plan": 702, "fund": 703, "maintenance": 704, "adoption": 705, "citation": 706, "cite": 707, "bibtex": 708, "inproceedings": 709, "kwon2023efficient": 710, "title": 711, "author": 712, "woosuk": 713, "kwon": 714, "zhuohan": 715, "li": 716, "siyuan": 717, "zhuang": 718, "ying": 719, "sheng": 720, "lianmin": 721, "zheng": 722, "cody": 723, "hao": 724, "yu": 725, "joseph": 726, "gonzalez": 727, "zhang": 728, "ion": 729, "stoica": 730, "booktitle": 731, "proceedings": 732, "acm": 733, "sigops": 734, "29th": 735, "symposium": 736, "operating": 737, "systems": 738, "principles": 739, "year": 740, "contact": 741, "start": 742, "technical": 743, "feature": 744, "fellow": 745, "disclosures": 746, "advisories": 747, "partnerships": 748, "lists": 749, "mailto": 750, "end": 751, "kit": 752, "wish": 753, "refer": 754, "repo": 755, "releasing": 756, "releases": 757, "offer": 758, "reliable": 759, "base": 760, "packaged": 761, "binary": 762, "format": 763, "can": 764, "conveniently": 765, "accessed": 766, "pypi": 767, "serve": 768, "milestones": 769, "newly": 770, "improvements": 771, "upcoming": 772, "changes": 773, "affect": 774, "potential": 775, "breaking": 776, "versioning": 777, "uses": 778, "shifted": 779, "where": 780, "new": 781, "patch": 782, "every": 783, "weeks": 784, "contain": 785, "bug": 786, "fixes": 787, "opposed": 788, "semver": 789, "contains": 790, "only": 791, "backwards": 792, "critical": 793, "need": 794, "made": 795, "post1": 796, "_major_": 797, "milestone": 798, "incompatible": 799, "similar": 800, "_minor_": 801, "_patch_": 802, "_post1_": 803, "_patch": 804, "1_": 805, "either": 806, "implicit": 807, "cadence": 808, "bi": 809, "weekly": 810, "basis": 811, "days": 812, "after": 813, "same": 814, "branch": 815, "future": 816, "dates": 817, "below": 818, "tentative": 819, "optional": 820, "date": 821, "versions": 822, "jan": 823, "feb": 824, "mar": 825, "apr": 826, "jun": 827, "jul": 828, "13": 829, "aug": 830, "14": 831, "15": 832, "sep": 833, "16": 834, "17": 835, "oct": 836, "18": 837, "19": 838, "nov": 839, "21": 840, "dec": 841, "22": 842, "each": 843, "built": 844, "dedicated": 845, "cut": 846, "performed": 847, "before": 848, "previously": 849, "reused": 850, "builds": 851, "triggered": 852, "push": 853, "rc": 854, "tag": 855, "vx": 856, "rc1": 857, "enables": 858, "test": 859, "multiple": 860, "rcs": 861, "final": 862, "does": 863, "trigger": 864, "used": 865, "notes": 866, "monitor": 867, "reverts": 868, "apply": 869, "cherry": 870, "pick": 871, "criteria": 872, "approach": 873, "finalizing": 874, "clear": 875, "picks": 876, "process": 877, "land": 878, "pr": 879, "typically": 880, "ensure": 881, "sufficient": 882, "complete": 883, "thorough": 884, "round": 885, "stable": 886, "regression": 887, "functional": 888, "performance": 889, "against": 890, "recent": 891, "severe": 892, "issue": 893, "silent": 894, "incorrectness": 895, "compatibility": 896, "crashes": 897, "deadlocks": 898, "leaks": 899, "introduced": 900, "specific": 901, "change": 902, "identifiers": 903, "ci": 904, "work": 905, "prs": 906, "merged": 907, "trunk": 908, "exception": 909, "manual": 910, "validations": 911, "e2e": 912, "validation": 913, "perform": 914, "regressions": 915, "benchmark": 916, "workflow": 917, "workflows": 918, "yml": 919, "current": 920, "coverage": 921, "llama3": 922, "llama4": 923, "hardware": 924, "h100": 925, "mi300x": 926, "_note": 927, "based": 928, "availability_": 929, "step": 930, "access": 931, "request": 932, "write": 933, "repository": 934, "run": 935, "review": 936, "setup": 937, "familiarize": 938, "yourself": 939, "configurations": 940, "tree": 941, "benchmarks": 942, "rocm": 943, "navigate": 944, "configure": 945, "set": 946, "v0": 947, "commit": 948, "hash": 949, "results": 950, "once": 951, "completes": 952, "dashboard": 953, "hud": 954, "reponame": 955, "2fvllm": 956, "corresponding": 957, "comparison": 958, "compare": 959, "verify": 960, "occurred": 961, "example": 962, "vs": 963, "starttime": 964, "thu": 965, "2c": 966, "2017": 967, "20apr": 968, "202025": 969, "2021": 970, "3a43": 971, "3a50": 972, "20gmt": 973, "stoptime": 974, "wed": 975, "2016": 976, "20jul": 977, "granularity": 978, "week": 979, "lbranch": 980, "lcommit": 981, "b6553be1bc75f046b00046a4ad7576364d03c835": 982, "rbranch": 983, "rcommit": 984, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 985, "benchmarkname": 986, "modelname": 987, "20models": 988, "backendname": 989, "20backends": 990, "modename": 991, "20modes": 992, "dtypename": 993, "20dtype": 994, "devicename": 995, "20devices": 996, "archname": 997, "20platforms": 998, "policy": 999, "reporting": 1000, "report": 1001, "privately": 1002, "vulnerability": 1003, "submission": 1004, "form": 1005, "triage": 1006, "reports": 1007, "triaged": 1008, "vulnerability_management": 1009, "threat": 1010, "guide": 1011, "usage": 1012, "assumptions": 1013, "recommendations": 1014, "blob": 1015, "securely": 1016, "severity": 1017, "determine": 1018, "risk": 1019, "taking": 1020, "dealing": 1021, "past": 1022, "defaults": 1023, "cases": 1024, "categories": 1025, "vulnerabilities": 1026, "allow": 1027, "remote": 1028, "attackers": 1029, "execute": 1030, "arbitrary": 1031, "control": 1032, "system": 1033, "significantly": 1034, "compromise": 1035, "confidentiality": 1036, "integrity": 1037, "privileges": 1038, "needed": 1039, "network": 1040, "deserialization": 1041, "exploit": 1042, "chains": 1043, "generally": 1044, "rated": 1045, "cvss": 1046, "flaws": 1047, "elevated": 1048, "rce": 1049, "contexts": 1050, "significant": 1051, "loss": 1052, "require": 1053, "advanced": 1054, "conditions": 1055, "some": 1056, "trust": 1057, "modes": 1058, "node": 1059, "privileged": 1060, "required": 1061, "scores": 1062, "between": 1063, "moderate": 1064, "cause": 1065, "denial": 1066, "service": 1067, "partial": 1068, "disruption": 1069, "do": 1070, "breach": 1071, "rating": 1072, "low": 1073, "minor": 1074, "informational": 1075, "logging": 1076, "errors": 1077, "non": 1078, "exploitable": 1079, "weaknesses": 1080, "local": 1081, "privilege": 1082, "negligible": 1083, "side": 1084, "collisions": 1085, "often": 1086, "less": 1087, "than": 1088, "prenotification": 1089, "certain": 1090, "prenotify": 1091, "vendors": 1092, "ship": 1093, "purpose": 1094, "coordinated": 1095, "notification": 1096, "adding": 1097, "contacts": 1098, "advisory": 1099, "few": 1100, "added": 1101, "group": 1102, "send": 1103, "copying": 1104, "vendor": 1105, "analyzed": 1106, "case": 1107, "withdraw": 1108, "receiving": 1109, "prenotifications": 1110, "membership": 1111, "refinements": 1112, "who": 1113, "included": 1114, "fill": 1115, "description": 1116, "ensuring": 1117, "checklist": 1118, "items": 1119, "bottom": 1120, "been": 1121, "result": 1122, "update": 1123, "essential": 1124, "elements": 1125, "effective": 1126, "fix": 1127, "link": 1128, "existing": 1129, "resolve": 1130, "command": 1131, "pasting": 1132, "necessary": 1133, "updating": 1134, "submitting": 1135, "read": 1136, "anything": 1137, "line": 1138, "removed": 1139, "configuration": 1140, "leverages": 1141, "python": 1142, "config": 1143, "dictconfig": 1144, "functionality": 1145, "enable": 1146, "robust": 1147, "loggers": 1148, "offers": 1149, "two": 1150, "variables": 1151, "accommodate": 1152, "range": 1153, "simple": 1154, "inflexible": 1155, "complex": 1156, "vllm_configure_logging": 1157, "leaving": 1158, "vllm_logging_config_path": 1159, "unset": 1160, "default": 1161, "leave": 1162, "fine": 1163, "grained": 1164, "custom": 1165, "path": 1166, "json": 1167, "controls": 1168, "whether": 1169, "takes": 1170, "enabled": 1171, "disabled": 1172, "running": 1173, "given": 1174, "root": 1175, "logger": 1176, "configured": 1177, "defer": 1178, "error": 1179, "occur": 1180, "while": 1181, "starting": 1182, "allows": 1183, "specify": 1184, "alternative": 1185, "instead": 1186, "should": 1187, "provided": 1188, "schema": 1189, "dictionary": 1190, "customize": 1191, "nhairs": 1192, "part": 1193, "container": 1194, "image": 1195, "log": 1196, "stdout": 1197, "console": 1198, "info": 1199, "begin": 1200, "create": 1201, "logging_config": 1202, "formatters": 1203, "class": 1204, "pythonjsonlogger": 1205, "jsonlogger": 1206, "jsonformatter": 1207, "handlers": 1208, "streamhandler": 1209, "formatter": 1210, "stream": 1211, "ext": 1212, "sys": 1213, "propagate": 1214, "false": 1215, "finally": 1216, "variable": 1217, "mistralai": 1218, "7b": 1219, "max": 1220, "len": 1221, "2048": 1222, "silence": 1223, "particular": 1224, "provide": 1225, "target": 1226, "configures": 1227, "so": 1228, "won": 1229, "its": 1230, "messages": 1231, "overrides": 1232, "logging_utils": 1233, "newlineformatter": 1234, "datefmt": 1235, "levelname": 1236, "asctime": 1237, "filename": 1238, "lineno": 1239, "message": 1240, "debug": 1241, "example_noisy_logger": 1242, "prevent": 1243, "configuring": 1244, "turn": 1245, "silences": 1246, "additional": 1247, "lmcache": 1248, "folder": 1249, "demonstrates": 1250, "disaggregated": 1251, "prefilling": 1252, "cpu": 1253, "offloading": 1254, "kv": 1255, "cache": 1256, "nixl": 1257, "prerequisites": 1258, "simply": 1259, "dynamo": 1260, "least": 1261, "valid": 1262, "token": 1263, "hf_token": 1264, "8b": 1265, "instruct": 1266, "cd": 1267, "disagg_prefill_lmcache_v1": 1268, "disagg_example_nixl": 1269, "sh": 1270, "components": 1271, "scripts": 1272, "disagg_vllm_launcher": 1273, "launches": 1274, "servers": 1275, "decode": 1276, "proxy": 1277, "disagg_proxy_server": 1278, "py": 1279, "fastapi": 1280, "coordinates": 1281, "prefiller": 1282, "decoder": 1283, "script": 1284, "configs": 1285, "yaml": 1286, "files": 1287, "generates": 1288, "several": 1289, "logs": 1290, "offload": 1291, "cpu_offload_lmcache": 1292, "implementation": 1293, "kv_cache_sharing_lmcache_v1": 1294, "share": 1295, "caches": 1296, "disaggregated_prefill_lmcache_v0": 1297, "provides": 1298, "basic": 1299, "primary": 1300, "interface": 1301, "doing": 1302, "interacting": 1303, "separate": 1304, "shows": 1305, "offline_inference": 1306, "rest": 1307, "argument": 1308, "parser": 1309, "argparse": 1310, "pass": 1311, "arguments": 1312, "try": 1313, "help": 1314, "classify": 1315, "embed": 1316, "score": 1317, "generate": 1318, "accept": 1319, "parameters": 1320, "inference_params": 1321, "max_tokens": 1322, "temperature": 1323, "top_p": 1324, "top_k": 1325, "passing": 1326, "experiment": 1327, "generation": 1328, "specifies": 1329, "loaded": 1330, "calling": 1331, "get_default_sampling_params": 1332, "auto": 1333, "max_new_tokens": 1334, "sets": 1335, "wide": 1336, "limit": 1337, "number": 1338, "output": 1339, "tokens": 1340, "gguf": 1341, "quantized": 1342, "one": 1343, "downloading": 1344, "huggingface_hub": 1345, "import": 1346, "hf_hub_download": 1347, "repo_id": 1348, "bartowski": 1349, "phi": 1350, "medium": 1351, "4k": 1352, "iq2_m": 1353, "print": 1354, "printed": 1355, "above": 1356, "tokenizer": 1357, "microsoft": 1358, "gb": 1359, "seen": 1360, "virtual": 1361, "way": 1362, "increase": 1363, "24": 1364, "virtually": 1365, "think": 1366, "34": 1367, "load": 1368, "13b": 1369, "bf16": 1370, "weight": 1371, "requires": 1372, "26gb": 1373, "interconnect": 1374, "fly": 1375, "forward": 1376, "hf": 1377, "qwen2": 1378, "omni": 1379, "thinker": 1380, "audio": 1381, "video": 1382, "qwen2_5_omni": 1383, "only_thinker": 1384, "mixed_modalities": 1385, "vision": 1386, "inputs": 1387, "engine": 1388, "interleaved": 1389, "modalities": 1390, "yet": 1391, "vllm_use_v1": 1392, "use_audio_in_video": 1393, "audios": 1394, "multi_audios": 1395, "modality": 1396, "audio_language": 1397, "type": 1398, "vision_language": 1399, "profiling": 1400, "profile": 1401, "shapes": 1402, "actual": 1403, "mix": 1404, "many": 1405, "assume": 1406, "already": 1407, "tested": 1408, "v6e": 1409, "installed": 1410, "according": 1411, "google_tpu": 1412, "warmups": 1413, "enforce": 1414, "eager": 1415, "okay": 1416, "trace": 1417, "runs": 1418, "qwen": 1419, "1024": 1420, "input": 1421, "up": 1422, "attempt": 1423, "operations": 1424, "export": 1425, "xla_hlo_debug": 1426, "vllm_tpu_profile_duration_ms": 1427, "3000": 1428, "vllm_tpu_profile_delay_ms": 1429, "python3": 1430, "batch": 1431, "dir": 1432, "profiles": 1433, "70b": 1434, "32": 1435, "128": 1436, "decodes": 1437, "having": 1438, "extremely": 1439, "small": 1440, "1000": 1441, "skip": 1442, "hopefully": 1443, "2000": 1444, "rm": 1445, "rf": 1446, "xla_cache": 1447, "visualizing": 1448, "collected": 1449, "visualize": 1450, "tensorboard": 1451, "xla": 1452, "vm": 1453, "likely": 1454, "dependencies": 1455, "tensorflow": 1456, "plugin": 1457, "etils": 1458, "importlib_resources": 1459, "point": 1460, "directory": 1461, "saved": 1462, "http": 1463, "localhost": 1464, "6006": 1465, "browser": 1466, "logdir": 1467, "port": 1468, "important": 1469, "performing": 1470, "consists": 1471, "objects": 1472, "lines": 1473, "openai_batch": 1474, "openai_example_batch": 1475, "jsonl": 1476, "represents": 1477, "package": 1478, "reference": 1479, "platform": 1480, "requestinput": 1481, "currently": 1482, "completions": 1483, "embeddings": 1484, "endpoints": 1485, "coming": 1486, "soon": 1487, "pre": 1488, "requisites": 1489, "document": 1490, "co": 1491, "hub": 1492, "machine": 1493, "cli": 1494, "login": 1495, "gated": 1496, "visiting": 1497, "card": 1498, "agreeing": 1499, "along": 1500, "download": 1501, "own": 1502, "working": 1503, "wget": 1504, "ve": 1505, "look": 1506, "cat": 1507, "custom_id": 1508, "method": 1509, "url": 1510, "role": 1511, "content": 1512, "helpful": 1513, "assistant": 1514, "hello": 1515, "world": 1516, "max_completion_tokens": 1517, "unhelpful": 1518, "tool": 1519, "designed": 1520, "called": 1521, "entrypoints": 1522, "run_batch": 1523, "383d1c59835645aeb2e07d004d62a826": 1524, "cmpl": 1525, "61c020e54b964d5a98fa7527bfcdd378": 1526, "object": 1527, "completion": 1528, "1715633336": 1529, "choices": 1530, "great": 1531, "meet": 1532, "tasks": 1533, "mind": 1534, "today": 1535, "logprobs": 1536, "null": 1537, "finish_reason": 1538, "stop": 1539, "stop_reason": 1540, "prompt_tokens": 1541, "25": 1542, "total_tokens": 1543, "56": 1544, "completion_tokens": 1545, "31": 1546, "42e3d09b14b04568afa3f1797751a267": 1547, "f44d049f6b3a42d4b2d7850bb1e31bcc": 1548, "runner": 1549, "urls": 1550, "accessible": 1551, "located": 1552, "integrating": 1553, "s3": 1554, "integrate": 1555, "storage": 1556, "recommend": 1557, "presigned": 1558, "bucket": 1559, "amazon": 1560, "amazons3": 1561, "userguide": 1562, "creating": 1563, "awscli": 1564, "credentials": 1565, "interactively": 1566, "boto3": 1567, "upload": 1568, "cp": 1569, "my_bucket": 1570, "my_input_file": 1571, "generated": 1572, "sdk": 1573, "sure": 1574, "replace": 1575, "my_output_file": 1576, "placeholders": 1577, "names": 1578, "awsdocs": 1579, "doc": 1580, "example_code": 1581, "s3_basics": 1582, "presigned_url": 1583, "botocore": 1584, "exceptions": 1585, "clienterror": 1586, "def": 1587, "generate_presigned_url": 1588, "s3_client": 1589, "client_method": 1590, "method_parameters": 1591, "expires_in": 1592, "param": 1593, "client": 1594, "name": 1595, "performs": 1596, "seconds": 1597, "return": 1598, "clientmethod": 1599, "params": 1600, "expiresin": 1601, "except": 1602, "raise": 1603, "input_url": 1604, "get_object": 1605, "3600": 1606, "output_url": 1607, "put_object": 1608, "west": 1609, "amazonaws": 1610, "awsaccesskeyid": 1611, "abcdefghijklmnopqrst": 1612, "signature": 1613, "abcdefghijklmnopqrstuvwxyz12345": 1614, "expires": 1615, "1715800091": 1616, "section": 1617, "terminal": 1618, "endpoint": 1619, "add": 1620, "intfloat": 1621, "even": 1622, "long": 1623, "must": 1624, "earlier": 1625, "db0f71f7dec244e6bce530e0b4ef908b": 1626, "status_code": 1627, "200": 1628, "request_id": 1629, "3580bf4d4ae54d52b67eee266a6eab20": 1630, "embd": 1631, "33ac2efa7996430184461f2e38529746": 1632, "444647": 1633, "016204833984375": 1634, "0092010498046875": 1635, "0018358230590820312": 1636, "0028228759765625": 1637, "001422882080078125": 1638, "0031147003173828125": 1639, "baai": 1640, "bge": 1641, "reranker": 1642, "m3": 1643, "text_1": 1644, "france": 1645, "text_2": 1646, "brazil": 1647, "brasilia": 1648, "paris": 1649, "f87c5c4539184f618e555744a2965987": 1650, "806ab64512e44071b37d3f7ccd291413": 1651, "4ee45236897b4d29907d49b01298cdb1": 1652, "1737847944": 1653, "0010900497436523438": 1654, "37": 1655, "prompt_tokens_details": 1656, "41990c51a26d4fac8419077f12871099": 1657, "73ce66379026482699f81974e14e1e99": 1658, "13f2ffe6ba40460fbf9f7f00ad667d75": 1659, "001094818115234375": 1660, "demonstrate": 1661, "helper": 1662, "prefill_example": 1663, "decode_example": 1664, "sequentially": 1665, "saving": 1666, "local_storage": 1667, "prompts": 1668, "txt": 1669, "loading": 1670, "disagg_proxy_demo": 1671, "xpyd": 1672, "kv_events": 1673, "structured": 1674, "capabilities": 1675, "constraint": 1676, "responses": 1677, "concurrent": 1678, "choice": 1679, "3b": 1680, "reasoning": 1681, "r1": 1682, "distill": 1683, "deepseek_r1": 1684, "want": 1685, "standalone": 1686, "uv": 1687, "uvx": 1688, "git": 1689, "subdirectory": 1690, "online_serving": 1691, "structured_outputs": 1692, "tip": 1693, "remotely": 1694, "openai_base_url": 1695, "remote_url": 1696, "constraints": 1697, "structural_tag": 1698, "regex": 1699, "helm": 1700, "charts": 1701, "chart": 1702, "deploying": 1703, "application": 1704, "autoscaling": 1705, "resource": 1706, "defines": 1707, "metadata": 1708, "maintainers": 1709, "ct": 1710, "lintconf": 1711, "linting": 1712, "rules": 1713, "values": 1714, "validating": 1715, "templates": 1716, "_helpers": 1717, "tpl": 1718, "defining": 1719, "configmap": 1720, "template": 1721, "configmaps": 1722, "kubernetes": 1723, "deployments": 1724, "hpa": 1725, "horizontal": 1726, "pod": 1727, "autoscaler": 1728, "job": 1729, "jobs": 1730, "poddisruptionbudget": 1731, "budget": 1732, "pvc": 1733, "persistent": 1734, "volume": 1735, "claims": 1736, "secrets": 1737, "services": 1738, "prometheus": 1739, "grafana": 1740, "connect": 1741, "metric": 1742, "stack": 1743, "launch": 1744, "docker": 1745, "checkout": 1746, "methods": 1747, "io": 1748, "websites": 1749, "compose": 1750, "linux": 1751, "entrypoint": 1752, "submit": 1753, "sample": 1754, "datasets": 1755, "anon8231489123": 1756, "sharegpt_vicuna_unfiltered": 1757, "sharegpt_v3_unfiltered_cleaned_split": 1758, "bench": 1759, "dataset": 1760, "sharegpt": 1761, "rate": 1762, "navigating": 1763, "8000": 1764, "metrics": 1765, "show": 1766, "exposed": 1767, "username": 1768, "admin": 1769, "password": 1770, "connections": 1771, "datasources": 1772, "select": 1773, "page": 1774, "connection": 1775, "containers": 1776, "creates": 1777, "dns": 1778, "9090": 1779, "click": 1780, "save": 1781, "green": 1782, "saying": 1783, "successfully": 1784, "queried": 1785, "datasource": 1786, "screen": 1787, "looks": 1788, "imgur": 1789, "r2vh9vw": 1790, "opentelemetry": 1791, "poc": 1792, "packages": 1793, "26": 1794, "exporter": 1795, "otlp": 1796, "semantic": 1797, "conventions": 1798, "jaeger": 1799, "jaegertracing": 1800, "57": 1801, "collector_zipkin_host_port": 1802, "9411": 1803, "6831": 1804, "udp": 1805, "6832": 1806, "5778": 1807, "16686": 1808, "4317": 1809, "4318": 1810, "14250": 1811, "14268": 1812, "14269": 1813, "shell": 1814, "ip": 1815, "jaeger_ip": 1816, "inspect": 1817, "networksettings": 1818, "ipaddress": 1819, "otel_exporter_otlp_traces_endpoint": 1820, "grpc": 1821, "insecure": 1822, "otel_service_name": 1823, "otel_exporter_otlp_traces_insecure": 1824, "true": 1825, "facebook": 1826, "opt": 1827, "125m": 1828, "traces": 1829, "context": 1830, "dummy": 1831, "dummy_client": 1832, "webui": 1833, "pane": 1834, "hit": 1835, "gyhhfjo": 1836, "clicking": 1837, "spans": 1838, "tags": 1839, "demo": 1840, "containing": 1841, "prompt": 1842, "opf6cbl": 1843, "protocol": 1844, "protobuf": 1845, "transport": 1846, "otel_exporter_otlp_traces_protocol": 1847, "follows": 1848, "instrumentation": 1849, "automatic": 1850, "instrument": 1851, "hywvooj": 1852, "processing": 1853, "handle": 1854, "exceeds": 1855, "maximum": 1856, "length": 1857, "quick": 1858, "very": 1859, "texts": 1860, "3m": 1861, "different": 1862, "model_name": 1863, "jinaai": 1864, "jina": 1865, "max_embed_len": 1866, "1048576": 1867, "documents": 1868, "multilingual": 1869, "3072000": 1870, "comprehensive": 1871, "startup": 1872, "override": 1873, "pooler": 1874, "pooling_type": 1875, "normalize": 1876, "enable_chunked_processing": 1877, "pooling": 1878, "strategy": 1879, "chunk": 1880, "cross": 1881, "aggregation": 1882, "automatically": 1883, "mean": 1884, "native": 1885, "combination": 1886, "component": 1887, "chunks": 1888, "always": 1889, "weighted": 1890, "averaging": 1891, "counts": 1892, "optimal": 1893, "processed": 1894, "31090": 1895, "gpu_count": 1896, "cls": 1897, "last": 1898, "affects": 1899, "api_key": 1900, "empty": 1901, "authentication": 1902, "works": 1903, "longer": 1904, "max_model_len": 1905, "smart": 1906, "chunking": 1907, "split": 1908, "max_position_embeddings": 1909, "maintain": 1910, "unified": 1911, "separately": 1912, "combined": 1913, "count": 1914, "across": 1915, "dimensionality": 1916, "standard": 1917, "handling": 1918, "accepted": 1919, "rejected": 1920, "vllm_allow_long_max_model_len": 1921, "extreme": 1922, "academic": 1923, "papers": 1924, "references": 1925, "legal": 1926, "contracts": 1927, "books": 1928, "entire": 1929, "chapters": 1930, "repositories": 1931, "codebases": 1932, "aspect": 1933, "minimal": 1934, "proportional": 1935, "scalable": 1936, "quality": 1937, "short": 1938, "normal": 1939, "baseline": 1940, "100k": 1941, "mixed": 1942, "consistency": 1943, "reproducible": 1944, "troubleshooting": 1945, "valueerror": 1946, "position": 1947, "4096": 1948, "solution": 1949, "reduce": 1950, "runtimeerror": 1951, "adjusting": 1952, "fewer": 1953, "slow": 1954, "expected": 1955, "due": 1956, "calls": 1957, "activity": 1958, "150000": 1959, "max_chunk_size": 1960, "extend": 1961, "architecture": 1962, "lengths": 1963, "validate": 1964, "compared": 1965, "updates": 1966, "parameter": 1967, "simplified": 1968, "millions": 1969, "better": 1970, "exceed": 1971, "limits": 1972, "backward": 1973, "continue": 1974, "hide": 1975, "navigation": 1976, "toc": 1977, "figure": 1978, "markdown": 1979, "span": 1980, "60": 1981, "style": 1982, "strong": 1983, "async": 1984, "buttons": 1985, "js": 1986, "button": 1987, "aria": 1988, "label": 1989, "star": 1990, "subscription": 1991, "icon": 1992, "octicon": 1993, "eye": 1994, "watch": 1995, "fork": 1996, "forked": 1997, "depends": 1998, "looking": 1999, "applications": 2000, "roadmap": 2001, "gaudi": 2002, "accelerators": 2003, "power": 2004, "trainium": 2005, "inferentia": 2006, "announcing": 2007, "intro": 2008, "sosp": 2009, "23x": 2010, "reducing": 2011, "p50": 2012, "latency": 2013, "cade": 2014, "daniel": 2015, "et": 2016, "al": 2017, "meetups": 2018, "readme": 2019, "host": 2020, "regular": 2021, "francisco": 2022, "bay": 2023, "area": 2024, "months": 2025, "guest": 2026, "speakers": 2027, "insights": 2028, "materials": 2029, "august": 2030, "2nd": 2031, "7th": 2032, "3rd": 2033, "march": 2034, "27th": 2035, "16th": 2036, "11th": 2037, "february": 2038, "january": 2039, "22nd": 2040, "november": 2041, "14th": 2042, "september": 2043, "9th": 2044, "july": 2045, "24th": 2046, "june": 2047, "31st": 2048, "youtu": 2049, "y0c": 2050, "duvenzq": 2051, "torch": 2052, "compile": 2053, "m0dmtfli": 2054, "dg": 2055, "october": 2056, "5th": 2057, "potentially": 2058, "locations": 2059, "interested": 2060, "speaking": 2061, "sponsoring": 2062, "generative": 2063, "covers": 2064, "implement": 2065, "vllmmodelfortextgeneration": 2066, "model_executor": 2067, "hidden": 2068, "states": 2069, "probabilities": 2070, "passed": 2071, "sampler": 2072, "layers": 2073, "obtain": 2074, "mode": 2075, "option": 2076, "vast": 2077, "majority": 2078, "detect": 2079, "options": 2080, "initializing": 2081, "counterpart": 2082, "transformers": 2083, "main_classes": 2084, "text_generation": 2085, "generationmixin": 2086, "tokenization": 2087, "detokenization": 2088, "my": 2089, "generated_text": 2090, "optionally": 2091, "samplingparams": 2092, "greedy": 2093, "recommended": 2094, "creator": 2095, "applying": 2096, "generation_config": 2097, "exists": 2098, "however": 2099, "preferred": 2100, "instance": 2101, "found": 2102, "gh": 2103, "beam_search": 2104, "implements": 2105, "generation_strategies": 2106, "top": 2107, "beams": 2108, "50": 2109, "sampling_params": 2110, "beamsearchparams": 2111, "beam_width": 2112, "sequences": 2113, "accepts": 2114, "chat_templating": 2115, "general": 2116, "instruction": 2117, "tuned": 2118, "poorly": 2119, "trained": 2120, "respond": 2121, "conversation": 2122, "assist": 2123, "essay": 2124, "importance": 2125, "higher": 2126, "doesn": 2127, "another": 2128, "explicitly": 2129, "chat_utils": 2130, "load_chat_template": 2131, "custom_template": 2132, "chat_template": 2133, "path_to_template": 2134, "openai_compatible_server": 2135, "correspond": 2136, "apis": 2137, "multimodal_inputs": 2138, "classification": 2139, "reward": 2140, "vllmmodelforpooling": 2141, "extract": 2142, "returning": 2143, "primarily": 2144, "matter": 2145, "convenience": 2146, "guaranteed": 2147, "improvement": 2148, "over": 2149, "sentence": 2150, "directly": 2151, "planning": 2152, "optimize": 2153, "comment": 2154, "21796": 2155, "suggestions": 2156, "conversion": 2157, "adapt": 2158, "convert": 2159, "manually": 2160, "shown": 2161, "table": 2162, "fortextencoding": 2163, "embeddingmodel": 2164, "encode": 2165, "classificationmodel": 2166, "forrewardmodeling": 2167, "rewardmodel": 2168, "get_supported_tasks": 2169, "enabling": 2170, "task": 2171, "falls": 2172, "back": 2173, "predefined": 2174, "defined": 2175, "pooler_config": 2176, "attributes": 2177, "converted": 2178, "assigned": 2179, "normalization": 2180, "softmax": 2181, "modules": 2182, "priority": 2183, "further": 2184, "vector": 2185, "embeds": 2186, "probability": 2187, "jason9693": 2188, "5b": 2189, "apeach": 2190, "probs": 2191, "similarity": 2192, "pairs": 2193, "encoder": 2194, "cosine": 2195, "sbert": 2196, "net": 2197, "rerankers": 2198, "candidate": 2199, "query": 2200, "rag": 2201, "reranking": 2202, "frameworks": 2203, "langchain": 2204, "returns": 2205, "extracted": 2206, "internlm": 2207, "internlm2": 2208, "1_8b": 2209, "trust_remote_code": 2210, "pooling_task": 2211, "logits": 2212, "rewards": 2213, "applicable": 2214, "types": 2215, "sequence": 2216, "matryoshka": 2217, "sentence_transformer": 2218, "training": 2219, "representation": 2220, "mrl": 2221, "2205": 2222, "13147": 2223, "technique": 2224, "trade": 2225, "off": 2226, "cost": 2227, "avoid": 2228, "misuse": 2229, "dimensions": 2230, "dimension": 2231, "changing": 2232, "poor": 2233, "badrequesterror": 2234, "400": 2235, "specifying": 2236, "is_matryoshka": 2237, "matryoshka_dimensions": 2238, "recognized": 2239, "hf_overrides": 2240, "arctic": 2241, "256": 2242, "poolingparams": 2243, "white": 2244, "rabbit": 2245, "pooling_params": 2246, "embed_matryoshka_fy": 2247, "curl": 2248, "127": 2249, "encoding_format": 2250, "float": 2251, "5c21fc9a5c9d4384a1b021daccaf9f64": 2252, "1745476417": 2253, "3828125": 2254, "1357421875": 2255, "03759765625": 2256, "125": 2257, "21875": 2258, "09521484375": 2259, "003662109375": 2260, "1591796875": 2261, "130859375": 2262, "0869140625": 2263, "1982421875": 2264, "1689453125": 2265, "220703125": 2266, "1728515625": 2267, "2275390625": 2268, "0712890625": 2269, "162109375": 2270, "283203125": 2271, "055419921875": 2272, "0693359375": 2273, "031982421875": 2274, "04052734375": 2275, "2734375": 2276, "1826171875": 2277, "091796875": 2278, "37890625": 2279, "0888671875": 2280, "12890625": 2281, "021484375": 2282, "0091552734375": 2283, "23046875": 2284, "openai_embedding_matryoshka_fy": 2285, "generative_models": 2286, "pooling_models": 2287, "architectures": 2288, "implemented": 2289, "alongside": 2290, "natively": 2291, "mm": 2292, "backend": 2293, "implementations": 2294, "modeling": 2295, "apply_model": 2296, "transformersforcausallm": 2297, "transformersformultimodallm": 2298, "means": 2299, "force": 2300, "model_impl": 2301, "impl": 2302, "fully": 2303, "optimise": 2304, "degraded": 2305, "comparing": 2306, "dtype": 2307, "loads": 2308, "whole": 2309, "contrast": 2310, "attribute": 2311, "backbone": 2312, "might": 2313, "slight": 2314, "difference": 2315, "neither": 2316, "still": 2317, "customizing": 2318, "custom_models": 2319, "correct": 2320, "structure": 2321, "present": 2322, "auto_map": 2323, "automodel": 2324, "writing": 2325, "customisation": 2326, "done": 2327, "mymodel": 2328, "mymodelforcausallm": 2329, "model_dir": 2330, "modifications": 2331, "needs": 2332, "kwargs": 2333, "down": 2334, "myattention": 2335, "all_attention_functions": 2336, "call": 2337, "_supports_attention_backend": 2338, "modeling_my_model": 2339, "pretrainedmodel": 2340, "nn": 2341, "module": 2342, "self": 2343, "hidden_states": 2344, "attention_interface": 2345, "_attn_implementation": 2346, "attn_output": 2347, "attn_weights": 2348, "query_states": 2349, "key_states": 2350, "value_states": 2351, "happens": 2352, "background": 2353, "is_backend_compatible": 2354, "layer": 2355, "base_model_tp_plan": 2356, "base_model_pp_plan": 2357, "configuration_my_model": 2358, "pretrainedconfig": 2359, "myconfig": 2360, "self_attn": 2361, "k_proj": 2362, "colwise": 2363, "v_proj": 2364, "o_proj": 2365, "rowwise": 2366, "mlp": 2367, "gate_proj": 2368, "up_proj": 2369, "down_proj": 2370, "embed_tokens": 2371, "input_ids": 2372, "inputs_embeds": 2373, "attention_mask": 2374, "norm": 2375, "dict": 2376, "maps": 2377, "qualified": 2378, "patterns": 2379, "styles": 2380, "direct": 2381, "child": 2382, "tuple": 2383, "str": 2384, "stages": 2385, "assumes": 2386, "modulelist": 2387, "element": 2388, "hf_home": 2389, "package_reference": 2390, "environment_variables": 2391, "hfhome": 2392, "inside": 2393, "field": 2394, "listed": 2395, "_need_": 2396, "easiest": 2397, "really": 2398, "runtime": 2399, "program": 2400, "indicates": 2401, "instructions": 2402, "alternatively": 2403, "choose": 2404, "prefer": 2405, "guides": 2406, "huggingfaceh4": 2407, "zephyr": 2408, "beta": 2409, "eval_results": 2410, "downloaded": 2411, "manage": 2412, "scan": 2413, "stored": 2414, "cached": 2415, "detailed": 2416, "verbose": 2417, "delete": 2418, "commands": 2419, "extra": 2420, "tui": 2421, "interactive": 2422, "revisions": 2423, "selected": 2424, "counting": 2425, "438": 2426, "9m": 2427, "none": 2428, "nothing": 2429, "deleted": 2430, "ago": 2431, "a5beb1e3": 2432, "modified": 2433, "3g": 2434, "d4aa6901": 2435, "1g": 2436, "2cfc18c9": 2437, "press": 2438, "space": 2439, "enter": 2440, "ctrl": 2441, "quit": 2442, "modification": 2443, "confirm": 2444, "revision": 2445, "deletion": 2446, "yes": 2447, "total": 2448, "tips": 2449, "globally": 2450, "session": 2451, "http_proxy": 2452, "https_proxy": 2453, "cmd": 2454, "interpreter": 2455, "os": 2456, "environ": 2457, "modelscope": 2458, "cn": 2459, "vllm_use_modelscope": 2460, "legend": 2461, "planned": 2462, "known": 2463, "limitations": 2464, "llmgenerate": 2465, "additionally": 2466, "llmchat": 2467, "th": 2468, "nowrap": 2469, "min": 2470, "pp": 2471, "parallelism_scaling": 2472, "8779": 2473, "aquilaforcausallm": 2474, "aquila": 2475, "aquila2": 2476, "aquilachat": 2477, "etc": 2478, "arceeforcausallm": 2479, "arcee": 2480, "afm": 2481, "arcticforcausallm": 2482, "baichuanforcausallm": 2483, "baichuan2": 2484, "baichuan": 2485, "inc": 2486, "bailingmoeforcausallm": 2487, "ling": 2488, "inclusionai": 2489, "lite": 2490, "plus": 2491, "bambaforcausallm": 2492, "bamba": 2493, "9b": 2494, "bloomforcausallm": 2495, "bloom": 2496, "bloomz": 2497, "bloomchat": 2498, "bigscience": 2499, "bartforconditionalgeneration": 2500, "bart": 2501, "cnn": 2502, "mbartforconditionalgeneration": 2503, "mbart": 2504, "ro": 2505, "chatglmmodel": 2506, "chatglmforconditionalgeneration": 2507, "chatglm": 2508, "zai": 2509, "chatglm2": 2510, "6b": 2511, "chatglm3": 2512, "shieldlm": 2513, "cohereforcausallm": 2514, "cohere2forcausallm": 2515, "coherelabs": 2516, "c4ai": 2517, "v01": 2518, "r7b": 2519, "dbrxforcausallm": 2520, "dbrx": 2521, "decilmforcausallm": 2522, "decilm": 2523, "3_3": 2524, "nemotron": 2525, "super": 2526, "49b": 2527, "deepseekforcausallm": 2528, "67b": 2529, "deepseekv2forcausallm": 2530, "deepseekv3forcausallm": 2531, "dots1forcausallm": 2532, "dots": 2533, "llm1": 2534, "rednote": 2535, "hilab": 2536, "inst": 2537, "ernie4_5forcausallm": 2538, "ernie4": 2539, "baidu": 2540, "ernie": 2541, "pt": 2542, "ernie4_5_moeforcausallm": 2543, "5moe": 2544, "21b": 2545, "a3b": 2546, "300b": 2547, "a47b": 2548, "exaoneforcausallm": 2549, "exaone": 2550, "lgai": 2551, "exaone4forcausallm": 2552, "32b": 2553, "fairseq2llamaforcausallm": 2554, "fairseq2": 2555, "mgleize": 2556, "1b": 2557, "falconforcausallm": 2558, "falcon": 2559, "tiiuae": 2560, "40b": 2561, "rw": 2562, "falconmambaforcausallm": 2563, "falconmamba": 2564, "mamba": 2565, "falconh1forcausallm": 2566, "h1": 2567, "34b": 2568, "gemmaforcausallm": 2569, "gemma": 2570, "2b": 2571, "gemma2forcausallm": 2572, "27b": 2573, "gemma3forcausallm": 2574, "gemma3nforcausallm": 2575, "3n": 2576, "e2b": 2577, "e4b": 2578, "glmforcausallm": 2579, "glm": 2580, "glm4forcausallm": 2581, "0414": 2582, "glm4moeforcausallm": 2583, "gpt2lmheadmodel": 2584, "gpt": 2585, "gpt2": 2586, "xl": 2587, "gptbigcodeforcausallm": 2588, "starcoder": 2589, "santacoder": 2590, "wizardcoder": 2591, "bigcode": 2592, "gpt_bigcode": 2593, "wizardlm": 2594, "15b": 2595, "gptjforcausallm": 2596, "eleutherai": 2597, "nomic": 2598, "gpt4all": 2599, "gptneoxforcausallm": 2600, "neox": 2601, "pythia": 2602, "openassistant": 2603, "dolly": 2604, "stablelm": 2605, "20b": 2606, "12b": 2607, "oasst": 2608, "sft": 2609, "epoch": 2610, "stabilityai": 2611, "gptossforcausallm": 2612, "oss": 2613, "120b": 2614, "graniteforcausallm": 2615, "granite": 2616, "powerlm": 2617, "granitemoeforcausallm": 2618, "moe": 2619, "powermoe": 2620, "a400m": 2621, "a800m": 2622, "granitemoehybridforcausallm": 2623, "hybrid": 2624, "tiny": 2625, "preview": 2626, "granitemoesharedforcausallm": 2627, "shared": 2628, "active": 2629, "experts": 2630, "gritlm": 2631, "parasail": 2632, "grok1modelforcausallm": 2633, "grok1": 2634, "hpcai": 2635, "tech": 2636, "grok": 2637, "hunyuandensev1forcausallm": 2638, "hunyuan": 2639, "0124": 2640, "tencent": 2641, "hunyuanmoev1forcausallm": 2642, "80b": 2643, "a13b": 2644, "pretrain": 2645, "hcxvisionforcausallm": 2646, "hyperclovax": 2647, "seed": 2648, "naver": 2649, "internlmforcausallm": 2650, "internlm2forcausallm": 2651, "internlm3forcausallm": 2652, "internlm3": 2653, "jaislmheadmodel": 2654, "jais": 2655, "inceptionai": 2656, "30b": 2657, "jambaforcausallm": 2658, "jamba": 2659, "ai21labs": 2660, "ai21": 2661, "mini": 2662, "llamaforcausallm": 2663, "yi": 2664, "405b": 2665, "mambaforcausallm": 2666, "130m": 2667, "790m": 2668, "mamba2forcausallm": 2669, "mamba2": 2670, "codestral": 2671, "mimoforcausallm": 2672, "mimo": 2673, "xiaomimimo": 2674, "rl": 2675, "minicpmforcausallm": 2676, "minicpm": 2677, "openbmb": 2678, "dpo": 2679, "minicpm3forcausallm": 2680, "minicpm3": 2681, "4b": 2682, "mistralforcausallm": 2683, "mixtralforcausallm": 2684, "8x7b": 2685, "8x22b": 2686, "mptforcausallm": 2687, "mpt": 2688, "storywriter": 2689, "mosaicml": 2690, "nemotronforcausallm": 2691, "minitron": 2692, "mgoin": 2693, "340b": 2694, "nemotronhforcausallm": 2695, "8k": 2696, "47b": 2697, "56b": 2698, "olmoforcausallm": 2699, "olmo": 2700, "allenai": 2701, "olmo2forcausallm": 2702, "olmo2": 2703, "0425": 2704, "olmoeforcausallm": 2705, "olmoe": 2706, "0924": 2707, "optforcausallm": 2708, "iml": 2709, "66b": 2710, "orionforcausallm": 2711, "orion": 2712, "orionstarai": 2713, "14b": 2714, "phiforcausallm": 2715, "1_5": 2716, "phi3forcausallm": 2717, "128k": 2718, "phimoeforcausallm": 2719, "phi4flashforcausallm": 2720, "flash": 2721, "persimmonforcausallm": 2722, "persimmon": 2723, "adept": 2724, "plamo2forcausallm": 2725, "plamo2": 2726, "pfnet": 2727, "plamo": 2728, "qwenlmheadmodel": 2729, "qwen2forcausallm": 2730, "qwq": 2731, "qwen2moeforcausallm": 2732, "qwen2moe": 2733, "qwen1": 2734, "a2": 2735, "qwen3forcausallm": 2736, "qwen3": 2737, "qwen3moeforcausallm": 2738, "qwen3moe": 2739, "stablelmforcausallm": 2740, "4e1t": 2741, "starcoder2forcausallm": 2742, "starcoder2": 2743, "solarforcausallm": 2744, "solar": 2745, "pro": 2746, "upstage": 2747, "telechat2forcausallm": 2748, "telechat2": 2749, "tele": 2750, "35b": 2751, "teleflmforcausallm": 2752, "teleflm": 2753, "cofeai": 2754, "flm": 2755, "52b": 2756, "2407": 2757, "xverseforcausallm": 2758, "xverse": 2759, "65b": 2760, "minimaxm1forcausallm": 2761, "minimax": 2762, "minimaxai": 2763, "m1": 2764, "40k": 2765, "80k": 2766, "minimaxtext01forcausallm": 2767, "zamba2forcausallm": 2768, "zamba2": 2769, "zyphra": 2770, "acknowledge": 2771, "say": 2772, "fallback": 2773, "behaviour": 2774, "ll": 2775, "smollm3forcausallm": 2776, "smollm3": 2777, "huggingfacetb": 2778, "therefore": 2779, "llmembed": 2780, "bertmodel": 2781, "sup": 2782, "bert": 2783, "xs": 2784, "gemma2model": 2785, "gemma2": 2786, "gtemodel": 2787, "gtenewmodel": 2788, "mgte": 2789, "trm": 2790, "nlp": 2791, "gte": 2792, "modernbertmodel": 2793, "modernbert": 2794, "nomicbertmodel": 2795, "llamamodel": 2796, "mistralmodel": 2797, "qwen2model": 2798, "ssmits": 2799, "qwen3model": 2800, "robertamodel": 2801, "robertaformaskedlm": 2802, "roberta": 2803, "forcausallm": 2804, "original": 2805, "improperly": 2806, "relevant": 2807, "34882": 2808, "temporarily": 2809, "matching": 2810, "merging": 2811, "weights": 2812, "named": 2813, "newmodel": 2814, "too": 2815, "generic": 2816, "as_embedding_model": 2817, "adapters": 2818, "normalized": 2819, "llmclassify": 2820, "jambaforsequenceclassification": 2821, "dev": 2822, "gpt2forsequenceclassification": 2823, "nie3e": 2824, "sentiment": 2825, "polish": 2826, "as_seq_cls_model": 2827, "softmaxed": 2828, "subset": 2829, "llmscore": 2830, 