{"vllm": 0, "code": 1, "conduct": 2, "our": 3, "pledge": 4, "we": 5, "members": 6, "contributors": 7, "leaders": 8, "make": 9, "participation": 10, "community": 11, "harassment": 12, "free": 13, "experience": 14, "everyone": 15, "regardless": 16, "age": 17, "body": 18, "size": 19, "visible": 20, "invisible": 21, "disability": 22, "ethnicity": 23, "sex": 24, "characteristics": 25, "gender": 26, "identity": 27, "expression": 28, "level": 29, "education": 30, "socioeconomic": 31, "status": 32, "nationality": 33, "personal": 34, "appearance": 35, "race": 36, "caste": 37, "color": 38, "religion": 39, "sexual": 40, "orientation": 41, "act": 42, "interact": 43, "ways": 44, "contribute": 45, "open": 46, "welcoming": 47, "diverse": 48, "inclusive": 49, "healthy": 50, "standards": 51, "examples": 52, "behavior": 53, "contributes": 54, "positive": 55, "environment": 56, "include": 57, "demonstrating": 58, "empathy": 59, "kindness": 60, "toward": 61, "other": 62, "people": 63, "being": 64, "respectful": 65, "differing": 66, "opinions": 67, "viewpoints": 68, "experiences": 69, "giving": 70, "gracefully": 71, "accepting": 72, "constructive": 73, "feedback": 74, "responsibility": 75, "apologizing": 76, "those": 77, "affected": 78, "mistakes": 79, "learning": 80, "from": 81, "focusing": 82, "what": 83, "best": 84, "just": 85, "us": 86, "individuals": 87, "overall": 88, "unacceptable": 89, "use": 90, "sexualized": 91, "language": 92, "imagery": 93, "attention": 94, "advances": 95, "any": 96, "kind": 97, "trolling": 98, "insulting": 99, "derogatory": 100, "comments": 101, "political": 102, "attacks": 103, "public": 104, "private": 105, "publishing": 106, "others": 107, "information": 108, "physical": 109, "email": 110, "address": 111, "without": 112, "explicit": 113, "permission": 114, "which": 115, "could": 116, "reasonably": 117, "considered": 118, "inappropriate": 119, "professional": 120, "setting": 121, "enforcement": 122, "responsibilities": 123, "responsible": 124, "clarifying": 125, "enforcing": 126, "acceptable": 127, "take": 128, "appropriate": 129, "fair": 130, "corrective": 131, "action": 132, "response": 133, "deem": 134, "threatening": 135, "offensive": 136, "harmful": 137, "have": 138, "right": 139, "remove": 140, "edit": 141, "reject": 142, "commits": 143, "wiki": 144, "edits": 145, "issues": 146, "contributions": 147, "aligned": 148, "communicate": 149, "reasons": 150, "moderation": 151, "decisions": 152, "when": 153, "scope": 154, "applies": 155, "within": 156, "all": 157, "spaces": 158, "also": 159, "individual": 160, "officially": 161, "representing": 162, "using": 163, "official": 164, "posting": 165, "via": 166, "social": 167, "media": 168, "account": 169, "acting": 170, "appointed": 171, "representative": 172, "online": 173, "offline": 174, "irl": 175, "event": 176, "instances": 177, "abusive": 178, "harassing": 179, "otherwise": 180, "may": 181, "reported": 182, "channel": 183, "slack": 184, "https": 185, "ai": 186, "complaints": 187, "reviewed": 188, "investigated": 189, "promptly": 190, "fairly": 191, "obligated": 192, "respect": 193, "privacy": 194, "security": 195, "reporter": 196, "incident": 197, "guidelines": 198, "follow": 199, "impact": 200, "determining": 201, "consequences": 202, "violation": 203, "correction": 204, "deemed": 205, "unprofessional": 206, "unwelcome": 207, "consequence": 208, "written": 209, "warning": 210, "providing": 211, "clarity": 212, "around": 213, "nature": 214, "explanation": 215, "why": 216, "apology": 217, "requested": 218, "through": 219, "single": 220, "series": 221, "actions": 222, "continued": 223, "interaction": 224, "involved": 225, "including": 226, "unsolicited": 227, "specified": 228, "period": 229, "time": 230, "includes": 231, "avoiding": 232, "interactions": 233, "well": 234, "external": 235, "channels": 236, "like": 237, "violating": 238, "terms": 239, "lead": 240, "temporary": 241, "permanent": 242, "ban": 243, "serious": 244, "sustained": 245, "sort": 246, "communication": 247, "allowed": 248, "during": 249, "pattern": 250, "aggression": 251, "disparagement": 252, "classes": 253, "attribution": 254, "adapted": 255, "contributor": 256, "covenant": 257, "www": 258, "org": 259, "version": 260, "available": 261, "v2": 262, "code_of_conduct": 263, "html": 264, "were": 265, "inspired": 266, "mozilla": 267, "ladder": 268, "github": 269, "com": 270, "inclusion": 271, "contributing": 272, "you": 273, "find": 274, "about": 275, "docs": 276, "en": 277, "latest": 278, "markdownlint": 279, "disable": 280, "md001": 281, "md041": 282, "align": 283, "center": 284, "picture": 285, "source": 286, "prefers": 287, "scheme": 288, "dark": 289, "srcset": 290, "raw": 291, "githubusercontent": 292, "project": 293, "main": 294, "assets": 295, "logos": 296, "logo": 297, "text": 298, "png": 299, "img": 300, "alt": 301, "src": 302, "light": 303, "width": 304, "55": 305, "h3": 306, "easy": 307, "fast": 308, "cheap": 309, "llm": 310, "serving": 311, "href": 312, "documentation": 313, "blog": 314, "arxiv": 315, "abs": 316, "2309": 317, "06180": 318, "paper": 319, "vllm_project": 320, "twitter": 321, "discuss": 322, "user": 323, "forum": 324, "developer": 325, "news": 326, "2025": 327, "08": 328, "hosted": 329, "beijing": 330, "meetup": 331, "mp": 332, "weixin": 333, "qq": 334, "dgkwg1wfpwgo2jcdtqqhxa": 335, "large": 336, "scale": 337, "deployment": 338, "please": 339, "slides": 340, "here": 341, "drive": 342, "google": 343, "folders": 344, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 345, "recording": 346, "chaspark": 347, "live": 348, "1166916873711665152": 349, "05": 350, "nyc": 351, "lu": 352, "ma": 353, "c1rqyf1f": 354, "presentation": 355, "1_q_aw_iomjwuimf1s1ym": 356, "zhjxz8cuel0ijvaquoybea": 357, "usp": 358, "sharing": 359, "now": 360, "under": 361, "pytorch": 362, "foundation": 363, "announcement": 364, "welcomes": 365, "01": 366, "excited": 367, "announce": 368, "alpha": 369, "release": 370, "v1": 371, "major": 372, "architectural": 373, "upgrade": 374, "7x": 375, "speedup": 376, "clean": 377, "optimized": 378, "execution": 379, "loop": 380, "zero": 381, "overhead": 382, "prefix": 383, "caching": 384, "enhanced": 385, "multimodal": 386, "support": 387, "more": 388, "check": 389, "out": 390, "post": 391, "27": 392, "details": 393, "summary": 394, "previous": 395, "04": 396, "asia": 397, "day": 398, "sginnovate": 399, "limited": 400, "availability": 401, "morning": 402, "evening": 403, "slots": 404, "remaining": 405, "inaugural": 406, "team": 407, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 408, "03": 409, "ollama": 410, "inference": 411, "night": 412, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 413, "first": 414, "china": 415, "n77gibl2coratqhtveazfg": 416, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 417, "east": 418, "coast": 419, "7mu4k4xx": 420, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 421, "li": 422, "de": 423, "g3": 424, "14": 425, "41": 426, "84": 427, "6c": 428, "39": 429, "_0": 430, "20": 431, "25": 432, "ho": 433, "st": 434, "ed": 435, "th": 436, "ni": 437, "nt": 438, "vl": 439, "lm": 440, "ee": 441, "tu": 442, "tt": 443, "ps": 444, "7g": 445, "3k": 446, "uj": 447, "me": 448, "ta": 449, "pl": 450, "ea": 451, "se": 452, "et": 453, "up": 454, "fr": 455, "om": 456, "ll": 457, "te": 458, "am": 459, "he": 460, "re": 461, "ht": 462, "tp": 463, "do": 464, "cs": 465, "oo": 466, "gl": 467, "co": 468, "pr": 469, "es": 470, "ti": 471, "jz": 472, "c_": 473, "pz": 474, "vx": 475, "rv": 476, "ns": 477, "fv": 478, "cw": 479, "4c": 480, "fx": 481, "b6": 482, "pn": 483, "7z": 484, "z2": 485, "cy": 486, "p_": 487, "fl": 488, "wo": 489, "aq": 490, "sp": 491, "ha": 492, "ri": 493, "ng": 494, "er": 495, "ve": 496, "fi": 497, "le": 498, "zk": 499, "5q": 500, "ej": 501, "ik": 502, "tm": 503, "lq": 504, "2e": 505, "qc": 506, "xq": 507, "zl": 508, "lj": 509, "ax": 510, "3m": 511, "9s": 512, "7n": 513, "wn": 514, "ie": 515, "sh": 516, "ar": 517, "sl": 518, "id": 519, "ro": 520, "il": 521, "os": 522, "ei": 523, "gh": 524, "ze": 525, "p5": 526, "6h": 527, "ui": 528, "wi": 529, "cl": 530, "ou": 531, "nd": 532, "oc": 533, "go": 534, "og": 535, "io": 536, "1e": 537, "pv": 538, "kt": 539, "4z": 540, "u8": 541, "_s": 542, "5o": 543, "hp": 544, "c7": 545, "98": 546, "em": 547, "sy": 548, "h2": 549, "bw": 550, "yf": 551, "ru": 552, "dd": 553, "f7": 554, "u4": 555, "di": 556, "lo": 557, "ud": 558, "4p": 559, "wa": 560, "ny": 561, "rl": 562, "11": 563, "xy": 564, "5d": 565, "xu": 566, "bv": 567, "rc": 568, "9f": 569, "9k": 570, "kj": 571, "ix": 572, "02": 573, "12": 574, "oi": 575, "py": 576, "ec": 577, "ys": 578, "yt": 579, "ch": 580, "rg": 581, "ap": 582, "vi": 583, "ry": 584, "24": 585, "0q": 586, "vr": 587, "aj": 588, "sn": 589, "ow": 590, "ak": 591, "3c": 592, "3j": 593, "sf": 594, "gp": 595, "30": 596, "sw": 597, "yv": 598, "s3": 599, "_t": 600, "oh": 601, "j9": 602, "pa": 603, "jg": 604, "k6": 605, "kr": 606, "54": 607, "qf": 608, "3r": 609, "kd": 610, "ab": 611, "lw": 612, "z9": 613, "wk": 614, "5t": 615, "ol": 616, "2f": 617, "e9": 618, "t6": 619, "hv": 620, "nl": 621, "fa": 622, "x6": 623, "cr": 624, "pe": 625, "ac": 626, "la": 627, "ck": 628, "rd": 629, "bu": 630, "sc": 631, "si": 632, "fe": 633, "el": 634, "10": 635, "ra": 636, "su": 637, "mm": 638, "ld": 639, "ci": 640, "al": 641, "1b": 642, "_k": 643, "qx": 644, "ph": 645, "bt": 646, "_m": 647, "df": 648, "r6": 649, "i8": 650, "rw": 651, "u5": 652, "qo": 653, "tz": 654, "nc": 655, "eg": 656, "2m": 657, "kz": 658, "xe": 659, "hm": 660, "mo": 661, "ks": 662, "ww": 663, "yo": 664, "ut": 665, "ub": 666, "ay": 667, "zt": 668, "pq": 669, "ne": 670, "px": 671, "l6": 672, "fu": 673, "wu": 674, "im": 675, "lp": 676, "vp": 677, "jr": 678, "rs": 679, "09": 680, "87q3nvnh": 681, "nvidia": 682, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 683, "9wqyp7ny93xrs": 684, "2024": 685, "07": 686, "fifth": 687, "lp0gyjqr": 688, "aws": 689, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 690, "partnership": 691, "meta": 692, "supports": 693, "llama": 694, "fp8": 695, "quantization": 696, "pipeline": 697, "parallelism": 698, "23": 699, "llama31": 700, "06": 701, "fourth": 702, "agivllm": 703, "cloudflare": 704, "bentoml": 705, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 706, "third": 707, "robloxandvllmmeetup2024": 708, "splashthat": 709, "roblox": 710, "1a": 711, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 712, "second": 713, "ygxbpzhl": 714, "ibm": 715, "12mi2skabnuw5rbwxdyy": 716, "hthth4imsnceoq10jdqbxga": 717, "2023": 718, "a16z": 719, "1ql": 720, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 721, "would": 722, "express": 723, "sincere": 724, "gratitude": 725, "andreessen": 726, "horowitz": 727, "supporting": 728, "generous": 729, "grant": 730, "development": 731, "research": 732, "released": 733, "fastchat": 734, "integration": 735, "has": 736, "powered": 737, "lmsys": 738, "vicuna": 739, "chatbot": 740, "arena": 741, "chat": 742, "since": 743, "mid": 744, "april": 745, "library": 746, "originally": 747, "developed": 748, "sky": 749, "computing": 750, "lab": 751, "berkeley": 752, "edu": 753, "uc": 754, "evolved": 755, "driven": 756, "both": 757, "academia": 758, "industry": 759, "state": 760, "art": 761, "throughput": 762, "efficient": 763, "management": 764, "key": 765, "value": 766, "memory": 767, "pagedattention": 768, "continuous": 769, "batching": 770, "incoming": 771, "requests": 772, "model": 773, "cuda": 774, "hip": 775, "graph": 776, "quantizations": 777, "gptq": 778, "2210": 779, "17323": 780, "awq": 781, "2306": 782, "00978": 783, "autoround": 784, "05516": 785, "int4": 786, "int8": 787, "kernels": 788, "flashattention": 789, "flashinfer": 790, "speculative": 791, "decoding": 792, "chunked": 793, "prefill": 794, "flexible": 795, "seamless": 796, "popular": 797, "hugging": 798, "face": 799, "models": 800, "high": 801, "various": 802, "algorithms": 803, "parallel": 804, "sampling": 805, "beam": 806, "search": 807, "tensor": 808, "data": 809, "expert": 810, "distributed": 811, "streaming": 812, "outputs": 813, "openai": 814, "compatible": 815, "api": 816, "server": 817, "gpus": 818, "amd": 819, "cpus": 820, "intel": 821, "powerpc": 822, "tpu": 823, "neuron": 824, "multi": 825, "lora": 826, "seamlessly": 827, "most": 828, "huggingface": 829, "transformer": 830, "llms": 831, "mixture": 832, "mixtral": 833, "deepseek": 834, "v3": 835, "embedding": 836, "e5": 837, "mistral": 838, "modal": 839, "llava": 840, "full": 841, "list": 842, "supported": 843, "supported_models": 844, "getting": 845, "started": 846, "install": 847, "pip": 848, "getting_started": 849, "installation": 850, "gpu": 851, "index": 852, "build": 853, "wheel": 854, "bash": 855, "visit": 856, "learn": 857, "quickstart": 858, "welcome": 859, "collaborations": 860, "how": 861, "get": 862, "sponsors": 863, "compute": 864, "resources": 865, "testing": 866, "following": 867, "organizations": 868, "thank": 869, "your": 870, "note": 871, "them": 872, "alphabetical": 873, "order": 874, "keep": 875, "consistent": 876, "md": 877, "cash": 878, "donations": 879, "dropbox": 880, "sequoia": 881, "capital": 882, "skywork": 883, "zhenfund": 884, "alibaba": 885, "cloud": 886, "anyscale": 887, "crusoe": 888, "databricks": 889, "deepinfra": 890, "lambda": 891, "nebius": 892, "novita": 893, "replicate": 894, "runpod": 895, "trainy": 896, "san": 897, "diego": 898, "sponsor": 899, "fundraising": 900, "venue": 901, "opencollective": 902, "plan": 903, "fund": 904, "maintenance": 905, "adoption": 906, "citation": 907, "cite": 908, "bibtex": 909, "inproceedings": 910, "kwon2023efficient": 911, "title": 912, "author": 913, "woosuk": 914, "kwon": 915, "zhuohan": 916, "siyuan": 917, "zhuang": 918, "ying": 919, "sheng": 920, "lianmin": 921, "zheng": 922, "cody": 923, "hao": 924, "yu": 925, "joseph": 926, "gonzalez": 927, "zhang": 928, "ion": 929, "stoica": 930, "booktitle": 931, "proceedings": 932, "acm": 933, "sigops": 934, "29th": 935, "symposium": 936, "operating": 937, "systems": 938, "principles": 939, "year": 940, "contact": 941, "start": 942, "technical": 943, "questions": 944, "feature": 945, "discussing": 946, "fellow": 947, "users": 948, "coordinating": 949, "disclosures": 950, "advisories": 951, "partnerships": 952, "lists": 953, "mailto": 954, "end": 955, "kit": 956, "releasing": 957, "releases": 958, "offer": 959, "reliable": 960, "base": 961, "packaged": 962, "binary": 963, "format": 964, "can": 965, "conveniently": 966, "accessed": 967, "pypi": 968, "serve": 969, "milestones": 970, "newly": 971, "features": 972, "improvements": 973, "upcoming": 974, "changes": 975, "affect": 976, "potential": 977, "breaking": 978, "versioning": 979, "uses": 980, "shifted": 981, "where": 982, "new": 983, "patch": 984, "every": 985, "weeks": 986, "contain": 987, "bug": 988, "fixes": 989, "opposed": 990, "semver": 991, "contains": 992, "only": 993, "backwards": 994, "critical": 995, "need": 996, "made": 997, "special": 998, "post1": 999, "_major_": 1000, "milestone": 1001, "incompatible": 1002, "similar": 1003, "_minor_": 1004, "_patch_": 1005, "_post1_": 1006, "_patch": 1007, "1_": 1008, "either": 1009, "implicit": 1010, "cadence": 1011, "bi": 1012, "weekly": 1013, "basis": 1014, "days": 1015, "after": 1016, "same": 1017, "branch": 1018, "future": 1019, "dates": 1020, "below": 1021, "tentative": 1022, "optional": 1023, "date": 1024, "versions": 1025, "jan": 1026, "feb": 1027, "mar": 1028, "apr": 1029, "jun": 1030, "jul": 1031, "13": 1032, "aug": 1033, "15": 1034, "sep": 1035, "16": 1036, "17": 1037, "oct": 1038, "18": 1039, "19": 1040, "nov": 1041, "21": 1042, "dec": 1043, "22": 1044, "each": 1045, "built": 1046, "dedicated": 1047, "cut": 1048, "performed": 1049, "before": 1050, "previously": 1051, "reused": 1052, "builds": 1053, "triggered": 1054, "push": 1055, "tag": 1056, "rc1": 1057, "enables": 1058, "test": 1059, "multiple": 1060, "rcs": 1061, "final": 1062, "does": 1063, "trigger": 1064, "used": 1065, "notes": 1066, "created": 1067, "monitor": 1068, "reverts": 1069, "apply": 1070, "cherry": 1071, "pick": 1072, "criteria": 1073, "approach": 1074, "finalizing": 1075, "clear": 1076, "picks": 1077, "process": 1078, "land": 1079, "typically": 1080, "ensure": 1081, "sufficient": 1082, "complete": 1083, "thorough": 1084, "round": 1085, "stable": 1086, "regression": 1087, "functional": 1088, "performance": 1089, "against": 1090, "recent": 1091, "severe": 1092, "issue": 1093, "silent": 1094, "incorrectness": 1095, "compatibility": 1096, "crashes": 1097, "deadlocks": 1098, "leaks": 1099, "introduced": 1100, "specific": 1101, "change": 1102, "identifiers": 1103, "work": 1104, "prs": 1105, "merged": 1106, "trunk": 1107, "exception": 1108, "manual": 1109, "validations": 1110, "e2e": 1111, "validation": 1112, "perform": 1113, "regressions": 1114, "benchmark": 1115, "workflow": 1116, "workflows": 1117, "yml": 1118, "current": 1119, "coverage": 1120, "llama3": 1121, "llama4": 1122, "hardware": 1123, "h100": 1124, "mi300x": 1125, "_note": 1126, "based": 1127, "availability_": 1128, "step": 1129, "access": 1130, "request": 1131, "write": 1132, "repository": 1133, "run": 1134, "review": 1135, "setup": 1136, "familiarize": 1137, "yourself": 1138, "configurations": 1139, "tree": 1140, "benchmarks": 1141, "rocm": 1142, "navigate": 1143, "configure": 1144, "set": 1145, "v0": 1146, "commit": 1147, "hash": 1148, "results": 1149, "once": 1150, "completes": 1151, "dashboard": 1152, "hud": 1153, "reponame": 1154, "2fvllm": 1155, "corresponding": 1156, "policy": 1157, "reporting": 1158, "report": 1159, "privately": 1160, "vulnerability": 1161, "submission": 1162, "form": 1163, "triage": 1164, "reports": 1165, "triaged": 1166, "vulnerability_management": 1167, "threat": 1168, "see": 1169, "guide": 1170, "usage": 1171, "assumptions": 1172, "recommendations": 1173, "blob": 1174, "securely": 1175, "severity": 1176, "determine": 1177, "risk": 1178, "taking": 1179, "dealing": 1180, "past": 1181, "common": 1182, "defaults": 1183, "cases": 1184, "categories": 1185, "vulnerabilities": 1186, "allow": 1187, "remote": 1188, "attackers": 1189, "execute": 1190, "arbitrary": 1191, "control": 1192, "system": 1193, "significantly": 1194, "compromise": 1195, "confidentiality": 1196, "integrity": 1197, "privileges": 1198, "needed": 1199, "network": 1200, "deserialization": 1201, "exploit": 1202, "chains": 1203, "generally": 1204, "rated": 1205, "cvss": 1206, "flaws": 1207, "elevated": 1208, "rce": 1209, "contexts": 1210, "significant": 1211, "loss": 1212, "require": 1213, "advanced": 1214, "conditions": 1215, "some": 1216, "trust": 1217, "modes": 1218, "node": 1219, "privileged": 1220, "required": 1221, "scores": 1222, "between": 1223, "moderate": 1224, "cause": 1225, "denial": 1226, "service": 1227, "partial": 1228, "disruption": 1229, "breach": 1230, "rating": 1231, "low": 1232, "minor": 1233, "informational": 1234, "logging": 1235, "errors": 1236, "non": 1237, "exploitable": 1238, "weaknesses": 1239, "local": 1240, "privilege": 1241, "negligible": 1242, "side": 1243, "collisions": 1244, "often": 1245, "less": 1246, "than": 1247, "prenotification": 1248, "certain": 1249, "prenotify": 1250, "vendors": 1251, "ship": 1252, "purpose": 1253, "coordinated": 1254, "notification": 1255, "adding": 1256, "contacts": 1257, "advisory": 1258, "few": 1259, "wish": 1260, "added": 1261, "group": 1262, "send": 1263, "copying": 1264, "vendor": 1265, "analyzed": 1266, "case": 1267, "benchmarking": 1268, "readme": 1269, "guides": 1270, "running": 1271, "tests": 1272, "extensive": 1273, "datasets": 1274, "living": 1275, "document": 1276, "updated": 1277, "become": 1278, "dataset": 1279, "overview": 1280, "ty": 1281, "dt": 1282, "bo": 1283, "tr": 1284, "yl": 1285, "xt": 1286, "gn": 1287, "ft": 1288, "ce": 1289, "ex": 1290, "ig": 1291, "65": 1292, "ef": 1293, "da": 1294, "ad": 1295, "dy": 1296, "td": 1297, "od": 1298, "wg": 1299, "ug": 1300, "gi": 1301, "ts": 1302, "n8": 1303, "89": 1304, "pt": 1305, "_v": 1306, "ic": 1307, "un": 1308, "a_": 1309, "lt": 1310, "3_": 1311, "_c": 1312, "so": 1313, "t4": 1314, "ge": 1315, "hu": 1316, "gg": 1317, "gf": 1318, "bl": 1319, "ob": 1320, "4v": 1321, "_i": 1322, "t_": 1323, "n_": 1324, "ca": 1325, "p1": 1326, "00": 1327, "js": 1328, "ag": 1329, "ep": 1330, "xa": 1331, "oa": 1332, "iv": 1333, "ip": 1334, "n2": 1335, "zi": 1336, "tg": 1337, "style": 1338, "wget": 1339, "hpmll": 1340, "burstgpt": 1341, "download": 1342, "burstgpt_without_fails_2": 1343, "csv": 1344, "strong": 1345, "sonnet": 1346, "deprecated": 1347, "file": 1348, "txt": 1349, "random": 1350, "synthetic": 1351, "repetition": 1352, "visionarena": 1353, "lmarena": 1354, "instructcoder": 1355, "likaixin": 1356, "aimo": 1357, "aime": 1358, "numinamath": 1359, "cot": 1360, "lmms": 1361, "onevision": 1362, "aeala": 1363, "sharegpt_vicuna_unfiltered": 1364, "custom": 1365, "jsonl": 1366, "tbody": 1367, "table": 1368, "name": 1369, "should": 1370, "hf": 1371, "example": 1372, "show": 1373, "br": 1374, "nousresearch": 1375, "hermes": 1376, "8b": 1377, "script": 1378, "anon8231489123": 1379, "resolve": 1380, "sharegpt_v3_unfiltered_cleaned_split": 1381, "json": 1382, "bench": 1383, "backend": 1384, "endpoint": 1385, "completions": 1386, "sharegpt": 1387, "path": 1388, "num": 1389, "prompts": 1390, "successful": 1391, "output": 1392, "result": 1393, "duration": 1394, "78": 1395, "total": 1396, "input": 1397, "tokens": 1398, "1369": 1399, "generated": 1400, "2212": 1401, "req": 1402, "73": 1403, "token": 1404, "tok": 1405, "382": 1406, "619": 1407, "85": 1408, "mean": 1409, "ttft": 1410, "ms": 1411, "71": 1412, "median": 1413, "88": 1414, "p99": 1415, "79": 1416, "49": 1417, "per": 1418, "excl": 1419, "1st": 1420, "tpot": 1421, "91": 1422, "96": 1423, "inter": 1424, "latency": 1425, "itl": 1426, "74": 1427, "70": 1428, "want": 1429, "yet": 1430, "even": 1431, "customdataset": 1432, "needs": 1433, "prompt": 1434, "field": 1435, "entry": 1436, "india": 1437, "iran": 1438, "vllm_use_v1": 1439, "instruct": 1440, "port": 1441, "9001": 1442, "save": 1443, "detailed": 1444, "skip": 1445, "template": 1446, "80": 1447, "max": 1448, "concurrency": 1449, "temperature": 1450, "top": 1451, "75": 1452, "dir": 1453, "log": 1454, "applying": 1455, "already": 1456, "vision": 1457, "capability": 1458, "qwen": 1459, "qwen2": 1460, "7b": 1461, "split": 1462, "train": 1463, "1000": 1464, "config": 1465, "method": 1466, "ngram": 1467, "num_speculative_tokens": 1468, "prompt_lookup_max": 1469, "prompt_lookup_min": 1470, "2048": 1471, "huggingfacedataset": 1472, "subset": 1473, "chart2text": 1474, "cauldron": 1475, "qwq": 1476, "32b": 1477, "seed": 1478, "42": 1479, "philschmid": 1480, "mt": 1481, "parameters": 1482, "backends": 1483, "client": 1484, "command": 1485, "ramp": 1486, "rate": 1487, "tool": 1488, "ramping": 1489, "over": 1490, "useful": 1491, "stress": 1492, "finding": 1493, "maximum": 1494, "handle": 1495, "given": 1496, "budget": 1497, "two": 1498, "strategies": 1499, "linear": 1500, "increases": 1501, "linearly": 1502, "exponential": 1503, "exponentially": 1504, "arguments": 1505, "strategy": 1506, "rps": 1507, "beginning": 1508, "4656": 1509, "1072": 1510, "5014": 1511, "1500": 1512, "image": 1513, "counts": 1514, "4036": 1515, "92": 1516, "326": 1517, "90": 1518, "14527": 1519, "1280": 1520, "vllm_worker_multiproc_method": 1521, "spawn": 1522, "len": 1523, "100": 1524, "async": 1525, "engine": 1526, "104": 1527, "77": 1528, "23836": 1529, "10477": 1530, "261136": 1531, "204800": 1532, "adapters": 1533, "dataset_path": 1534, "dataset_name": 1535, "loras": 1536, "rank": 1537, "enable": 1538, "yard1": 1539, "sql": 1540, "structured": 1541, "generation": 1542, "grammar": 1543, "regex": 1544, "schema": 1545, "python3": 1546, "benchmark_serving_structured_output": 1547, "ratio": 1548, "structure": 1549, "type": 1550, "choice": 1551, "xgrammar": 1552, "xgrammar_bench": 1553, "long": 1554, "qa": 1555, "question": 1556, "answering": 1557, "basic": 1558, "benchmark_long_document_qa_throughput": 1559, "documents": 1560, "length": 1561, "2000": 1562, "50": 1563, "repeat": 1564, "count": 1565, "different": 1566, "mode": 1567, "default": 1568, "shuffle": 1569, "randomly": 1570, "3000": 1571, "tile": 1572, "entire": 1573, "sequence": 1574, "interleave": 1575, "consecutively": 1576, "efficiency": 1577, "automatic": 1578, "fixed": 1579, "benchmark_prefix_caching": 1580, "range": 1581, "128": 1582, "256": 1583, "prefix_repetition": 1584, "512": 1585, "suffix": 1586, "prefixes": 1587, "prioritization": 1588, "benchmark_prioritization": 1589, "64": 1590, "scheduling": 1591, "priority": 1592, "sequences": 1593, "images": 1594, "sharegpt4v": 1595, "python": 1596, "entrypoints": 1597, "api_server": 1598, "dtype": 1599, "bfloat16": 1600, "limit": 1601, "benchmark_serving": 1602, "sharegpt4v_instruct_gpt4": 1603, "vision_cap100k": 1604, "vllm_benchmark_results": 1605, "completion": 1606, "automated": 1607, "parameter": 1608, "tuning": 1609, "automates": 1610, "optimal": 1611, "combination": 1612, "seqs": 1613, "batched": 1614, "maximize": 1615, "additional": 1616, "constraints": 1617, "cache": 1618, "hit": 1619, "contents": 1620, "prerequisites": 1621, "configuration": 1622, "works": 1623, "steps": 1624, "completed": 1625, "clone": 1626, "desired": 1627, "git": 1628, "cd": 1629, "checkout": 1630, "update": 1631, "correct": 1632, "activate": 1633, "conda": 1634, "torch": 1635, "torch_xla": 1636, "customized": 1637, "its": 1638, "files": 1639, "correctly": 1640, "placed": 1641, "accessible": 1642, "must": 1643, "variables": 1644, "variable": 1645, "description": 1646, "absolute": 1647, "parent": 1648, "directory": 1649, "home": 1650, "identifier": 1651, "served": 1652, "choices": 1653, "might": 1654, "saving": 1655, "profiles": 1656, "download_dir": 1657, "load": 1658, "weights": 1659, "input_len": 1660, "4000": 1661, "output_len": 1662, "max_model_len": 1663, "4096": 1664, "min_cache_hit_pct": 1665, "percentage": 1666, "60": 1667, "max_latency_allowed_ms": 1668, "milliseconds": 1669, "very": 1670, "number": 1671, "100000000000": 1672, "effectively": 1673, "ignore": 1674, "constraint": 1675, "500": 1676, "num_seqs_list": 1677, "space": 1678, "separated": 1679, "string": 1680, "values": 1681, "num_batched_tokens_list": 1682, "1024": 1683, "medium": 1684, "sized": 1685, "inputs": 1686, "short": 1687, "larger": 1688, "section": 1689, "highly": 1690, "recommended": 1691, "terminal": 1692, "multiplexer": 1693, "tmux": 1694, "screen": 1695, "prevent": 1696, "stopping": 1697, "connection": 1698, "lost": 1699, "folder_of_this_script": 1700, "auto_tune": 1701, "cannot": 1702, "keyword": 1703, "pkill": 1704, "kill": 1705, "itself": 1706, "goals": 1707, "goal": 1708, "highest": 1709, "possible": 1710, "1800": 1711, "requirement": 1712, "500ms": 1713, "requirements": 1714, "assuming": 1715, "finishes": 1716, "timestamped": 1717, "inside": 1718, "auto": 1719, "yyyy_mm_dd_hh_mm": 1720, "logs": 1721, "vllm_log_": 1722, "bm_log_": 1723, "named": 1724, "tested": 1725, "concludes": 1726, "found": 1727, "content": 1728, "a1b2c3d4": 1729, "max_num_seqs": 1730, "max_num_batched_tokens": 1731, "request_rate": 1732, "e2el": 1733, "450": 1734, "goodput": 1735, "meet": 1736, "best_max_num_seqs": 1737, "best_num_batched_tokens": 1738, "best_throughput": 1739, "profile": 1740, "saved": 1741, "2024_08_01_10_30": 1742, "row": 1743, "due": 1744, "starting": 1745, "properly": 1746, "too": 1747, "strict": 1748, "profiler": 1749, "trace": 1750, "xplane": 1751, "pb": 1752, "performing": 1753, "follows": 1754, "systematic": 1755, "utilization": 1756, "determines": 1757, "safe": 1758, "decreasing": 1759, "oom": 1760, "error": 1761, "launching": 1762, "ensures": 1763, "runs": 1764, "crashing": 1765, "iterate": 1766, "enters": 1767, "nested": 1768, "iterating": 1769, "provided": 1770, "aware": 1771, "infinite": 1772, "inf": 1773, "resulting": 1774, "performs": 1775, "iteratively": 1776, "until": 1777, "met": 1778, "finds": 1779, "sustainable": 1780, "track": 1781, "throughout": 1782, "tracks": 1783, "yielded": 1784, "valid": 1785, "far": 1786, "kv": 1787, "offloading": 1788, "turn": 1789, "conversations": 1790, "benchmark_serving_multi_turn": 1791, "export": 1792, "model_name": 1793, "gutenberg": 1794, "ebooks": 1795, "1184": 1796, "utf": 1797, "mv": 1798, "pg1184": 1799, "filename": 1800, "generate_multi_turn": 1801, "text_files": 1802, "prefer": 1803, "clients": 1804, "active": 1805, "conversation": 1806, "turns": 1807, "etc": 1808, "statistics": 1809, "runtime_sec": 1810, "215": 1811, "810": 1812, "requests_per_sec": 1813, "769": 1814, "std": 1815, "min": 1816, "99": 1817, "ttft_ms": 1818, "166": 1819, "67": 1820, "63": 1821, "45": 1822, "59": 1823, "94": 1824, "62": 1825, "26": 1826, "43": 1827, "69": 1828, "66": 1829, "353": 1830, "567": 1831, "tpot_ms": 1832, "37": 1833, "57": 1834, "40": 1835, "31": 1836, "28": 1837, "latency_ms": 1838, "2591": 1839, "1998": 1840, "53": 1841, "2341": 1842, "2573": 1843, "2860": 1844, "3003": 1845, "3268": 1846, "46": 1847, "3862": 1848, "input_num_turns": 1849, "input_num_tokens": 1850, "2006": 1851, "893": 1852, "56": 1853, "522": 1854, "1247": 1855, "2019": 1856, "2718": 1857, "3233": 1858, "3736": 1859, "3899": 1860, "output_num_tokens": 1861, "109": 1862, "116": 1863, "120": 1864, "output_num_chunks": 1865, "108": 1866, "115": 1867, "119": 1868, "sharegpt_20230401_clean_lang_split": 1869, "convert_sharegpt_to_openai": 1870, "convert": 1871, "sharegpt_conv_128": 1872, "items": 1873, "standard": 1874, "assistant": 1875, "roles": 1876, "flag": 1877, "sample": 1878, "original": 1879, "deepgemm": 1880, "block": 1881, "existing": 1882, "triton": 1883, "cutlass": 1884, "currently": 1885, "dense": 1886, "gemms": 1887, "hopper": 1888, "usual": 1889, "fashion": 1890, "own": 1891, "recursive": 1892, "uv": 1893, "console": 1894, "benchmark_fp8_block_dense_gemm": 1895, "info": 1896, "__init__": 1897, "207": 1898, "automatically": 1899, "detected": 1900, "platform": 1901, "gemm": 1902, "cu124": 1903, "device": 1904, "80gb": 1905, "hbm3": 1906, "fp8_utils": 1907, "458": 1908, "w8a8": 1909, "kernel": 1910, "sub": 1911, "mgoin": 1912, "model_executor": 1913, "layers": 1914, "utils": 1915, "configs": 1916, "7168": 1917, "device_name": 1918, "nvidia_h100_80gb_hbm3": 1919, "fp8_w8a8": 1920, "block_shape": 1921, "449": 1922, "18432": 1923, "24576": 1924, "1536": 1925, "32768": 1926, "16384": 1927, "comparison": 1928, "implementation": 1929, "μs": 1930, "tflops": 1931, "gb": 1932, "102": 1933, "286": 1934, "29": 1935, "1868": 1936, "1911": 1937, "439": 1938, "243": 1939, "1933": 1940, "240": 1941, "1917": 1942, "68": 1943, "584": 1944, "307": 1945, "216": 1946, "1718": 1947, "141": 1948, "222": 1949, "470": 1950, "1896": 1951, "488": 1952, "1988": 1953, "670": 1954, "502": 1955, "279": 1956, "969": 1957, "635": 1958, "175": 1959, "687": 1960, "347": 1961, "335": 1962, "717": 1963, "275": 1964, "vs": 1965, "398": 1966, "39x": 1967, "faster": 1968, "1478": 1969, "79x": 1970, "slower": 1971, "113": 1972, "1170": 1973, "61x": 1974, "47": 1975, "87x": 1976, "171": 1977, "1363": 1978, "70x": 1979, "1129": 1980, "59x": 1981, "1089": 1982, "86x": 1983, "38": 1984, "542": 1985, "77x": 1986, "86": 1987, "174": 1988, "1386": 1989, "81x": 1990, "82": 1991, "345": 1992, "56x": 1993, "144": 1994, "234": 1995, "946": 1996, "50x": 1997, "229": 1998, "147": 1999, "600": 2000, "30x": 2001, "242": 2002, "248": 2003, "186": 2004, "37x": 2005, "897": 2006, "301": 2007, "197": 2008, "31x": 2009, "463": 2010, "259": 2011, "131": 2012, "38x": 2013, "901": 2014, "266": 2015, "34": 2016, "852": 2017, "98x": 2018, "14x": 2019, "1677": 2020, "90x": 2021, "13x": 2022, "81": 2023, "1631": 2024, "85x": 2025, "36": 2026, "101": 2027, "822": 2028, "15x": 2029, "87": 2030, "193": 2031, "1535": 2032, "199": 2033, "1587": 2034, "83x": 2035, "41x": 2036, "172": 2037, "1465": 2038, "51x": 2039, "35x": 2040, "728": 2041, "34x": 2042, "1532": 2043, "89x": 2044, "11x": 2045, "192": 2046, "802": 2047, "32x": 2048, "93": 2049, "360": 2050, "1454": 2051, "54x": 2052, "394": 2053, "1608": 2054, "68x": 2055, "603": 2056, "452": 2057, "43x": 2058, "331": 2059, "816": 2060, "534": 2061, "84x": 2062, "71x": 2063, "198": 2064, "606": 2065, "306": 2066, "88x": 2067, "392": 2068, "613": 2069, "235": 2070, "average": 2071, "avg": 2072, "310": 2073, "1052": 2074, "715": 2075, "1076": 2076, "speedups": 2077, "94x": 2078, "epilogues": 2079, "introduction": 2080, "describes": 2081, "implemented": 2082, "fusing": 2083, "operations": 2084, "onto": 2085, "symmetric": 2086, "asymmetric": 2087, "activations": 2088, "quantized": 2089, "scaledepilogue": 2090, "bias": 2091, "scaledepiloguebias": 2092, "scaledepilogueazp": 2093, "scaledepilogueazppertoken": 2094, "reduce": 2095, "instead": 2096, "passed": 2097, "epilogue": 2098, "induces": 2099, "redundant": 2100, "addition": 2101, "operation": 2102, "runtime": 2103, "underlying": 2104, "algebra": 2105, "activation": 2106, "rfc": 2107, "3975": 2108, "widehat": 2109, "matrices": 2110, "math": 2111, "s_a": 2112, "j_a": 2113, "z_a": 2114, "s_b": 2115, "scales": 2116, "respectively": 2117, "point": 2118, "matrix": 2119, "ones": 2120, "dimensions": 2121, "expanding": 2122, "further": 2123, "calculate": 2124, "left": 2125, "known": 2126, "ahead": 2127, "equal": 2128, "mathbf": 2129, "vector": 2130, "column": 2131, "sums": 2132, "computes": 2133, "meaning": 2134, "scale_a": 2135, "scalar": 2136, "scale_b": 2137, "always": 2138, "because": 2139, "term": 2140, "precomputed": 2141, "stored": 2142, "azp_with_adj": 2143, "points": 2144, "efficiently": 2145, "precompute": 2146, "pass": 2147, "above": 2148, "means": 2149, "becomes": 2150, "outer": 2151, "product": 2152, "azp_adj": 2153, "adjustment": 2154, "azp": 2155, "computation": 2156, "dq": 2157, "machete": 2158, "mixed": 2159, "precision": 2160, "spiritual": 2161, "successor": 2162, "marlin": 2163, "architectures": 2164, "pairs": 2165, "easier": 2166, "add": 2167, "compared": 2168, "scale_type": 2169, "w_s": 2170, "compute_type": 2171, "w_q": 2172, "w_z": 2173, "weight": 2174, "zeropoints": 2175, "fma": 2176, "pre": 2177, "applied": 2178, "supplied": 2179, "assume": 2180, "subtracted": 2181, "optimization": 2182, "prepacking": 2183, "closely": 2184, "match": 2185, "core": 2186, "layouts": 2187, "allowing": 2188, "wider": 2189, "shared": 2190, "loads": 2191, "loading": 2192, "prepacked": 2193, "calling": 2194, "machete_gemm": 2195, "flow": 2196, "looks": 2197, "something": 2198, "import": 2199, "_custom_ops": 2200, "ops": 2201, "w_q_packed": 2202, "machete_prepack_b": 2203, "wtype": 2204, "b_q": 2205, "b_type": 2206, "b_scales": 2207, "b_group_size": 2208, "group_size": 2209, "generate": 2210, "shapes": 2211, "instantiations": 2212, "transfer": 2213, "folder": 2214, "implements": 2215, "across": 2216, "usecase": 2217, "disaggregated": 2218, "prefilling": 2219, "abstractions": 2220, "three": 2221, "layer": 2222, "pipe": 2223, "fifo": 2224, "transmission": 2225, "apis": 2226, "send_tensor": 2227, "recv_tensor": 2228, "lookup": 2229, "buffer": 2230, "caches": 2231, "hidden": 2232, "states": 2233, "insert": 2234, "drop_select": 2235, "semantics": 2236, "connector": 2237, "connects": 2238, "send_kv_caches_and_hidden_states": 2239, "recv_kv_caches_and_hidden_states": 2240, "enough": 2241, "worker": 2242, "decode": 2243, "say": 2244, "qps": 2245, "really": 2246, "naturally": 2247, "handled": 2248, "provide": 2249, "help": 2250, "translate": 2251, "bypassible": 2252, "redis": 2253, "rdma": 2254, "database": 2255, "adjust": 2256, "receive": 2257, "bypass": 2258, "directly": 2259, "implement": 2260, "bear": 2261, "mind": 2262, "constantly": 2263, "changing": 2264, "likely": 2265, "broken": 2266, "updates": 2267, "online_serving": 2268, "disaggregated_prefill": 2269, "diagram": 2270, "resolver": 2271, "plugins": 2272, "general": 2273, "dynamically": 2274, "discovering": 2275, "loraresolver": 2276, "plugin": 2277, "framework": 2278, "vllm_allow_runtime_lora_updating": 2279, "true": 2280, "vllm_plugins": 2281, "lora_filesystem_resolver": 2282, "installed": 2283, "vllm_plugin_lora_cache_dir": 2284, "receives": 2285, "adapter": 2286, "foobar": 2287, "doesn": 2288, "recognize": 2289, "look": 2290, "subdirectory": 2291, "containing": 2292, "exists": 2293, "normal": 2294, "class": 2295, "provides": 2296, "primary": 2297, "interface": 2298, "doing": 2299, "interacting": 2300, "separate": 2301, "shows": 2302, "offline_inference": 2303, "rest": 2304, "scripts": 2305, "argument": 2306, "parser": 2307, "argparse": 2308, "try": 2309, "classify": 2310, "embed": 2311, "score": 2312, "accept": 2313, "inference_params": 2314, "max_tokens": 2315, "top_p": 2316, "top_k": 2317, "passing": 2318, "experiment": 2319, "specifies": 2320, "loaded": 2321, "get_default_sampling_params": 2322, "max_new_tokens": 2323, "sets": 2324, "wide": 2325, "gguf": 2326, "one": 2327, "downloading": 2328, "huggingface_hub": 2329, "hf_hub_download": 2330, "repo_id": 2331, "bartowski": 2332, "phi": 2333, "4k": 2334, "iq2_m": 2335, "print": 2336, "printed": 2337, "tokenizer": 2338, "microsoft": 2339, "cpu": 2340, "offload": 2341, "seen": 2342, "virtual": 2343, "way": 2344, "increase": 2345, "virtually": 2346, "think": 2347, "13b": 2348, "bf16": 2349, "requires": 2350, "least": 2351, "26gb": 2352, "interconnect": 2353, "part": 2354, "fly": 2355, "forward": 2356, "omni": 2357, "several": 2358, "thinker": 2359, "audio": 2360, "video": 2361, "qwen2_5_omni": 2362, "only_thinker": 2363, "mixed_modalities": 2364, "read": 2365, "interleaved": 2366, "modalities": 2367, "use_audio_in_video": 2368, "audios": 2369, "multi_audios": 2370, "modality": 2371, "audio_language": 2372, "vision_language": 2373, "profiling": 2374, "actual": 2375, "mix": 2376, "many": 2377, "v6e": 2378, "according": 2379, "google_tpu": 2380, "warmups": 2381, "enforce": 2382, "eager": 2383, "okay": 2384, "attempt": 2385, "xla_hlo_debug": 2386, "vllm_tpu_profile_duration_ms": 2387, "vllm_tpu_profile_delay_ms": 2388, "batch": 2389, "70b": 2390, "32": 2391, "decodes": 2392, "having": 2393, "extremely": 2394, "small": 2395, "hopefully": 2396, "rm": 2397, "rf": 2398, "xla_cache": 2399, "visualizing": 2400, "collected": 2401, "visualize": 2402, "tensorboard": 2403, "xla": 2404, "vm": 2405, "dependencies": 2406, "tensorflow": 2407, "etils": 2408, "importlib_resources": 2409, "http": 2410, "localhost": 2411, "6006": 2412, "browser": 2413, "important": 2414, "consists": 2415, "objects": 2416, "lines": 2417, "openai_batch": 2418, "openai_example_batch": 2419, "line": 2420, "represents": 2421, "package": 2422, "reference": 2423, "requestinput": 2424, "embeddings": 2425, "endpoints": 2426, "coming": 2427, "soon": 2428, "requisites": 2429, "create": 2430, "hub": 2431, "machine": 2432, "cli": 2433, "login": 2434, "gated": 2435, "visiting": 2436, "card": 2437, "agreeing": 2438, "along": 2439, "working": 2440, "cat": 2441, "custom_id": 2442, "url": 2443, "messages": 2444, "role": 2445, "helpful": 2446, "hello": 2447, "world": 2448, "max_completion_tokens": 2449, "unhelpful": 2450, "designed": 2451, "called": 2452, "run_batch": 2453, "383d1c59835645aeb2e07d004d62a826": 2454, "cmpl": 2455, "61c020e54b964d5a98fa7527bfcdd378": 2456, "object": 2457, "1715633336": 2458, "message": 2459, "great": 2460, "tasks": 2461, "today": 2462, "logprobs": 2463, "null": 2464, "finish_reason": 2465, "stop": 2466, "stop_reason": 2467, "prompt_tokens": 2468, "total_tokens": 2469, "completion_tokens": 2470, "42e3d09b14b04568afa3f1797751a267": 2471, "f44d049f6b3a42d4b2d7850bb1e31bcc": 2472, "silence": 2473, "runner": 2474, "urls": 2475, "located": 2476, "integrating": 2477, "integrate": 2478, "storage": 2479, "recommend": 2480, "presigned": 2481, "bucket": 2482, "amazon": 2483, "amazons3": 2484, "userguide": 2485, "creating": 2486, "awscli": 2487, "credentials": 2488, "interactively": 2489, "boto3": 2490, "upload": 2491, "cp": 2492, "my_bucket": 2493, "my_input_file": 2494, "sdk": 2495, "sure": 2496, "replace": 2497, "my_output_file": 2498, "placeholders": 2499, "names": 2500, "awsdocs": 2501, "doc": 2502, "example_code": 2503, "s3_basics": 2504, "presigned_url": 2505, "botocore": 2506, "exceptions": 2507, "clienterror": 2508, "def": 2509, "generate_presigned_url": 2510, "s3_client": 2511, "client_method": 2512, "method_parameters": 2513, "expires_in": 2514, "param": 2515, "seconds": 2516, "return": 2517, "clientmethod": 2518, "params": 2519, "expiresin": 2520, "except": 2521, "raise": 2522, "input_url": 2523, "get_object": 2524, "3600": 2525, "output_url": 2526, "put_object": 2527, "west": 2528, "amazonaws": 2529, "awsaccesskeyid": 2530, "abcdefghijklmnopqrst": 2531, "signature": 2532, "abcdefghijklmnopqrstuvwxyz12345": 2533, "expires": 2534, "1715800091": 2535, "view": 2536, "intfloat": 2537, "earlier": 2538, "db0f71f7dec244e6bce530e0b4ef908b": 2539, "status_code": 2540, "200": 2541, "request_id": 2542, "3580bf4d4ae54d52b67eee266a6eab20": 2543, "embd": 2544, "33ac2efa7996430184461f2e38529746": 2545, "444647": 2546, "016204833984375": 2547, "0092010498046875": 2548, "0018358230590820312": 2549, "0028228759765625": 2550, "001422882080078125": 2551, "0031147003173828125": 2552, "baai": 2553, "bge": 2554, "reranker": 2555, "m3": 2556, "text_1": 2557, "france": 2558, "text_2": 2559, "brazil": 2560, "brasilia": 2561, "paris": 2562, "demonstrate": 2563, "helper": 2564, "prefill_example": 2565, "decode_example": 2566, "sequentially": 2567, "local_storage": 2568, "leverages": 2569, "dictconfig": 2570, "functionality": 2571, "robust": 2572, "loggers": 2573, "offers": 2574, "accommodate": 2575, "simple": 2576, "inflexible": 2577, "complex": 2578, "vllm_configure_logging": 2579, "leaving": 2580, "vllm_logging_config_path": 2581, "unset": 2582, "leave": 2583, "fine": 2584, "grained": 2585, "controls": 2586, "whether": 2587, "takes": 2588, "enabled": 2589, "disabled": 2590, "root": 2591, "logger": 2592, "configured": 2593, "defer": 2594, "occur": 2595, "while": 2596, "allows": 2597, "specify": 2598, "alternative": 2599, "dictionary": 2600, "customize": 2601, "nhairs": 2602, "container": 2603, "stdout": 2604, "begin": 2605, "logging_config": 2606, "formatters": 2607, "pythonjsonlogger": 2608, "jsonlogger": 2609, "jsonformatter": 2610, "handlers": 2611, "streamhandler": 2612, "formatter": 2613, "stream": 2614, "ext": 2615, "sys": 2616, "propagate": 2617, "false": 2618, "finally": 2619, "mistralai": 2620, "particular": 2621, "necessary": 2622, "target": 2623, "configures": 2624, "won": 2625, "overrides": 2626, "logging_utils": 2627, "newlineformatter": 2628, "datefmt": 2629, "levelname": 2630, "asctime": 2631, "lineno": 2632, "debug": 2633, "example_noisy_logger": 2634, "configuring": 2635, "silences": 2636, "lmcache": 2637, "demonstrates": 2638, "nixl": 2639, "simply": 2640, "dynamo": 2641, "hf_token": 2642, "disagg_prefill_lmcache_v1": 2643, "disagg_example_nixl": 2644, "components": 2645, "disagg_vllm_launcher": 2646, "launches": 2647, "servers": 2648, "proxy": 2649, "disagg_proxy_server": 2650, "fastapi": 2651, "coordinates": 2652, "prefiller": 2653, "decoder": 2654, "yaml": 2655, "generates": 2656, "cpu_offload_lmcache": 2657, "kv_cache_sharing_lmcache_v1": 2658, "share": 2659, "helm": 2660, "charts": 2661, "chart": 2662, "deploying": 2663, "application": 2664, "autoscaling": 2665, "resource": 2666, "defines": 2667, "metadata": 2668, "maintainers": 2669, "ct": 2670, "lintconf": 2671, "linting": 2672, "rules": 2673, "validating": 2674, "templates": 2675, "_helpers": 2676, "tpl": 2677, "defining": 2678, "configmap": 2679, "configmaps": 2680, "kubernetes": 2681, "deployments": 2682, "hpa": 2683, "horizontal": 2684, "pod": 2685, "autoscaler": 2686, "job": 2687, "jobs": 2688, "poddisruptionbudget": 2689, "pvc": 2690, "persistent": 2691, "volume": 2692, "claims": 2693, "secrets": 2694, "services": 2695, "prometheus": 2696, "grafana": 2697, "connect": 2698, "metric": 2699, "stack": 2700, "launch": 2701, "docker": 2702, "methods": 2703, "websites": 2704, "compose": 2705, "linux": 2706, "entrypoint": 2707, "submit": 2708, "navigating": 2709, "8000": 2710, "metrics": 2711, "exposed": 2712, "username": 2713, "admin": 2714, "password": 2715, "connections": 2716, "datasources": 2717, "select": 2718, "page": 2719, "containers": 2720, "creates": 2721, "dns": 2722, "9090": 2723, "click": 2724, "green": 2725, "saying": 2726, "successfully": 2727, "queried": 2728, "datasource": 2729, "opentelemetry": 2730, "poc": 2731, "packages": 2732, "exporter": 2733, "otlp": 2734, "semantic": 2735, "conventions": 2736, "jaeger": 2737, "jaegertracing": 2738, "collector_zipkin_host_port": 2739, "9411": 2740, "6831": 2741, "udp": 2742, "6832": 2743, "5778": 2744, "16686": 2745, "4317": 2746, "4318": 2747, "14250": 2748, "14268": 2749, "14269": 2750, "shell": 2751, "jaeger_ip": 2752, "inspect": 2753, "networksettings": 2754, "ipaddress": 2755, "otel_exporter_otlp_traces_endpoint": 2756, "grpc": 2757, "insecure": 2758, "otel_service_name": 2759, "otel_exporter_otlp_traces_insecure": 2760, "facebook": 2761, "opt": 2762, "125m": 2763, "traces": 2764, "context": 2765, "dummy": 2766, "dummy_client": 2767, "webui": 2768, "pane": 2769, "imgur": 2770, "gyhhfjo": 2771, "clicking": 2772, "spans": 2773, "tags": 2774, "demo": 2775, "opf6cbl": 2776, "protocol": 2777, "protobuf": 2778, "transport": 2779, "otel_exporter_otlp_traces_protocol": 2780, "instrumentation": 2781, "instrument": 2782, "processing": 2783, "exceeds": 2784, "quick": 2785, "texts": 2786, "jinaai": 2787, "jina": 2788, "max_embed_len": 2789, "1048576": 2790, "multilingual": 2791, "3072000": 2792, "comprehensive": 2793, "startup": 2794, "override": 2795, "pooler": 2796, "pooling_type": 2797, "normalize": 2798, "enable_chunked_processing": 2799, "pooling": 2800, "chunk": 2801, "cross": 2802, "aggregation": 2803, "native": 2804, "component": 2805, "chunks": 2806, "weighted": 2807, "averaging": 2808, "processed": 2809, "31090": 2810, "gpu_count": 2811, "cls": 2812, "last": 2813, "affects": 2814, "api_key": 2815, "empty": 2816, "authentication": 2817, "longer": 2818, "smart": 2819, "chunking": 2820, "max_position_embeddings": 2821, "maintain": 2822, "unified": 2823, "separately": 2824, "combined": 2825, "dimensionality": 2826, "handling": 2827, "accepted": 2828, "rejected": 2829, "vllm_allow_long_max_model_len": 2830, "extreme": 2831, "academic": 2832, "papers": 2833, "references": 2834, "legal": 2835, "contracts": 2836, "books": 2837, "chapters": 2838, "repositories": 2839, "codebases": 2840, "aspect": 2841, "minimal": 2842, "proportional": 2843, "scalable": 2844, "quality": 2845, "baseline": 2846, "100k": 2847, "consistency": 2848, "reproducible": 2849, "troubleshooting": 2850, "valueerror": 2851, "position": 2852, "solution": 2853, "runtimeerror": 2854, "adjusting": 2855, "fewer": 2856, "slow": 2857, "expected": 2858, "calls": 2859, "activity": 2860, "150000": 2861, "max_chunk_size": 2862, "extend": 2863, "architecture": 2864, "lengths": 2865, "validate": 2866, "disagg_proxy_demo": 2867, "xpyd": 2868, "kv_events": 2869, "capabilities": 2870, "responses": 2871, "concurrent": 2872, "3b": 2873, "reasoning": 2874, "r1": 2875, "distill": 2876, "deepseek_r1": 2877, "standalone": 2878, "uvx": 2879, "structured_outputs": 2880, "tip": 2881, "remotely": 2882, "openai_base_url": 2883, "remote_url": 2884, "structural_tag": 2885, "hide": 2886, "navigation": 2887, "toc": 2888, "figure": 2889, "markdown": 2890, "span": 2891, "buttons": 2892, "button": 2893, "aria": 2894, "label": 2895, "star": 2896, "subscription": 2897, "icon": 2898, "octicon": 2899, "eye": 2900, "watch": 2901, "fork": 2902, "repo": 2903, "forked": 2904, "depends": 2905, "looking": 2906, "applications": 2907, "roadmap": 2908, "gaudi": 2909, "accelerators": 2910, "power": 2911, "trainium": 2912, "inferentia": 2913, "generative": 2914, "covers": 2915, "vllmmodelfortextgeneration": 2916, "probabilities": 2917, "sampler": 2918, "obtain": 2919, "option": 2920, "vast": 2921, "majority": 2922, "detect": 2923, "options": 2924, "initializing": 2925, "counterpart": 2926, "transformers": 2927, "main_classes": 2928, "text_generation": 2929, "generationmixin": 2930, "tokenization": 2931, "detokenization": 2932, "my": 2933, "generated_text": 2934, "optionally": 2935, "samplingparams": 2936, "greedy": 2937, "creator": 2938, "generation_config": 2939, "however": 2940, "preferred": 2941, "instance": 2942, "beam_search": 2943, "generation_strategies": 2944, "beams": 2945, "sampling_params": 2946, "beamsearchparams": 2947, "beam_width": 2948, "accepts": 2949, "chat_templating": 2950, "instruction": 2951, "tuned": 2952, "poorly": 2953, "trained": 2954, "respond": 2955, "assist": 2956, "essay": 2957, "importance": 2958, "higher": 2959, "another": 2960, "explicitly": 2961, "chat_utils": 2962, "load_chat_template": 2963, "custom_template": 2964, "chat_template": 2965, "path_to_template": 2966, "openai_compatible_server": 2967, "correspond": 2968, "classification": 2969, "reward": 2970, "vllmmodelforpooling": 2971, "extract": 2972, "returning": 2973, "primarily": 2974, "matter": 2975, "convenience": 2976, "guaranteed": 2977, "improvement": 2978, "sentence": 2979, "planning": 2980, "optimize": 2981, "comment": 2982, "21796": 2983, "suggestions": 2984, "conversion": 2985, "adapt": 2986, "been": 2987, "manually": 2988, "shown": 2989, "fortextencoding": 2990, "embeddingmodel": 2991, "encode": 2992, "classificationmodel": 2993, "forrewardmodeling": 2994, "rewardmodel": 2995, "get_supported_tasks": 2996, "enabling": 2997, "task": 2998, "falls": 2999, "back": 3000, "predefined": 3001, "defined": 3002, "pooler_config": 3003, "attributes": 3004, "converted": 3005, "assigned": 3006, "normalization": 3007, "softmax": 3008, "modules": 3009, "embeds": 3010, "probability": 3011, "jason9693": 3012, "5b": 3013, "apeach": 3014, "probs": 3015, "similarity": 3016, "encoder": 3017, "cosine": 3018, "sbert": 3019, "net": 3020, "rerankers": 3021, "candidate": 3022, "query": 3023, "rag": 3024, "reranking": 3025, "frameworks": 3026, "langchain": 3027,