{"vllm": 0, "code": 1, "conduct": 2, "our": 3, "pledge": 4, "we": 5, "members": 6, "contributors": 7, "leaders": 8, "make": 9, "participation": 10, "community": 11, "harassment": 12, "free": 13, "experience": 14, "everyone": 15, "regardless": 16, "age": 17, "body": 18, "size": 19, "visible": 20, "invisible": 21, "disability": 22, "ethnicity": 23, "sex": 24, "characteristics": 25, "gender": 26, "identity": 27, "expression": 28, "level": 29, "education": 30, "socioeconomic": 31, "status": 32, "nationality": 33, "personal": 34, "appearance": 35, "race": 36, "caste": 37, "color": 38, "religion": 39, "sexual": 40, "orientation": 41, "act": 42, "interact": 43, "ways": 44, "contribute": 45, "open": 46, "welcoming": 47, "diverse": 48, "inclusive": 49, "healthy": 50, "standards": 51, "examples": 52, "behavior": 53, "contributes": 54, "positive": 55, "environment": 56, "include": 57, "demonstrating": 58, "empathy": 59, "kindness": 60, "toward": 61, "other": 62, "people": 63, "being": 64, "respectful": 65, "differing": 66, "opinions": 67, "viewpoints": 68, "experiences": 69, "giving": 70, "gracefully": 71, "accepting": 72, "constructive": 73, "feedback": 74, "responsibility": 75, "apologizing": 76, "those": 77, "affected": 78, "mistakes": 79, "learning": 80, "from": 81, "focusing": 82, "what": 83, "best": 84, "just": 85, "us": 86, "individuals": 87, "overall": 88, "unacceptable": 89, "use": 90, "sexualized": 91, "language": 92, "imagery": 93, "attention": 94, "advances": 95, "any": 96, "kind": 97, "trolling": 98, "insulting": 99, "derogatory": 100, "comments": 101, "political": 102, "attacks": 103, "public": 104, "private": 105, "publishing": 106, "others": 107, "information": 108, "physical": 109, "email": 110, "address": 111, "without": 112, "explicit": 113, "permission": 114, "which": 115, "could": 116, "reasonably": 117, "considered": 118, "inappropriate": 119, "professional": 120, "setting": 121, "enforcement": 122, "responsibilities": 123, "responsible": 124, "clarifying": 125, "enforcing": 126, "acceptable": 127, "take": 128, "appropriate": 129, "fair": 130, "corrective": 131, "action": 132, "response": 133, "deem": 134, "threatening": 135, "offensive": 136, "harmful": 137, "have": 138, "right": 139, "remove": 140, "edit": 141, "reject": 142, "commits": 143, "wiki": 144, "edits": 145, "issues": 146, "contributions": 147, "aligned": 148, "communicate": 149, "reasons": 150, "moderation": 151, "decisions": 152, "when": 153, "scope": 154, "applies": 155, "within": 156, "all": 157, "spaces": 158, "also": 159, "individual": 160, "officially": 161, "representing": 162, "using": 163, "official": 164, "posting": 165, "via": 166, "social": 167, "media": 168, "account": 169, "acting": 170, "appointed": 171, "representative": 172, "online": 173, "offline": 174, "irl": 175, "event": 176, "instances": 177, "abusive": 178, "harassing": 179, "otherwise": 180, "may": 181, "reported": 182, "channel": 183, "slack": 184, "https": 185, "ai": 186, "complaints": 187, "reviewed": 188, "investigated": 189, "promptly": 190, "fairly": 191, "obligated": 192, "respect": 193, "privacy": 194, "security": 195, "reporter": 196, "incident": 197, "guidelines": 198, "follow": 199, "impact": 200, "determining": 201, "consequences": 202, "violation": 203, "correction": 204, "deemed": 205, "unprofessional": 206, "unwelcome": 207, "consequence": 208, "written": 209, "warning": 210, "providing": 211, "clarity": 212, "around": 213, "nature": 214, "explanation": 215, "why": 216, "apology": 217, "requested": 218, "through": 219, "single": 220, "series": 221, "actions": 222, "continued": 223, "interaction": 224, "involved": 225, "including": 226, "unsolicited": 227, "specified": 228, "period": 229, "time": 230, "includes": 231, "avoiding": 232, "interactions": 233, "well": 234, "external": 235, "channels": 236, "like": 237, "violating": 238, "terms": 239, "lead": 240, "temporary": 241, "permanent": 242, "ban": 243, "serious": 244, "sustained": 245, "sort": 246, "communication": 247, "allowed": 248, "during": 249, "pattern": 250, "aggression": 251, "disparagement": 252, "classes": 253, "attribution": 254, "adapted": 255, "contributor": 256, "covenant": 257, "www": 258, "org": 259, "version": 260, "available": 261, "v2": 262, "code_of_conduct": 263, "html": 264, "were": 265, "inspired": 266, "mozilla": 267, "ladder": 268, "github": 269, "com": 270, "inclusion": 271, "answers": 272, "common": 273, "questions": 274, "about": 275, "see": 276, "faq": 277, "translations": 278, "contributing": 279, "you": 280, "find": 281, "docs": 282, "en": 283, "latest": 284, "markdownlint": 285, "disable": 286, "md001": 287, "md041": 288, "align": 289, "center": 290, "picture": 291, "source": 292, "prefers": 293, "scheme": 294, "dark": 295, "srcset": 296, "raw": 297, "githubusercontent": 298, "project": 299, "main": 300, "assets": 301, "logos": 302, "logo": 303, "text": 304, "png": 305, "img": 306, "alt": 307, "src": 308, "light": 309, "width": 310, "55": 311, "h3": 312, "easy": 313, "fast": 314, "cheap": 315, "llm": 316, "serving": 317, "href": 318, "documentation": 319, "blog": 320, "arxiv": 321, "abs": 322, "2309": 323, "06180": 324, "paper": 325, "vllm_project": 326, "twitter": 327, "discuss": 328, "user": 329, "forum": 330, "developer": 331, "news": 332, "2025": 333, "08": 334, "hosted": 335, "beijing": 336, "meetup": 337, "mp": 338, "weixin": 339, "qq": 340, "dgkwg1wfpwgo2jcdtqqhxa": 341, "large": 342, "scale": 343, "deployment": 344, "please": 345, "slides": 346, "here": 347, "drive": 348, "google": 349, "folders": 350, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 351, "recording": 352, "chaspark": 353, "live": 354, "1166916873711665152": 355, "05": 356, "nyc": 357, "lu": 358, "ma": 359, "c1rqyf1f": 360, "presentation": 361, "1_q_aw_iomjwuimf1s1ym": 362, "zhjxz8cuel0ijvaquoybea": 363, "usp": 364, "sharing": 365, "now": 366, "under": 367, "pytorch": 368, "foundation": 369, "announcement": 370, "welcomes": 371, "01": 372, "excited": 373, "announce": 374, "alpha": 375, "release": 376, "v1": 377, "major": 378, "architectural": 379, "upgrade": 380, "7x": 381, "speedup": 382, "clean": 383, "optimized": 384, "execution": 385, "loop": 386, "zero": 387, "overhead": 388, "prefix": 389, "caching": 390, "enhanced": 391, "multimodal": 392, "support": 393, "more": 394, "check": 395, "out": 396, "post": 397, "27": 398, "details": 399, "summary": 400, "previous": 401, "04": 402, "asia": 403, "day": 404, "sginnovate": 405, "limited": 406, "availability": 407, "morning": 408, "evening": 409, "slots": 410, "remaining": 411, "inaugural": 412, "team": 413, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 414, "03": 415, "ollama": 416, "inference": 417, "night": 418, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 419, "first": 420, "china": 421, "n77gibl2coratqhtveazfg": 422, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 423, "east": 424, "coast": 425, "7mu4k4xx": 426, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 427, "slide": 428, "id": 429, "g31441846c39_0_0": 430, "02": 431, "ninth": 432, "h7g3kuj9": 433, "meta": 434, "1jzc_pzvxrvnsfvcw": 435, "v4cfxb6pn7zz2cyp_flwo05aqg": 436, "amd": 437, "file": 438, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 439, "view": 440, "posted": 441, "eighth": 442, "zep56hui": 443, "cloud": 444, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 445, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 446, "2024": 447, "12": 448, "joins": 449, "ecosystem": 450, "11": 451, "seventh": 452, "h0qvrajz": 453, "snowflake": 454, "1e3cxqbv3jsfgp30swyvs3em_tw": 455, "ghohj9pajgk6kr54": 456, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 457, "10": 458, "created": 459, "coordinating": 460, "discussing": 461, "features": 462, "feel": 463, "join": 464, "ray": 465, "summit": 466, "held": 467, "special": 468, "track": 469, "opening": 470, "talk": 471, "1b_kqxphbtra_mdf": 472, "tr6i8rwdou5qotznceg2mkzxehm": 473, "learn": 474, "talks": 475, "youtube": 476, "playlist": 477, "list": 478, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 479, "users": 480, "09": 481, "sixth": 482, "87q3nvnh": 483, "nvidia": 484, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 485, "9wqyp7ny93xrs": 486, "07": 487, "fifth": 488, "lp0gyjqr": 489, "aws": 490, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 491, "partnership": 492, "supports": 493, "llama": 494, "fp8": 495, "quantization": 496, "pipeline": 497, "parallelism": 498, "23": 499, "llama31": 500, "06": 501, "fourth": 502, "agivllm": 503, "cloudflare": 504, "bentoml": 505, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 506, "third": 507, "robloxandvllmmeetup2024": 508, "splashthat": 509, "roblox": 510, "1a": 511, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 512, "second": 513, "ygxbpzhl": 514, "ibm": 515, "12mi2skabnuw5rbwxdyy": 516, "hthth4imsnceoq10jdqbxga": 517, "2023": 518, "a16z": 519, "1ql": 520, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 521, "would": 522, "express": 523, "sincere": 524, "gratitude": 525, "andreessen": 526, "horowitz": 527, "30": 528, "supporting": 529, "generous": 530, "grant": 531, "development": 532, "research": 533, "released": 534, "fastchat": 535, "integration": 536, "has": 537, "powered": 538, "lmsys": 539, "vicuna": 540, "chatbot": 541, "arena": 542, "chat": 543, "since": 544, "mid": 545, "april": 546, "library": 547, "originally": 548, "developed": 549, "sky": 550, "computing": 551, "lab": 552, "cs": 553, "berkeley": 554, "edu": 555, "uc": 556, "evolved": 557, "driven": 558, "both": 559, "academia": 560, "industry": 561, "state": 562, "art": 563, "throughput": 564, "efficient": 565, "management": 566, "key": 567, "value": 568, "memory": 569, "pagedattention": 570, "20": 571, "continuous": 572, "batching": 573, "incoming": 574, "requests": 575, "model": 576, "cuda": 577, "hip": 578, "graph": 579, "quantizations": 580, "gptq": 581, "2210": 582, "17323": 583, "awq": 584, "2306": 585, "00978": 586, "autoround": 587, "05516": 588, "int4": 589, "int8": 590, "kernels": 591, "flashattention": 592, "flashinfer": 593, "speculative": 594, "decoding": 595, "chunked": 596, "prefill": 597, "flexible": 598, "seamless": 599, "popular": 600, "hugging": 601, "face": 602, "models": 603, "high": 604, "various": 605, "algorithms": 606, "parallel": 607, "sampling": 608, "beam": 609, "search": 610, "tensor": 611, "data": 612, "expert": 613, "distributed": 614, "streaming": 615, "outputs": 616, "openai": 617, "compatible": 618, "api": 619, "server": 620, "gpus": 621, "cpus": 622, "intel": 623, "powerpc": 624, "tpu": 625, "neuron": 626, "multi": 627, "lora": 628, "seamlessly": 629, "most": 630, "huggingface": 631, "transformer": 632, "llms": 633, "mixture": 634, "mixtral": 635, "deepseek": 636, "v3": 637, "embedding": 638, "e5": 639, "mistral": 640, "modal": 641, "llava": 642, "full": 643, "supported": 644, "supported_models": 645, "getting": 646, "started": 647, "install": 648, "pip": 649, "getting_started": 650, "installation": 651, "gpu": 652, "index": 653, "build": 654, "wheel": 655, "bash": 656, "visit": 657, "quickstart": 658, "welcome": 659, "collaborations": 660, "how": 661, "get": 662, "sponsors": 663, "compute": 664, "resources": 665, "testing": 666, "following": 667, "organizations": 668, "thank": 669, "your": 670, "note": 671, "them": 672, "alphabetical": 673, "order": 674, "keep": 675, "consistent": 676, "md": 677, "cash": 678, "donations": 679, "dropbox": 680, "sequoia": 681, "capital": 682, "skywork": 683, "zhenfund": 684, "alibaba": 685, "anyscale": 686, "crusoe": 687, "databricks": 688, "deepinfra": 689, "lambda": 690, "nebius": 691, "novita": 692, "replicate": 693, "runpod": 694, "trainy": 695, "san": 696, "diego": 697, "sponsor": 698, "fundraising": 699, "venue": 700, "opencollective": 701, "plan": 702, "fund": 703, "maintenance": 704, "adoption": 705, "citation": 706, "cite": 707, "bibtex": 708, "inproceedings": 709, "kwon2023efficient": 710, "title": 711, "author": 712, "woosuk": 713, "kwon": 714, "zhuohan": 715, "li": 716, "siyuan": 717, "zhuang": 718, "ying": 719, "sheng": 720, "lianmin": 721, "zheng": 722, "cody": 723, "hao": 724, "yu": 725, "joseph": 726, "gonzalez": 727, "zhang": 728, "ion": 729, "stoica": 730, "booktitle": 731, "proceedings": 732, "acm": 733, "sigops": 734, "29th": 735, "symposium": 736, "operating": 737, "systems": 738, "principles": 739, "year": 740, "contact": 741, "start": 742, "technical": 743, "feature": 744, "fellow": 745, "disclosures": 746, "advisories": 747, "partnerships": 748, "lists": 749, "mailto": 750, "end": 751, "kit": 752, "wish": 753, "refer": 754, "repo": 755, "releasing": 756, "releases": 757, "offer": 758, "reliable": 759, "base": 760, "packaged": 761, "binary": 762, "format": 763, "can": 764, "conveniently": 765, "accessed": 766, "pypi": 767, "serve": 768, "milestones": 769, "newly": 770, "improvements": 771, "upcoming": 772, "changes": 773, "affect": 774, "potential": 775, "breaking": 776, "versioning": 777, "uses": 778, "shifted": 779, "where": 780, "new": 781, "patch": 782, "every": 783, "weeks": 784, "contain": 785, "bug": 786, "fixes": 787, "opposed": 788, "semver": 789, "contains": 790, "only": 791, "backwards": 792, "critical": 793, "need": 794, "made": 795, "post1": 796, "_major_": 797, "milestone": 798, "incompatible": 799, "similar": 800, "_minor_": 801, "_patch_": 802, "_post1_": 803, "_patch": 804, "1_": 805, "either": 806, "implicit": 807, "cadence": 808, "bi": 809, "weekly": 810, "basis": 811, "days": 812, "after": 813, "same": 814, "branch": 815, "future": 816, "dates": 817, "below": 818, "tentative": 819, "optional": 820, "date": 821, "versions": 822, "jan": 823, "feb": 824, "mar": 825, "apr": 826, "jun": 827, "jul": 828, "13": 829, "aug": 830, "14": 831, "15": 832, "sep": 833, "16": 834, "17": 835, "oct": 836, "18": 837, "19": 838, "nov": 839, "21": 840, "dec": 841, "22": 842, "each": 843, "built": 844, "dedicated": 845, "cut": 846, "performed": 847, "before": 848, "previously": 849, "reused": 850, "builds": 851, "triggered": 852, "push": 853, "rc": 854, "tag": 855, "vx": 856, "rc1": 857, "enables": 858, "test": 859, "multiple": 860, "rcs": 861, "final": 862, "does": 863, "trigger": 864, "used": 865, "notes": 866, "monitor": 867, "reverts": 868, "apply": 869, "cherry": 870, "pick": 871, "criteria": 872, "approach": 873, "finalizing": 874, "clear": 875, "picks": 876, "process": 877, "land": 878, "pr": 879, "typically": 880, "ensure": 881, "sufficient": 882, "complete": 883, "thorough": 884, "round": 885, "stable": 886, "regression": 887, "functional": 888, "performance": 889, "against": 890, "recent": 891, "severe": 892, "issue": 893, "silent": 894, "incorrectness": 895, "compatibility": 896, "crashes": 897, "deadlocks": 898, "leaks": 899, "introduced": 900, "specific": 901, "change": 902, "identifiers": 903, "ci": 904, "work": 905, "prs": 906, "merged": 907, "trunk": 908, "exception": 909, "manual": 910, "validations": 911, "e2e": 912, "validation": 913, "perform": 914, "regressions": 915, "benchmark": 916, "workflow": 917, "workflows": 918, "yml": 919, "current": 920, "coverage": 921, "llama3": 922, "llama4": 923, "hardware": 924, "h100": 925, "mi300x": 926, "_note": 927, "based": 928, "availability_": 929, "step": 930, "access": 931, "request": 932, "write": 933, "repository": 934, "run": 935, "review": 936, "setup": 937, "familiarize": 938, "yourself": 939, "configurations": 940, "tree": 941, "benchmarks": 942, "rocm": 943, "navigate": 944, "configure": 945, "set": 946, "v0": 947, "commit": 948, "hash": 949, "results": 950, "once": 951, "completes": 952, "dashboard": 953, "hud": 954, "reponame": 955, "2fvllm": 956, "corresponding": 957, "comparison": 958, "compare": 959, "verify": 960, "occurred": 961, "example": 962, "vs": 963, "starttime": 964, "thu": 965, "2c": 966, "2017": 967, "20apr": 968, "202025": 969, "2021": 970, "3a43": 971, "3a50": 972, "20gmt": 973, "stoptime": 974, "wed": 975, "2016": 976, "20jul": 977, "granularity": 978, "week": 979, "lbranch": 980, "lcommit": 981, "b6553be1bc75f046b00046a4ad7576364d03c835": 982, "rbranch": 983, "rcommit": 984, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 985, "benchmarkname": 986, "modelname": 987, "20models": 988, "backendname": 989, "20backends": 990, "modename": 991, "20modes": 992, "dtypename": 993, "20dtype": 994, "devicename": 995, "20devices": 996, "archname": 997, "20platforms": 998, "policy": 999, "reporting": 1000, "report": 1001, "privately": 1002, "vulnerability": 1003, "submission": 1004, "form": 1005, "triage": 1006, "reports": 1007, "triaged": 1008, "vulnerability_management": 1009, "threat": 1010, "guide": 1011, "usage": 1012, "assumptions": 1013, "recommendations": 1014, "blob": 1015, "securely": 1016, "severity": 1017, "determine": 1018, "risk": 1019, "taking": 1020, "dealing": 1021, "past": 1022, "defaults": 1023, "cases": 1024, "categories": 1025, "vulnerabilities": 1026, "allow": 1027, "remote": 1028, "attackers": 1029, "execute": 1030, "arbitrary": 1031, "control": 1032, "system": 1033, "significantly": 1034, "compromise": 1035, "confidentiality": 1036, "integrity": 1037, "privileges": 1038, "needed": 1039, "network": 1040, "deserialization": 1041, "exploit": 1042, "chains": 1043, "generally": 1044, "rated": 1045, "cvss": 1046, "flaws": 1047, "elevated": 1048, "rce": 1049, "contexts": 1050, "significant": 1051, "loss": 1052, "require": 1053, "advanced": 1054, "conditions": 1055, "some": 1056, "trust": 1057, "modes": 1058, "node": 1059, "privileged": 1060, "required": 1061, "scores": 1062, "between": 1063, "moderate": 1064, "cause": 1065, "denial": 1066, "service": 1067, "partial": 1068, "disruption": 1069, "do": 1070, "breach": 1071, "rating": 1072, "low": 1073, "minor": 1074, "informational": 1075, "logging": 1076, "errors": 1077, "non": 1078, "exploitable": 1079, "weaknesses": 1080, "local": 1081, "privilege": 1082, "negligible": 1083, "side": 1084, "collisions": 1085, "often": 1086, "less": 1087, "than": 1088, "prenotification": 1089, "certain": 1090, "prenotify": 1091, "vendors": 1092, "ship": 1093, "purpose": 1094, "coordinated": 1095, "notification": 1096, "adding": 1097, "contacts": 1098, "advisory": 1099, "few": 1100, "added": 1101, "group": 1102, "send": 1103, "copying": 1104, "vendor": 1105, "analyzed": 1106, "case": 1107, "withdraw": 1108, "receiving": 1109, "prenotifications": 1110, "membership": 1111, "refinements": 1112, "who": 1113, "included": 1114, "resolver": 1115, "plugins": 1116, "directory": 1117, "general": 1118, "dynamically": 1119, "discovering": 1120, "loading": 1121, "adapters": 1122, "loraresolver": 1123, "plugin": 1124, "framework": 1125, "vllm_allow_runtime_lora_updating": 1126, "must": 1127, "true": 1128, "vllm_plugins": 1129, "desired": 1130, "lora_filesystem_resolver": 1131, "installed": 1132, "default": 1133, "vllm_plugin_lora_cache_dir": 1134, "receives": 1135, "adapter": 1136, "foobar": 1137, "doesn": 1138, "currently": 1139, "recognize": 1140, "look": 1141, "subdirectory": 1142, "containing": 1143, "exists": 1144, "load": 1145, "normal": 1146, "kv": 1147, "cache": 1148, "transfer": 1149, "folder": 1150, "implements": 1151, "across": 1152, "usecase": 1153, "disaggregated": 1154, "prefilling": 1155, "abstractions": 1156, "three": 1157, "layer": 1158, "pipe": 1159, "fifo": 1160, "torch": 1161, "transmission": 1162, "apis": 1163, "send_tensor": 1164, "recv_tensor": 1165, "lookup": 1166, "buffer": 1167, "caches": 1168, "tokens": 1169, "hidden": 1170, "states": 1171, "insert": 1172, "drop_select": 1173, "sql": 1174, "semantics": 1175, "connector": 1176, "connects": 1177, "send_kv_caches_and_hidden_states": 1178, "recv_kv_caches_and_hidden_states": 1179, "itself": 1180, "enough": 1181, "worker": 1182, "different": 1183, "compared": 1184, "decode": 1185, "say": 1186, "qps": 1187, "really": 1188, "handle": 1189, "naturally": 1190, "handled": 1191, "so": 1192, "provide": 1193, "help": 1194, "translate": 1195, "bypassible": 1196, "skip": 1197, "already": 1198, "redis": 1199, "rdma": 1200, "database": 1201, "want": 1202, "adjust": 1203, "flow": 1204, "receive": 1205, "bypass": 1206, "directly": 1207, "implement": 1208, "bear": 1209, "mind": 1210, "input": 1211, "constantly": 1212, "changing": 1213, "implementation": 1214, "likely": 1215, "broken": 1216, "updates": 1217, "online_serving": 1218, "disaggregated_prefill": 1219, "sh": 1220, "diagram": 1221, "disagg_prefill_workflow": 1222, "jpg": 1223, "gputrc2graph": 1224, "py": 1225, "script": 1226, "processes": 1227, "nsight": 1228, "nsys": 1229, "trace": 1230, "files": 1231, "rep": 1232, "tracing": 1233, "enabled": 1234, "generates": 1235, "kernel": 1236, "summaries": 1237, "visualizations": 1238, "useful": 1239, "profiling": 1240, "analyzing": 1241, "profile": 1242, "output": 1243, "command": 1244, "line": 1245, "arguments": 1246, "in_file": 1247, "metadata": 1248, "entry": 1249, "should": 1250, "engine": 1251, "elapsed_nonprofiled_sec": 1252, "path": 1253, "name": 1254, "gpt": 1255, "oss": 1256, "ds": 1257, "wall": 1258, "clock": 1259, "runtime": 1260, "seconds": 1261, "specify": 1262, "elapsed": 1263, "inflate": 1264, "actual": 1265, "entries": 1266, "provided": 1267, "separated": 1268, "out_dir": 1269, "generated": 1270, "csv": 1271, "saved": 1272, "chart": 1273, "visualization": 1274, "nsys_cmd": 1275, "assumes": 1276, "sure": 1277, "pandas": 1278, "engines": 1279, "string": 1280, "python3": 1281, "analyze": 1282, "cycles": 1283, "collect": 1284, "config": 1285, "run1": 1286, "fork": 1287, "exec": 1288, "delay": 1289, "duration": 1290, "120b": 1291, "many": 1292, "collecting": 1293, "profiles": 1294, "aren": 1295, "captured": 1296, "till": 1297, "come": 1298, "up": 1299, "generation": 1300, "starts": 1301, "generating": 1302, "again": 1303, "total": 1304, "calculate": 1305, "cpu": 1306, "analysis": 1307, "306": 1308, "produce": 1309, "result": 1310, "categorizes": 1311, "names": 1312, "stacked": 1313, "bar": 1314, "shows": 1315, "mapped": 1316, "number": 1317, "due": 1318, "substages": 1319, "consist": 1320, "moe_gemm": 1321, "experts": 1322, "gemm": 1323, "biggest": 1324, "category": 1325, "148": 1326, "followed": 1327, "attn": 1328, "lets": 1329, "prioritize": 1330, "focus": 1331, "optimizations": 1332, "images": 1333, "appended": 1334, "table": 1335, "underneath": 1336, "processing": 1337, "tools": 1338, "html_tbl": 1339, "mapping": 1340, "suppose": 1341, "improving": 1342, "triton": 1343, "consumer": 1344, "74": 1345, "sec": 1346, "perhaps": 1347, "hasn": 1348, "been": 1349, "next": 1350, "dive": 1351, "compose": 1352, "image": 1353, "triton_poi_fused__to_copy_add_addmm_cat_": 1354, "csv1": 1355, "something": 1356, "100": 1357, "run2": 1358, "102": 1359, "stack": 1360, "charts": 1361, "remain": 1362, "shown": 1363, "one": 1364, "configuration": 1365, "another": 1366, "largest": 1367, "amount": 1368, "difference": 1369, "add": 1370, "classification": 1371, "abc": 1372, "def": 1373, "classified": 1374, "python": 1375, "engine_model": 1376, "layer_anno": 1377, "stage": 1378, "substage": 1379, "mem": 1380, "h_d_memops": 1381, "misc": 1382, "basically": 1383, "dictionary": 1384, "pairs": 1385, "keys": 1386, "regex": 1387, "values": 1388, "bins": 1389, "wishes": 1390, "last": 1391, "consisting": 1392, "operations": 1393, "anything": 1394, "leftover": 1395, "invoking": 1396, "infile": 1397, "cluster": 1398, "described": 1399, "http": 1400, "2412": 1401, "19437": 1402, "way": 1403, "deploy": 1404, "sparse": 1405, "moe": 1406, "however": 1407, "requires": 1408, "components": 1409, "beyond": 1410, "package": 1411, "driver": 1412, "impossible": 1413, "bundle": 1414, "break": 1415, "down": 1416, "requirements": 1417, "steps": 1418, "libraries": 1419, "pplx": 1420, "ppl": 1421, "deepep": 1422, "necessary": 1423, "dependencies": 1424, "nvshmem": 1425, "enable": 1426, "ibgda": 1427, "root": 1428, "done": 1429, "host": 1430, "machine": 1431, "scripts": 1432, "accept": 1433, "positional": 1434, "argument": 1435, "workspace": 1436, "staging": 1437, "defaulting": 1438, "pwd": 1439, "ep_kernels_workspace": 1440, "hopper": 1441, "torch_cuda_arch_list": 1442, "install_python_libraries": 1443, "blackwell": 1444, "additional": 1445, "sudo": 1446, "configure_system_drivers": 1447, "reboot": 1448, "leverages": 1449, "dictconfig": 1450, "functionality": 1451, "robust": 1452, "loggers": 1453, "offers": 1454, "two": 1455, "variables": 1456, "accommodate": 1457, "range": 1458, "simple": 1459, "inflexible": 1460, "complex": 1461, "vllm_configure_logging": 1462, "leaving": 1463, "vllm_logging_config_path": 1464, "unset": 1465, "leave": 1466, "fine": 1467, "grained": 1468, "custom": 1469, "json": 1470, "controls": 1471, "whether": 1472, "takes": 1473, "disabled": 1474, "running": 1475, "given": 1476, "logger": 1477, "configured": 1478, "defer": 1479, "error": 1480, "occur": 1481, "while": 1482, "starting": 1483, "allows": 1484, "alternative": 1485, "instead": 1486, "schema": 1487, "customize": 1488, "nhairs": 1489, "part": 1490, "container": 1491, "log": 1492, "stdout": 1493, "console": 1494, "info": 1495, "begin": 1496, "create": 1497, "logging_config": 1498, "formatters": 1499, "class": 1500, "pythonjsonlogger": 1501, "jsonlogger": 1502, "jsonformatter": 1503, "handlers": 1504, "streamhandler": 1505, "formatter": 1506, "stream": 1507, "ext": 1508, "sys": 1509, "propagate": 1510, "false": 1511, "finally": 1512, "variable": 1513, "mistralai": 1514, "7b": 1515, "max": 1516, "len": 1517, "2048": 1518, "silence": 1519, "particular": 1520, "target": 1521, "configures": 1522, "won": 1523, "its": 1524, "messages": 1525, "overrides": 1526, "logging_utils": 1527, "newlineformatter": 1528, "datefmt": 1529, "levelname": 1530, "asctime": 1531, "filename": 1532, "lineno": 1533, "message": 1534, "debug": 1535, "example_noisy_logger": 1536, "prevent": 1537, "configuring": 1538, "turn": 1539, "silences": 1540, "lmcache": 1541, "demonstrates": 1542, "offloading": 1543, "nixl": 1544, "prerequisites": 1545, "simply": 1546, "dynamo": 1547, "least": 1548, "valid": 1549, "token": 1550, "hf_token": 1551, "8b": 1552, "instruct": 1553, "cd": 1554, "disagg_prefill_lmcache_v1": 1555, "disagg_example_nixl": 1556, "disagg_vllm_launcher": 1557, "launches": 1558, "servers": 1559, "proxy": 1560, "disagg_proxy_server": 1561, "fastapi": 1562, "coordinates": 1563, "prefiller": 1564, "decoder": 1565, "configs": 1566, "yaml": 1567, "several": 1568, "logs": 1569, "offload": 1570, "cpu_offload_lmcache": 1571, "kv_cache_sharing_lmcache_v1": 1572, "share": 1573, "disaggregated_prefill_lmcache_v0": 1574, "provides": 1575, "structured": 1576, "capabilities": 1577, "constraint": 1578, "type": 1579, "responses": 1580, "concurrent": 1581, "choice": 1582, "qwen": 1583, "qwen2": 1584, "3b": 1585, "reasoning": 1586, "r1": 1587, "distill": 1588, "parser": 1589, "deepseek_r1": 1590, "standalone": 1591, "uv": 1592, "uvx": 1593, "git": 1594, "structured_outputs": 1595, "tip": 1596, "remotely": 1597, "openai_base_url": 1598, "remote_url": 1599, "constraints": 1600, "structural_tag": 1601, "prometheus": 1602, "grafana": 1603, "connect": 1604, "metric": 1605, "launch": 1606, "docker": 1607, "checkout": 1608, "methods": 1609, "io": 1610, "websites": 1611, "linux": 1612, "entrypoint": 1613, "submit": 1614, "sample": 1615, "wget": 1616, "co": 1617, "datasets": 1618, "anon8231489123": 1619, "sharegpt_vicuna_unfiltered": 1620, "resolve": 1621, "sharegpt_v3_unfiltered_cleaned_split": 1622, "bench": 1623, "tokenizer": 1624, "endpoint": 1625, "completions": 1626, "dataset": 1627, "sharegpt": 1628, "rate": 1629, "navigating": 1630, "localhost": 1631, "8000": 1632, "metrics": 1633, "show": 1634, "exposed": 1635, "3000": 1636, "username": 1637, "admin": 1638, "password": 1639, "connections": 1640, "datasources": 1641, "select": 1642, "page": 1643, "url": 1644, "connection": 1645, "separate": 1646, "containers": 1647, "creates": 1648, "dns": 1649, "9090": 1650, "click": 1651, "save": 1652, "green": 1653, "saying": 1654, "successfully": 1655, "queried": 1656, "import": 1657, "upload": 1658, "datasource": 1659, "screen": 1660, "looks": 1661, "imgur": 1662, "r2vh9vw": 1663, "opentelemetry": 1664, "poc": 1665, "packages": 1666, "sdk": 1667, "26": 1668, "exporter": 1669, "otlp": 1670, "semantic": 1671, "conventions": 1672, "jaeger": 1673, "jaegertracing": 1674, "57": 1675, "rm": 1676, "collector_zipkin_host_port": 1677, "9411": 1678, "6831": 1679, "udp": 1680, "6832": 1681, "5778": 1682, "16686": 1683, "4317": 1684, "4318": 1685, "14250": 1686, "14268": 1687, "14269": 1688, "shell": 1689, "export": 1690, "ip": 1691, "jaeger_ip": 1692, "inspect": 1693, "networksettings": 1694, "ipaddress": 1695, "otel_exporter_otlp_traces_endpoint": 1696, "grpc": 1697, "insecure": 1698, "otel_service_name": 1699, "otel_exporter_otlp_traces_insecure": 1700, "facebook": 1701, "opt": 1702, "125m": 1703, "traces": 1704, "context": 1705, "dummy": 1706, "client": 1707, "dummy_client": 1708, "webui": 1709, "pane": 1710, "hit": 1711, "gyhhfjo": 1712, "clicking": 1713, "spans": 1714, "tags": 1715, "demo": 1716, "prompt": 1717, "opf6cbl": 1718, "protocol": 1719, "protobuf": 1720, "transport": 1721, "otel_exporter_otlp_traces_protocol": 1722, "follows": 1723, "instrumentation": 1724, "automatic": 1725, "instrument": 1726, "hywvooj": 1727, "long": 1728, "exceeds": 1729, "maximum": 1730, "length": 1731, "quick": 1732, "basic": 1733, "very": 1734, "texts": 1735, "3m": 1736, "model_name": 1737, "jinaai": 1738, "jina": 1739, "embeddings": 1740, "max_embed_len": 1741, "1048576": 1742, "extremely": 1743, "documents": 1744, "intfloat": 1745, "multilingual": 1746, "3072000": 1747, "comprehensive": 1748, "description": 1749, "startup": 1750, "parameters": 1751, "override": 1752, "pooler": 1753, "pooling_type": 1754, "auto": 1755, "normalize": 1756, "enable_chunked_processing": 1757, "sets": 1758, "own": 1759, "pooling": 1760, "strategy": 1761, "chunk": 1762, "cross": 1763, "aggregation": 1764, "automatically": 1765, "mean": 1766, "native": 1767, "combination": 1768, "component": 1769, "chunks": 1770, "always": 1771, "weighted": 1772, "averaging": 1773, "counts": 1774, "optimal": 1775, "processed": 1776, "port": 1777, "31090": 1778, "gpu_count": 1779, "cls": 1780, "affects": 1781, "api_key": 1782, "empty": 1783, "authentication": 1784, "works": 1785, "inputs": 1786, "longer": 1787, "max_model_len": 1788, "smart": 1789, "chunking": 1790, "split": 1791, "max_position_embeddings": 1792, "maintain": 1793, "unified": 1794, "separately": 1795, "combined": 1796, "count": 1797, "dimensionality": 1798, "standard": 1799, "handling": 1800, "accepted": 1801, "rejected": 1802, "vllm_allow_long_max_model_len": 1803, "extreme": 1804, "academic": 1805, "papers": 1806, "references": 1807, "legal": 1808, "contracts": 1809, "books": 1810, "entire": 1811, "chapters": 1812, "small": 1813, "repositories": 1814, "codebases": 1815, "aspect": 1816, "minimal": 1817, "proportional": 1818, "scalable": 1819, "quality": 1820, "short": 1821, "baseline": 1822, "medium": 1823, "document": 1824, "100k": 1825, "batch": 1826, "mixed": 1827, "consistency": 1828, "reproducible": 1829, "runs": 1830, "troubleshooting": 1831, "valueerror": 1832, "position": 1833, "4096": 1834, "solution": 1835, "increase": 1836, "reduce": 1837, "runtimeerror": 1838, "adjusting": 1839, "fewer": 1840, "slow": 1841, "expected": 1842, "calls": 1843, "activity": 1844, "150000": 1845, "37": 1846, "max_chunk_size": 1847, "extend": 1848, "architecture": 1849, "lengths": 1850, "validate": 1851, "parameter": 1852, "simplified": 1853, "millions": 1854, "better": 1855, "exceed": 1856, "limits": 1857, "backward": 1858, "existing": 1859, "continue": 1860, "demonstrate": 1861, "disagg_proxy_demo": 1862, "xpyd": 1863, "kv_events": 1864, "helm": 1865, "deploying": 1866, "application": 1867, "autoscaling": 1868, "resource": 1869, "defines": 1870, "maintainers": 1871, "ct": 1872, "lintconf": 1873, "linting": 1874, "rules": 1875, "validating": 1876, "templates": 1877, "_helpers": 1878, "tpl": 1879, "helper": 1880, "defining": 1881, "configmap": 1882, "template": 1883, "creating": 1884, "configmaps": 1885, "objects": 1886, "kubernetes": 1887, "deployments": 1888, "hpa": 1889, "horizontal": 1890, "pod": 1891, "autoscaler": 1892, "job": 1893, "jobs": 1894, "poddisruptionbudget": 1895, "budget": 1896, "pvc": 1897, "persistent": 1898, "volume": 1899, "claims": 1900, "secrets": 1901, "services": 1902, "omni": 1903, "thinker": 1904, "audio": 1905, "video": 1906, "offline_inference": 1907, "qwen2_5_omni": 1908, "only_thinker": 1909, "mixed_modalities": 1910, "read": 1911, "vision": 1912, "interleaved": 1913, "modalities": 1914, "yet": 1915, "vllm_use_v1": 1916, "use_audio_in_video": 1917, "audios": 1918, "multi_audios": 1919, "generate": 1920, "modality": 1921, "audio_language": 1922, "vision_language": 1923, "shapes": 1924, "mix": 1925, "assume": 1926, "tested": 1927, "v6e": 1928, "according": 1929, "google_tpu": 1930, "warmups": 1931, "enforce": 1932, "eager": 1933, "okay": 1934, "1024": 1935, "attempt": 1936, "xla_hlo_debug": 1937, "vllm_tpu_profile_duration_ms": 1938, "vllm_tpu_profile_delay_ms": 1939, "dir": 1940, "70b": 1941, "32": 1942, "128": 1943, "decodes": 1944, "having": 1945, "1000": 1946, "hopefully": 1947, "2000": 1948, "rf": 1949, "xla_cache": 1950, "visualizing": 1951, "collected": 1952, "visualize": 1953, "tensorboard": 1954, "xla": 1955, "vm": 1956, "tensorflow": 1957, "etils": 1958, "importlib_resources": 1959, "point": 1960, "6006": 1961, "browser": 1962, "logdir": 1963, "important": 1964, "performing": 1965, "rest": 1966, "consists": 1967, "lines": 1968, "openai_batch": 1969, "openai_example_batch": 1970, "jsonl": 1971, "represents": 1972, "reference": 1973, "platform": 1974, "requestinput": 1975, "score": 1976, "endpoints": 1977, "coming": 1978, "soon": 1979, "pre": 1980, "requisites": 1981, "hub": 1982, "cli": 1983, "login": 1984, "gated": 1985, "visiting": 1986, "card": 1987, "agreeing": 1988, "along": 1989, "download": 1990, "working": 1991, "ve": 1992, "cat": 1993, "custom_id": 1994, "method": 1995, "role": 1996, "content": 1997, "helpful": 1998, "assistant": 1999, "hello": 2000, "world": 2001, "max_completion_tokens": 2002, "unhelpful": 2003, "tool": 2004, "designed": 2005, "called": 2006, "entrypoints": 2007, "run_batch": 2008, "383d1c59835645aeb2e07d004d62a826": 2009, "cmpl": 2010, "61c020e54b964d5a98fa7527bfcdd378": 2011, "object": 2012, "completion": 2013, "1715633336": 2014, "choices": 2015, "great": 2016, "meet": 2017, "tasks": 2018, "today": 2019, "logprobs": 2020, "null": 2021, "finish_reason": 2022, "stop": 2023, "stop_reason": 2024, "prompt_tokens": 2025, "25": 2026, "total_tokens": 2027, "56": 2028, "completion_tokens": 2029, "31": 2030, "42e3d09b14b04568afa3f1797751a267": 2031, "f44d049f6b3a42d4b2d7850bb1e31bcc": 2032, "runner": 2033, "urls": 2034, "accessible": 2035, "located": 2036, "integrating": 2037, "s3": 2038, "integrate": 2039, "storage": 2040, "recommend": 2041, "presigned": 2042, "bucket": 2043, "amazon": 2044, "amazons3": 2045, "userguide": 2046, "awscli": 2047, "credentials": 2048, "interactively": 2049, "boto3": 2050, "cp": 2051, "my_bucket": 2052, "my_input_file": 2053, "replace": 2054, "my_output_file": 2055, "placeholders": 2056, "awsdocs": 2057, "doc": 2058, "example_code": 2059, "s3_basics": 2060, "presigned_url": 2061, "botocore": 2062, "exceptions": 2063, "clienterror": 2064, "generate_presigned_url": 2065, "s3_client": 2066, "client_method": 2067, "method_parameters": 2068, "expires_in": 2069, "param": 2070, "performs": 2071, "return": 2072, "try": 2073, "clientmethod": 2074, "params": 2075, "expiresin": 2076, "except": 2077, "raise": 2078, "input_url": 2079, "get_object": 2080, "3600": 2081, "output_url": 2082, "put_object": 2083, "print": 2084, "west": 2085, "amazonaws": 2086, "awsaccesskeyid": 2087, "abcdefghijklmnopqrst": 2088, "signature": 2089, "abcdefghijklmnopqrstuvwxyz12345": 2090, "expires": 2091, "1715800091": 2092, "section": 2093, "terminal": 2094, "even": 2095, "earlier": 2096, "db0f71f7dec244e6bce530e0b4ef908b": 2097, "status_code": 2098, "200": 2099, "request_id": 2100, "3580bf4d4ae54d52b67eee266a6eab20": 2101, "embd": 2102, "33ac2efa7996430184461f2e38529746": 2103, "444647": 2104, "016204833984375": 2105, "0092010498046875": 2106, "0018358230590820312": 2107, "0028228759765625": 2108, "001422882080078125": 2109, "0031147003173828125": 2110, "baai": 2111, "bge": 2112, "reranker": 2113, "m3": 2114, "text_1": 2115, "france": 2116, "text_2": 2117, "brazil": 2118, "brasilia": 2119, "paris": 2120, "f87c5c4539184f618e555744a2965987": 2121, "806ab64512e44071b37d3f7ccd291413": 2122, "4ee45236897b4d29907d49b01298cdb1": 2123, "1737847944": 2124, "0010900497436523438": 2125, "prompt_tokens_details": 2126, "41990c51a26d4fac8419077f12871099": 2127, "73ce66379026482699f81974e14e1e99": 2128, "13f2ffe6ba40460fbf9f7f00ad667d75": 2129, "001094818115234375": 2130, "prefill_example": 2131, "decode_example": 2132, "sequentially": 2133, "saving": 2134, "local_storage": 2135, "prompts": 2136, "txt": 2137, "primary": 2138, "interface": 2139, "doing": 2140, "interacting": 2141, "argparse": 2142, "pass": 2143, "classify": 2144, "embed": 2145, "inference_params": 2146, "max_tokens": 2147, "temperature": 2148, "top_p": 2149, "top_k": 2150, "passing": 2151, "experiment": 2152, "specifies": 2153, "loaded": 2154, "calling": 2155, "get_default_sampling_params": 2156, "max_new_tokens": 2157, "wide": 2158, "limit": 2159, "gguf": 2160, "quantized": 2161, "downloading": 2162, "huggingface_hub": 2163, "hf_hub_download": 2164, "repo_id": 2165, "bartowski": 2166, "phi": 2167, "4k": 2168, "iq2_m": 2169, "printed": 2170, "above": 2171, "microsoft": 2172, "gb": 2173, "seen": 2174, "virtual": 2175, "24": 2176, "virtually": 2177, "think": 2178, "34": 2179, "13b": 2180, "bf16": 2181, "weight": 2182, "26gb": 2183, "interconnect": 2184, "fly": 2185, "forward": 2186, "hf": 2187, "hide": 2188, "navigation": 2189, "toc": 2190, "figure": 2191, "markdown": 2192, "span": 2193, "60": 2194, "style": 2195, "strong": 2196, "async": 2197, "buttons": 2198, "js": 2199, "button": 2200, "aria": 2201, "label": 2202, "star": 2203, "subscription": 2204, "icon": 2205, "octicon": 2206, "eye": 2207, "watch": 2208, "forked": 2209, "depends": 2210, "looking": 2211, "applications": 2212, "roadmap": 2213, "gaudi": 2214, "accelerators": 2215, "power": 2216, "trainium": 2217, "inferentia": 2218, "announcing": 2219, "intro": 2220, "sosp": 2221, "23x": 2222, "reducing": 2223, "p50": 2224, "latency": 2225, "cade": 2226, "daniel": 2227, "et": 2228, "al": 2229, "meetups": 2230, "chosen": 2231, "device": 2232, "patterns": 2233, "instance": 2234, "production": 2235, "training": 2236, "rlhf": 2237, "train": 2238, "tune": 2239, "frequently": 2240, "asked": 2241, "assuming": 2242, "re": 2243, "referring": 2244, "route": 2245, "correct": 2246, "accordingly": 2247, "listed": 2248, "extracting": 2249, "convert": 2250, "inferior": 2251, "specifically": 2252, "trained": 2253, "vary": 2254, "yes": 2255, "guarantee": 2256, "probabilities": 2257, "variations": 2258, "numerical": 2259, "instability": 2260, "deterministic": 2261, "batched": 2262, "accuracy": 2263, "numerical_accuracy": 2264, "computations": 2265, "slice": 2266, "might": 2267, "differently": 2268, "factors": 2269, "expansion": 2270, "slightly": 2271, "logit": 2272, "logprob": 2273, "differences": 2274, "accumulate": 2275, "potentially": 2276, "resulting": 2277, "sampled": 2278, "further": 2279, "divergence": 2280, "mitigation": 2281, "strategies": 2282, "improved": 2283, "stability": 2284, "reduced": 2285, "variance": 2286, "float32": 2287, "bfloat16": 2288, "switching": 2289, "float16": 2290, "seeds": 2291, "aid": 2292, "achieving": 2293, "discrepancies": 2294, "precision": 2295, "still": 2296, "exposes": 2297, "health": 2298, "unsloth": 2299, "1b": 2300, "query": 2301, "curl": 2302, "iteration_tokens_total": 2303, "histogram": 2304, "per": 2305, "engine_step": 2306, "iteration_tokens_total_sum": 2307, "iteration_tokens_total_bucket": 2308, "le": 2309, "64": 2310, "256": 2311, "512": 2312, "definitions": 2313, "deprecated": 2314, "escape": 2315, "hatch": 2316, "removed": 2317, "reproducibility": 2318, "sake": 2319, "achieve": 2320, "off": 2321, "multiprocessing": 2322, "scheduling": 2323, "vllm_enable_v1_multiprocessing": 2324, "global": 2325, "seed": 2326, "gh": 2327, "applying": 2328, "settings": 2329, "random": 2330, "locality": 2331, "because": 2332, "almost": 2333, "generators": 2334, "np": 2335, "manual_seed": 2336, "none": 2337, "means": 2338, "un": 2339, "workers": 2340, "17929": 2341, "constructs": 2342, "updated": 2343, "active": 2344, "worry": 2345, "accidentally": 2346, "making": 2347, "subsequent": 2348, "rely": 2349, "inter": 2350, "communications": 2351, "nodes": 2352, "protected": 2353, "placing": 2354, "isolated": 2355, "options": 2356, "vllm_host_ip": 2357, "127": 2358, "14579": 2359, "data_parallel_master_ip": 2360, "master": 2361, "data_parallel_master_port": 2362, "29500": 2363, "detailed": 2364, "considerations": 2365, "points": 2366, "intended": 2367, "internal": 2368, "untrusted": 2369, "environments": 2370, "networks": 2371, "authorization": 2372, "sent": 2373, "unencrypted": 2374, "anywhere": 2375, "checks": 2376, "isolation": 2377, "segmentation": 2378, "unauthorized": 2379, "firewall": 2380, "practices": 2381, "rather": 2382, "firewalls": 2383, "ports": 2384, "restrict": 2385, "proper": 2386, "interfaces": 2387, "principle": 2388, "protecting": 2389, "unsafe": 2390, "underlying": 2391, "frameworks": 2392, "listening": 2393, "sometimes": 2394, "outside": 2395, "direct": 2396, "concern": 2397, "tcp": 2398, "initialization": 2399, "tcpstore": 2400, "listens": 2401, "unless": 2402, "protections": 2403, "put": 2404, "place": 2405, "reach": 2406, "perspective": 2407, "known": 2408, "intentional": 2409, "guidance": 2410, "protect": 2411, "carefully": 2412, "expose": 2413, "minimum": 2414, "surface": 2415, "area": 2416, "block": 2417, "trusted": 2418, "hosts": 2419, "never": 2420, "internet": 2421, "consult": 2422, "instructions": 2423, "believe": 2424, "found": 2425, "outlines": 2426, "consider": 2427, "discovered": 2428, "3aissue": 2429, "choose": 2430, "much": 2431, "relevant": 2432, "possible": 2433, "debugged": 2434, "problem": 2435, "remember": 2436, "debugging": 2437, "defined": 2438, "avoid": 2439, "lingering": 2440, "functionalities": 2441, "left": 2442, "activated": 2443, "hangs": 2444, "isn": 2445, "downloaded": 2446, "disk": 2447, "depend": 2448, "recommended": 2449, "guides": 2450, "isolate": 2451, "pay": 2452, "store": 2453, "clusters": 2454, "shared": 2455, "filesystems": 2456, "filesystem": 2457, "additionally": 2458, "too": 2459, "lot": 2460, "slowing": 2461, "needs": 2462, "swap": 2463, "weights": 2464, "bottleneck": 2465, "fit": 2466, "oom": 2467, "adopting": 2468, "conserving_memory": 2469, "consumption": 2470, "changed": 2471, "12622": 2472, "prior": 2473, "came": 2474, "neutral": 2475, "onwards": 2476, "generation_config": 2477, "creator": 2478, "higher": 2479, "know": 2480, "degraded": 2481, "happening": 2482, "trying": 2483, "old": 2484, "improves": 2485, "continuing": 2486, "petition": 2487, "update": 2488, "produces": 2489, "generations": 2490, "don": 2491, "solve": 2492, "stuck": 2493, "somewhere": 2494, "vllm_logging_level": 2495, "vllm_log_stats_interval": 2496, "statistics": 2497, "tracking": 2498, "queue": 2499, "waiting": 2500, "cuda_launch_blocking": 2501, "identify": 2502, "causing": 2503, "nccl_debug": 2504, "nccl": 2505, "vllm_trace_function": 2506, "record": 2507, "function": 2508, "inspection": 2509, "tell": 2510, "flag": 2511, "absolutely": 2512, "delays": 2513, "incorrect": 2514, "cannot": 2515, "complicated": 2516, "parallel_state": 2517, "88": 2518, "world_size": 2519, "rank": 2520, "local_rank": 2521, "distributed_init_method": 2522, "xxx": 2523, "54641": 2524, "backend": 2525, "your_ip_address": 2526, "nccl_socket_ifname": 2527, "your_network_interface": 2528, "gloo_socket_ifname": 2529, "near": 2530, "self": 2531, "replay": 2532, "captures": 2533, "model_runner": 2534, "inside": 2535, "cudagraph": 2536, "operation": 2537, "causes": 2538, "enforce_eager": 2539, "optimization": 2540, "exact": 2541, "established": 2542, "confirm": 2543, "correctly": 2544, "dist": 2545, "init_process_group": 2546, "get_rank": 2547, "device_count": 2548, "set_device": 2549, "floattensor": 2550, "all_reduce": 2551, "op": 2552, "reduceop": 2553, "sum": 2554, "synchronize": 2555, "item": 2556, "get_world_size": 2557, "assert": 2558, "got": 2559, "successful": 2560, "gloo": 2561, "gloo_group": 2562, "new_group": 2563, "ranks": 2564, "cpu_data": 2565, "exit": 2566, "device_communicators": 2567, "pynccl": 2568, "pyncclcommunicator": 2569, "manually": 2570, "prefer": 2571, "fill_": 2572, "cuda_graph": 2573, "current_stream": 2574, "destroy_process_group": 2575, "nproc": 2576, "torchrun": 2577, "nnodes": 2578, "master_addr": 2579, "reachable": 2580, "rdzv_backend": 2581, "c10d": 2582, "rdzv_endpoint": 2583, "sanity": 2584, "usually": 2585, "drivers": 2586, "sense": 2587, "administrator": 2588, "assistance": 2589, "workaround": 2590, "nccl_p2p_disable": 2591, "helps": 2592, "deeplearning": 2593, "env": 2594, "fix": 2595, "distnetworkerror": 2596, "assign": 2597, "commands": 2598, "50": 2599, "multiproc_worker_utils": 2600, "281": 2601, "initialized": 2602, "spawn": 2603, "vllm_worker_multiproc_method": 2604, "finished": 2605, "bootstrapping": 2606, "phase": 2607, "probably": 2608, "child": 2609, "forgotten": 2610, "idiom": 2611, "module": 2612, "__name__": 2613, "__main__": 2614, "freeze_support": 2615, "omitted": 2616, "program": 2617, "going": 2618, "frozen": 2619, "executable": 2620, "safe": 2621, "importing": 2622, "guard": 2623, "behind": 2624, "compile": 2625, "heavily": 2626, "optimize": 2627, "introduces": 2628, "dependency": 2629, "functions": 2630, "10406": 2631, "sin": 2632, "randn": 2633, "raises": 2634, "_inductor": 2635, "12219": 2636, "failed": 2637, "inspected": 2638, "model_executor": 2639, "registry": 2640, "_raise_for_unsupported": 2641, "architectures": 2642, "arch": 2643, "related": 2644, "missing": 2645, "outdated": 2646, "binaries": 2647, "traceback": 2648, "call": 2649, "inspect_model_cls": 2650, "typeerror": 2651, "nonetype": 2652, "iterable": 2653, "resolution": 2654, "model_resolution": 2655, "explicitly": 2656, "infer": 2657, "platforms": 2658, "__init__": 2659, "infers": 2660, "14195": 2661, "unhandled": 2662, "ncclcomminitrank": 2663, "workload": 2664, "gpudirect": 2665, "encounters": 2666, "executing": 2667, "init_device": 2668, "deadlock": 2669, "usr": 2670, "lib": 2671, "99": 2672, "comm": 2673, "ncclcomm_t": 2674, "pynccl_wrapper": 2675, "277": 2676, "nccl_check": 2677, "_funcs": 2678, "ctypes": 2679, "byref": 2680, "error_str": 2681, "indicates": 2682, "initialize": 2683, "communicator": 2684, "possibly": 2685, "ipc_lock": 2686, "capability": 2687, "unmounted": 2688, "dev": 2689, "shm": 2690, "enabling": 2691, "parallelism_scaling": 2692, "properly": 2693, "caused": 2694, "zmq": 2695, "zeromq": 2696, "pyzmq": 2697, "occasionally": 2698, "hang": 2699, "depending": 2700, "6759": 2701, "circumvent": 2702, "1234": 2703, "nccl_cumem_enable": 2704, "cumem": 2705, "allocator": 2706, "gives": 2707, "benefits": 2708, "inconsistent": 2709, "crash": 2710, "observed": 2711, "openrlhf": 2712, "pull": 2713, "604": 2714, "discussion": 2715, "5723": 2716, "issuecomment": 2717, "2554389656": 2718, "stats": 2719, "collection": 2720, "collects": 2721, "anonymous": 2722, "engineering": 2723, "understand": 2724, "widely": 2725, "efforts": 2726, "workloads": 2727, "transparent": 2728, "sensitive": 2729, "subset": 2730, "cleaning": 2731, "publicly": 2732, "benefit": 2733, "usage_lib": 2734, "uuid": 2735, "fbe880e9": 2736, "084d": 2737, "4cab": 2738, "a395": 2739, "8984c50f1109": 2740, "provider": 2741, "gcp": 2742, "num_cpu": 2743, "cpu_type": 2744, "xeon": 2745, "20ghz": 2746, "cpu_family_model_stepping": 2747, "85": 2748, "total_memory": 2749, "101261135872": 2750, "x86_64": 2751, "28": 2752, "amd64": 2753, "glibc2": 2754, "gpu_type": 2755, "l4": 2756, "gpu_memory_per_device": 2757, "23580639232": 2758, "model_architecture": 2759, "optforcausallm": 2760, "vllm_version": 2761, "cu123": 2762, "llm_class": 2763, "log_time": 2764, "1711663373492490000": 2765, "dtype": 2766, "tensor_parallel_size": 2767, "block_size": 2768, "gpu_memory_utilization": 2769, "kv_cache_dtype": 2770, "enable_lora": 2771, "enable_prefix_caching": 2772, "disable_custom_all_reduce": 2773, "preview": 2774, "tail": 2775, "usage_stats": 2776, "opting": 2777, "vllm_no_usage_stats": 2778, "do_not_track": 2779, "mkdir": 2780, "touch": 2781, "deprecating": 2782, "rfc": 2783, "18571": 2784, "gradually": 2785, "inviter": 2786, "reason": 2787, "independently": 2788, "grew": 2789, "increasingly": 2790, "complexity": 2791, "harder": 2792, "debt": 2793, "revealing": 2794, "streamlined": 2795, "design": 2796, "building": 2797, "success": 2798, "retains": 2799, "proven": 2800, "utilities": 2801, "architects": 2802, "core": 2803, "covering": 2804, "scheduler": 2805, "manager": 2806, "sampler": 2807, "cohesive": 2808, "maintainable": 2809, "accommodates": 2810, "growth": 2811, "innovation": 2812, "aims": 2813, "modular": 2814, "hack": 2815, "codebase": 2816, "combine": 2817, "upgrading": 2818, "scenarios": 2819, "published": 2820, "living": 2821, "limitations": 2822, "actively": 2823, "bring": 2824, "therefore": 2825, "progress": 2826, "towards": 2827, "falls": 2828, "nearly": 2829, "fully": 2830, "planned": 2831, "operational": 2832, "ongoing": 2833, "wip": 2834, "scheduled": 2835, "rfcs": 2836, "delayed": 2837, "temporarily": 2838, "dropped": 2839, "later": 2840, "demand": 2841, "treats": 2842, "num_tokens": 2843, "allocate": 2844, "fixed": 2845, "prefills": 2846, "strict": 2847, "separation": 2848, "phases": 2849, "policies": 2850, "served": 2851, "fcfs": 2852, "priority": 2853, "assigned": 2854, "tie": 2855, "breaker": 2856, "configurable": 2857, "nobr": 2858, "x86": 2859, "_64": 2860, "aarch64": 2861, "macos": 2862, "ascend": 2863, 