{"spdx": 0, "license": 1, "identifier": 2, "apache": 3, "filecopyrighttext": 4, "copyright": 5, "contributors": 6, "vllm": 7, "project": 8, "import": 9, "importlib": 10, "traceback": 11, "from": 12, "typing": 13, "callable": 14, "unittest": 15, "mock": 16, "patch": 17, "def": 18, "find_cuda_init": 19, "fn": 20, "object": 21, "none": 22, "helper": 23, "function": 24, "debug": 25, "cuda": 26, "re": 27, "initialization": 28, "errors": 29, "initializes": 30, "prints": 31, "stack": 32, "trace": 33, "how": 34, "happens": 35, "torch": 36, "_lazy_init": 37, "wrapper": 38, "nonlocal": 39, "extract_stack": 40, "return": 41, "print": 42, "initialized": 43, "join": 44, "format_list": 45, "strip": 46, "__name__": 47, "__main__": 48, "lambda": 49, "import_module": 50, "model_executor": 51, "models": 52, "llava": 53, "context": 54, "load_module_from_path": 55, "module_name": 56, "path": 57, "spec": 58, "util": 59, "spec_from_file_location": 60, "module": 61, "module_from_spec": 62, "sys": 63, "modules": 64, "loader": 65, "exec_module": 66, "is_sccache_available": 67, "bool": 68, "which": 69, "sccache": 70, "int": 71, "os": 72, "getenv": 73, "vllm_disable_sccache": 74, "is_ccache_available": 75, "ccache": 76, "is_ninja_available": 77, "ninja": 78, "is_url_available": 79, "url": 80, "str": 81, "urllib": 82, "request": 83, "urlopen": 84, "status": 85, "try": 86, "except": 87, "exception": 88, "false": 89, "200": 90, "class": 91, "cmakeextension": 92, "method": 93, "__init__": 94, "self": 95, "name": 96, "cmake_lists_dir": 97, "kwa": 98, "super": 99, "sources": 100, "py_limited_api": 101, "true": 102, "abspath": 103, "cmake_build_ext": 104, "compute_num_jobs": 105, "num_jobs": 106, "either": 107, "value": 108, "max_jobs": 109, "environment": 110, "variable": 111, "defined": 112, "number": 113, "cpus": 114, "available": 115, "envs": 116, "logger": 117, "info": 118, "using": 119, "jobs": 120, "else": 121, "sched_getaffinity": 122, "isn": 123, "universally": 124, "so": 125, "fall": 126, "back": 127, "cpu_count": 128, "we": 129, "get": 130, "error": 131, "here": 132, "len": 133, "attributeerror": 134, "nvcc_threads": 135, "_is_cuda": 136, "get_nvcc_cuda_version": 137, "version": 138, "11": 139, "when": 140, "set": 141, "reduce": 142, "avoid": 143, "overloading": 144, "system": 145, "nvcc": 146, "threads": 147, "max": 148, "configure": 149, "ext": 150, "ve": 151, "already": 152, "configured": 153, "cmakelists": 154, "txt": 155, "extension": 156, "exit": 157, "early": 158, "did_config": 159, "select": 160, "build": 161, "type": 162, "note": 163, "optimization": 164, "level": 165, "default_cfg": 166, "relwithdebinfo": 167, "cfg": 168, "cmake_build_type": 169, "cmake_args": 170, "dcmake_build_type": 171, "format": 172, "dvllm_target_device": 173, "vllm_target_device": 174, "verbose": 175, "dcmake_verbose_makefile": 176, "dcmake_c_compiler_launcher": 177, "dcmake_cxx_compiler_launcher": 178, "dcmake_cuda_compiler_launcher": 179, "dcmake_hip_compiler_launcher": 180, "elif": 181, "pass": 182, "python": 183, "executable": 184, "cmake": 185, "can": 186, "find": 187, "exact": 188, "match": 189, "dvllm_python_executable": 190, "reuse": 191, "dependencies": 192, "subsequent": 193, "calls": 194, "dvllm_python_path": 195, "override": 196, "base": 197, "directory": 198, "fetchcontent": 199, "downloads": 200, "root": 201, "deps": 202, "allows": 203, "sharing": 204, "between": 205, "profiles": 206, "plays": 207, "more": 208, "nicely": 209, "ent": 210, "fetchcontent_base_dir": 211, "fc_base_dir": 212, "root_dir": 213, "environ": 214, "dfetchcontent_base_dir": 215, "setup": 216, "parallelism": 217, "tool": 218, "dnvcc_threads": 219, "build_tool": 220, "dcmake_job_pool_compile": 221, "string": 222, "compile": 223, "dcmake_job_pools": 224, "default": 225, "whatever": 226, "picks": 227, "make": 228, "sure": 229, "use": 230, "cuda_home": 231, "dcmake_cuda_compiler": 232, "bin": 233, "subprocess": 234, "check_call": 235, "cwd": 236, "build_temp": 237, "build_extensions": 238, "ensure": 239, "present": 240, "working": 241, "check_output": 242, "oserror": 243, "raise": 244, "runtimeerror": 245, "cannot": 246, "create": 247, "does": 248, "exist": 249, "exists": 250, "makedirs": 251, "targets": 252, "target_name": 253, "removeprefix": 254, "vllm_flash_attn": 255, "all": 256, "extensions": 257, "append": 258, "build_args": 259, "target": 260, "install": 261, "libraries": 262, "proper": 263, "location": 264, "outdir": 265, "get_ext_fullpath": 266, "parent": 267, "absolute": 268, "skip": 269, "same": 270, "continue": 271, "appends": 272, "prefix": 273, "contains": 274, "need": 275, "remove": 276, "range": 277, "count": 278, "should": 279, "actually": 280, "components": 281, "install_args": 282, "component": 283, "run": 284, "first": 285, "standard": 286, "build_ext": 287, "command": 288, "copy": 289, "py": 290, "build_lib": 291, "current": 292, "included": 293, "editable": 294, "glob": 295, "files": 296, "recursive": 297, "file": 298, "dst_file": 299, "split": 300, "copying": 301, "dirname": 302, "exist_ok": 303, "copy_file": 304, "precompiled_build_ext": 305, "assert": 306, "vllm_use_precompiled": 307, "only": 308, "supported": 309, "builds": 310, "skipping": 311, "precompiled": 312, "precompiled_wheel_utils": 313, "extract_precompiled_and_patch_package": 314, "wheel_url_or_path": 315, "dict": 316, "tempfile": 317, "zipfile": 318, "temp_dir": 319, "isfile": 320, "wheel_filename": 321, "mkdtemp": 322, "wheels": 323, "wheel_path": 324, "downloading": 325, "wheel": 326, "urlretrieve": 327, "filename": 328, "existing": 329, "package_data_patch": 330, "files_to_copy": 331, "_c": 332, "abi3": 333, "_moe_c": 334, "_flashmla_c": 335, "_vllm_fa2_c": 336, "_vllm_fa3_c": 337, "cumem_allocator": 338, "compiled_regex": 339, "file_members": 340, "list": 341, "filter": 342, "filelist": 343, "extract": 344, "target_path": 345, "open": 346, "src": 347, "wb": 348, "dst": 349, "shutil": 350, "copyfileobj": 351, "pkg": 352, "replace": 353, "setdefault": 354, "basename": 355, "finally": 356, "removing": 357, "temporary": 358, "rmtree": 359, "get_base_commit_in_main_branch": 360, "force": 361, "nightly": 362, "mainly": 363, "used": 364, "ci": 365, "testing": 366, "vllm_test_use_precompiled_nightly_wheel": 367, "latest": 368, "commit": 369, "hash": 370, "upstream": 371, "main": 372, "branch": 373, "resp_json": 374, "curl": 375, "https": 376, "api": 377, "github": 378, "com": 379, "repos": 380, "commits": 381, "decode": 382, "utf": 383, "upstream_main_commit": 384, "json": 385, "loads": 386, "sha": 387, "docker": 388, "git": 389, "may": 390, "immutable": 391, "missing": 392, "vllm_docker_build_context": 393, "check": 394, "local": 395, "repo": 396, "cat": 397, "calledprocesserror": 398, "fetch": 399, "remote": 400, "repository": 401, "update": 402, "any": 403, "branches": 404, "ensures": 405, "ref": 406, "its": 407, "history": 408, "our": 409, "current_branch": 410, "show": 411, "base_commit": 412, "merge": 413, "valueerror": 414, "err": 415, "non": 416, "warning": 417, "failed": 418, "compatible": 419, "your": 420, "dev": 421, "_no_device": 422, "empty": 423, "has_cuda": 424, "_is_neuron": 425, "_is_tpu": 426, "_is_hip": 427, "rocm": 428, "hip": 429, "neuron": 430, "tpu": 431, "_is_cpu": 432, "cpu": 433, "_is_xpu": 434, "xpu": 435, "_build_custom_ops": 436, "get_rocm_version": 437, "rocm_home": 438, "librocm": 439, "core": 440, "see": 441, "blob": 442, "d11f5c20d500f729c393680a01fa902ebf92094b": 443, "rocm_version": 444, "cpp": 445, "l21": 446, "librocm_core_file": 447, "lib": 448, "is_file": 449, "librocm_core": 450, "ctypes": 451, "cdll": 452, "vererrors": 453, "c_uint32": 454, "get_rocm_core_version": 455, "getrocmversion": 456, "restype": 457, "argtypes": 458, "pointer": 459, "major": 460, "minor": 461, "byref": 462, "get_neuronxcc_version": 463, "sysconfig": 464, "site_dir": 465, "get_paths": 466, "purelib": 467, "version_file": 468, "neuronxcc": 469, "executed": 470, "successfully": 471, "fp": 472, "content": 473, "read": 474, "regular": 475, "expression": 476, "search": 477, "__version__": 478, "group": 479, "could": 480, "output": 481, "adapted": 482, "nvidia": 483, "apex": 484, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 485, "nvcc_output": 486, "universal_newlines": 487, "release_idx": 488, "index": 489, "release": 490, "nvcc_cuda_version": 491, "parse": 492, "get_gaudi_sw_version": 493, "returns": 494, "driver": 495, "enable": 496, "console": 497, "printing": 498, "hl": 499, "smi": 500, "shell": 501, "text": 502, "capture_output": 503, "env": 504, "enable_console": 505, "returncode": 506, "stdout": 507, "get_vllm_version": 508, "get_version": 509, "write_to": 510, "_version": 511, "sep": 512, "versions": 513, "might": 514, "contain": 515, "cuda_version": 516, "main_cuda_version": 517, "cuda_version_str": 518, "source": 519, "tarball": 520, "required": 521, "pypi": 522, "sdist": 523, "argv": 524, "cu": 525, "neuron_version": 526, "neuron_version_str": 527, "unknown": 528, "runtime": 529, "get_requirements": 530, "package": 531, "requirements": 532, "requirements_dir": 533, "_read_requirements": 534, "resolved_requirements": 535, "line": 536, "startswith": 537, "common": 538, "cuda_major": 539, "cuda_minor": 540, "modified_requirements": 541, "req": 542, "flash": 543, "attn": 544, "12": 545, "built": 546, "other": 547, "unsupported": 548, "platform": 549, "please": 550, "requires_files": 551, "pyproject": 552, "toml": 553, "cleaning": 554, "lines": 555, "readlines": 556, "lower": 557, "removed": 558, "write": 559, "done": 560, "async_request_tgi": 561, "async": 562, "request_func_input": 563, "requestfuncinput": 564, "pbar": 565, "optional": 566, "tqdm": 567, "requestfuncoutput": 568, "api_url": 569, "endswith": 570, "generate_stream": 571, "aiohttp": 572, "clientsession": 573, "trust_env": 574, "timeout": 575, "aiohttp_timeout": 576, "session": 577, "params": 578, "max_new_tokens": 579, "output_len": 580, "do_sample": 581, "temperature": 582, "01": 583, "tgi": 584, "accept": 585, "top_p": 586, "99": 587, "truncate": 588, "prompt_len": 589, "ignore_eos_token": 590, "ignore_eos": 591, "payload": 592, "inputs": 593, "prompt": 594, "parameters": 595, "output_tokens": 596, "ttft": 597, "st": 598, "time": 599, "perf_counter": 600, "most_recent_timestamp": 601, "post": 602, "response": 603, "chunk_bytes": 604, "sometimes": 605, "ping": 606, "without": 607, "data": 608, "chunk": 609, "timestamp": 610, "uld": 611, "token": 612, "decoding": 613, "phase": 614, "itl": 615, "latency": 616, "success": 617, "generated_text": 618, "reason": 619, "exc_info": 620, "format_exception": 621, "async_request_trt_llm": 622, "accumulate_tokens": 623, "text_input": 624, "max_tokens": 625, "stream": 626, "min_length": 627, "text_output": 628, "async_request_deepspeed_mii": 629, "completions": 630, "profile": 631, "openai": 632, "must": 633, "end": 634, "model": 635, "deepspeed": 636, "mii": 637, "temp": 638, "headers": 639, "authorization": 640, "bearer": 641, "openai_api_key": 642, "doesn": 643, "support": 644, "streaming": 645, "jan": 646, "28": 647, "2024": 648, "placeholder": 649, "microsoft": 650, "pull": 651, "311": 652, "parsed_resp": 653, "await": 654, "choices": 655, "unexpected": 656, "neither": 657, "nor": 658, "found": 659, "async_request_openai_completions": 660, "model_name": 661, "repetition_penalty": 662, "logprobs": 663, "stream_options": 664, "include_usage": 665, "extra_body": 666, "first_chunk_received": 667, "some": 668, "completion": 669, "have": 670, "last": 671, "usage": 672, "summary": 673, "want": 674, "generated": 675, "special": 676, "tokens": 677, "completion_tokens": 678, "never": 679, "received": 680, "valid": 681, "calculate": 682, "marked": 683, "async_request_openai_chat_completions": 684, "chat": 685, "multi_modal_content": 686, "mm_content": 687, "isinstance": 688, "extend": 689, "typeerror": 690, "messages": 691, "role": 692, "user": 693, "max_completion_tokens": 694, "application": 695, "sse": 696, "comments": 697, "often": 698, "pings": 699, "start": 700, "colon": 701, "skipped": 702, "delta": 703, "async_request_openai_audio": 704, "lazy": 705, "placeholdermodule": 706, "dep": 707, "soundfile": 708, "transcriptions": 709, "translations": 710, "language": 711, "en": 712, "flattened": 713, "due": 714, "multipart": 715, "form": 716, "stream_include_usage": 717, "stream_continuous_usage_stats": 718, "send": 719, "audio": 720, "to_bytes": 721, "sr": 722, "buffer": 723, "io": 724, "bytesio": 725, "wav": 726, "seek": 727, "mm_audio": 728, "containing": 729, "formdata": 730, "add_field": 731, "content_type": 732, "key": 733, "items": 734, "get_model": 735, "pretrained_model_name_or_path": 736, "vllm_use_modelscope": 737, "modelscope": 738, "snapshot_download": 739, "model_loader": 740, "weight_utils": 741, "get_lock": 742, "lock": 743, "prevent": 744, "multiple": 745, "processes": 746, "weights": 747, "model_path": 748, "model_id": 749, "local_files_only": 750, "huggingface_hub": 751, "constants": 752, "hf_hub_offline": 753, "ignore_file_pattern": 754, "pt": 755, "safetensors": 756, "get_tokenizer": 757, "tokenizer_mode": 758, "auto": 759, "trust_remote_code": 760, "kwargs": 761, "union": 762, "pretrainedtokenizer": 763, "pretrainedtokenizerfast": 764, "slow": 765, "use_fast": 766, "fast": 767, "tokenizer": 768, "mode": 769, "mistral": 770, "transformers_utils": 771, "mistraltokenizer": 772, "importerror": 773, "requires": 774, "pip": 775, "from_pretrained": 776, "autotokenizer": 777, "args": 778, "rows": 779, "allocate_block": 780, "allocate_blocks": 781, "enforce": 782, "gc": 783, "collect": 784, "ahead": 785, "minimize": 786, "impact": 787, "among": 788, "runs": 789, "block_pool": 790, "blockpool": 791, "num_gpu_blocks": 792, "enable_caching": 793, "get_blocks_times": 794, "timecollector": 795, "us": 796, "free_blocks_times": 797, "num_iteration": 798, "blocks": 799, "get_new_blocks": 800, "free_blocks": 801, "cnt": 802, "dump_avg_max": 803, "tabulate": 804, "iterations": 805, "total": 806, "nblocks": 807, "allocated": 808, "navg": 809, "nmax": 810, "free": 811, "tablefmt": 812, "grid": 813, "floatfmt": 814, "3f": 815, "invoke_main": 816, "parser": 817, "flexibleargumentparser": 818, "description": 819, "benchmark": 820, "performance": 821, "kv": 822, "cache": 823, "add_argument": 824, "num": 825, "gpu": 826, "100000": 827, "iteration": 828, "1000": 829, "help": 830, "stablize": 831, "final": 832, "readings": 833, "allocate": 834, "nargs": 835, "10": 836, "50": 837, "100": 838, "500": 839, "parse_args": 840, "benchmarkdataset": 841, "dataset_path": 842, "random_seed": 843, "default_seed": 844, "initialize": 845, "dataset": 846, "random": 847, "seed": 848, "indicates": 849, "reproducible": 850, "shuffling": 851, "sampling": 852, "defaults": 853, "ensuring": 854, "replaced": 855, "apply_multimodal_chat_transformation": 856, "multimodaldatadict": 857, "transform": 858, "multimodal": 859, "expect": 860, "specific": 861, "conversation": 862, "load_data": 863, "load": 864, "overridden": 865, "subclasses": 866, "since": 867, "vary": 868, "depending": 869, "raises": 870, "notimplementederror": 871, "subclass": 872, "implement": 873, "todo": 874, "jenniferzhao": 875, "add": 876, "implemented": 877, "get_random_lora_request": 878, "pretrainedtokenizerbase": 879, "max_loras": 880, "lora_path": 881, "tuple": 882, "lorarequest": 883, "anytokenizer": 884, "optionally": 885, "lora": 886, "associated": 887, "provided": 888, "randomly": 889, "selects": 890, "based": 891, "retrieves": 892, "cached": 893, "otherwise": 894, "selected": 895, "maximum": 896, "loras": 897, "disk": 898, "where": 899, "element": 900, "applicable": 901, "second": 902, "generate": 903, "id": 904, "lora_id": 905, "randint": 906, "lora_request": 907, "lora_name": 908, "lora_int_id": 909, "lora_path_on_disk": 910, "lora_tokenizer_cache": 911, "get_lora_tokenizer": 912, "sample": 913, "num_requests": 914, "samplerequest": 915, "abstract": 916, "requests": 917, "logic": 918, "generating": 919, "objects": 920, "processing": 921, "maybe_oversample_requests": 922, "oversamples": 923, "size": 924, "less": 925, "than": 926, "desired": 927, "sampled": 928, "additional": 929, "oversampled": 930, "reach": 931, "samples": 932, "is_valid_sequence": 933, "min_len": 934, "max_prompt_len": 935, "1024": 936, "max_total_len": 937, "2048": 938, "skip_min_output_len_check": 939, "validate": 940, "sequence": 941, "lengths": 942, "pruning": 943, "criteria": 944, "copied": 945, "original": 946, "sample_hf_requests": 947, "sample_sharegpt_requests": 948, "functions": 949, "benchmark_serving": 950, "well": 951, "sample_requests": 952, "benchmark_throughput": 953, "invalid": 954, "conditions": 955, "prompt_too_short": 956, "output_too_short": 957, "prompt_too_long": 958, "combined_too_long": 959, "met": 960, "get_adapter_absolute_path": 961, "process_image": 962, "image": 963, "mapping": 964, "process": 965, "single": 966, "input": 967, "multimedia": 968, "dictionary": 969, "supports": 970, "three": 971, "types": 972, "raw": 973, "bytes": 974, "expects": 975, "pil": 976, "converts": 977, "rgb": 978, "saves": 979, "jpeg": 980, "memory": 981, "encodes": 982, "base64": 983, "treats": 984, "prepends": 985, "http": 986, "convert_image_mode": 987, "image_data": 988, "save": 989, "image_base64": 990, "b64encode": 991, "getvalue": 992, "image_url": 993, "randomdataset": 994, "prefix_len": 995, "default_prefix_len": 996, "range_ratio": 997, "float": 998, "default_range_ratio": 999, "input_len": 1000, "default_input_len": 1001, "default_output_len": 1002, "random_range_ratio": 1003, "vocab_size": 1004, "num_special_tokens": 1005, "num_special_tokens_to_add": 1006, "real_input_len": 1007, "prefix_token_ids": 1008, "np": 1009, "tolist": 1010, "new": 1011, "input_low": 1012, "input_high": 1013, "output_low": 1014, "bound": 1015, "length": 1016, "least": 1017, "cause": 1018, "failures": 1019, "output_high": 1020, "logging": 1021, "debugging": 1022, "input_lens": 1023, "output_lens": 1024, "offsets": 1025, "inner_seq": 1026, "arange": 1027, "token_sequence": 1028, "prefix_": 1029, "after": 1030, "encode": 1031, "again": 1032, "because": 1033, "cases": 1034, "consecutive": 1035, "give": 1036, "tokenized": 1037, "example": 1038, "gpt2tokenizer": 1039, "6880": 1040, "6881": 1041, "ġcalls": 1042, "1650": 1043, "939": 1044, "486": 1045, "ġcall": 1046, "sh": 1047, "ere": 1048, "uncontrolled": 1049, "change": 1050, "encoded": 1051, "truncated": 1052, "before": 1053, "being": 1054, "total_input_len": 1055, "re_encoded_sequence": 1056, "add_special_tokens": 1057, "expected_output_len": 1058, "sharegptdataset": 1059, "loading": 1060, "encoding": 1061, "entries": 1062, "two": 1063, "turns": 1064, "entry": 1065, "conversations": 1066, "shuffle": 1067, "enable_multimodal_chat": 1068, "break": 1069, "prompt_ids": 1070, "input_ids": 1071, "completion_ids": 1072, "new_output_len": 1073, "also": 1074, "sharegpt4video": 1075, "image_path": 1076, "multi_modal_data": 1077, "customdataset": 1078, "dictionaries": 1079, "what": 1080, "capital": 1081, "india": 1082, "standardized": 1083, "has": 1084, "convert": 1085, "filetype": 1086, "assume": 1087, "jsonl": 1088, "jsonl_data": 1089, "pd": 1090, "read_json": 1091, "path_or_buf": 1092, "column": 1093, "columns": 1094, "each": 1095, "row": 1096, "dataframe": 1097, "corresponds": 1098, "iterrows": 1099, "to_dict": 1100, "skip_chat_template": 1101, "sampled_requests": 1102, "item": 1103, "apply": 1104, "template": 1105, "apply_chat_template": 1106, "add_generation_prompt": 1107, "tokenize": 1108, "sonnetdataset": 1109, "return_prompt_formatted": 1110, "average": 1111, "poem": 1112, "tokenized_lines": 1113, "avg_len": 1114, "sum": 1115, "base_prompt": 1116, "pick": 1117, "many": 1118, "you": 1119, "base_msg": 1120, "base_fmt": 1121, "base_offset": 1122, "higher": 1123, "determine": 1124, "num_input_lines": 1125, "round": 1126, "num_prefix_lines": 1127, "prefix_lines": 1128, "while": 1129, "extra_lines": 1130, "msg": 1131, "prompt_formatted": 1132, "izer": 1133, "burstgptdataset": 1134, "df": 1135, "read_csv": 1136, "keep": 1137, "gpt": 1138, "gpt4_df": 1139, "_sample_loaded_data": 1140, "random_state": 1141, "lists": 1142, "values": 1143, "lora_req": 1144, "synthetic": 1145, "ids": 1146, "computed": 1147, "modulo": 1148, "token_ids": 1149, "huggingfacedataset": 1150, "dataset_split": 1151, "no_stream": 1152, "dataset_subset": 1153, "load_stream": 1154, "huggingface": 1155, "datasets": 1156, "load_dataset": 1157, "conversationdataset": 1158, "examples": 1159, "filtered_data": 1160, "dynamic_output": 1161, "conv": 1162, "completion_len": 1163, "enabled": 1164, "longer": 1165, "accurate": 1166, "actual": 1167, "visionarenadataset": 1168, "parser_fn": 1169, "supported_dataset_paths": 1170, "images": 1171, "instructcoderdataset": 1172, "instruction": 1173, "just": 1174, "code": 1175, "do": 1176, "include": 1177, "explanation": 1178, "mtbenchdataset": 1179, "aimodataset": 1180, "problem": 1181, "solution": 1182, "32000": 1183, "_format_zeta_prompt": 1184, "original_start_marker": 1185, "editable_region_start": 1186, "zeta": 1187, "next": 1188, "edit": 1189, "prediction": 1190, "nep": 1191, "formats": 1192, "prompts": 1193, "expected": 1194, "outputs": 1195, "further": 1196, "extended": 1197, "events": 1198, "marker": 1199, "indicating": 1200, "region": 1201, "formatted": 1202, "zeta_prompt": 1203, "following": 1204, "implementation": 1205, "focused": 1206, "output_start_index": 1207, "output_focused_region": 1208, "expected_output": 1209, "nexteditpredictiondataset": 1210, "formatting_prompt_func": 1211, "mapping_prompt_funcs": 1212, "asrdataset": 1213, "librosa": 1214, "transcription_preamble": 1215, "array": 1216, "sampling_rate": 1217, "duration_s": 1218, "get_duration": 1219, "whisper": 1220, "duration": 1221, "skip_long_audios": 1222, "30": 1223, "discarded": 1224, "greater": 1225, "save_to_pytorch_benchmark_format": 1226, "argparse": 1227, "namespace": 1228, "results": 1229, "pt_records": 1230, "convert_to_pytorch_benchmark_format": 1231, "metrics": 1232, "latencies": 1233, "extra_info": 1234, "avg_latency": 1235, "percentiles": 1236, "pt_file": 1237, "splitext": 1238, "output_json": 1239, "pytorch": 1240, "write_to_json": 1241, "engine_args": 1242, "engineargs": 1243, "from_cli_args": 1244, "woosuk": 1245, "processed": 1246, "batch": 1247, "engine": 1248, "automatically": 1249, "batches": 1250, "llm": 1251, "dataclasses": 1252, "asdict": 1253, "llm_engine": 1254, "model_config": 1255, "max_model_len": 1256, "sampling_params": 1257, "samplingparams": 1258, "detokenize": 1259, "disable_detokenize": 1260, "dummy_prompt_token_ids": 1261, "10000": 1262, "batch_size": 1263, "dummy_prompts": 1264, "prompttype": 1265, "prompt_token_ids": 1266, "llm_generate": 1267, "use_beam_search": 1268, "use_tqdm": 1269, "beam_search": 1270, "beamsearchparams": 1271, "beam_width": 1272, "run_to_completion": 1273, "profile_dir": 1274, "start_profile": 1275, "stop_profile": 1276, "start_time": 1277, "end_time": 1278, "warming": 1279, "up": 1280, "num_iters_warmup": 1281, "desc": 1282, "warmup": 1283, "profile_": 1284, "vllm_torch_profiler_dir": 1285, "profiling": 1286, "saved": 1287, "num_iters": 1288, "percentages": 1289, "25": 1290, "75": 1291, "90": 1292, "percentile": 1293, "avg": 1294, "mean": 1295, "seconds": 1296, "percentage": 1297, "zip": 1298, "specified": 1299, "dump": 1300, "indent": 1301, "create_argument_parser": 1302, "till": 1303, "32": 1304, "128": 1305, "sequences": 1306, "per": 1307, "beam": 1308, "action": 1309, "store_true": 1310, "iters": 1311, "generation": 1312, "disable": 1313, "responses": 1314, "detokenization": 1315, "measurement": 1316, "add_cli_args": 1317, "v1": 1318, "enables": 1319, "caching": 1320, "skews": 1321, "numbers": 1322, "set_defaults": 1323, "enable_prefix_caching": 1324, "test_long_document_qa": 1325, "test": 1326, "long": 1327, "document": 1328, "qa": 1329, "given": 1330, "spent": 1331, "parameter": 1332, "strings": 1333, "execute": 1334, "4f": 1335, "secs": 1336, "repeat_prompts": 1337, "repeat_count": 1338, "repeat": 1339, "times": 1340, "order": 1341, "depends": 1342, "repeated": 1343, "repetition": 1344, "modes": 1345, "tile": 1346, "entire": 1347, "interleave": 1348, "consecutively": 1349, "moving": 1350, "repeated_prompts": 1351, "shuffle_seed": 1352, "prepare": 1353, "beginning": 1354, "documents": 1355, "hi": 1356, "document_length": 1357, "num_documents": 1358, "repeat_mode": 1359, "warmup_prompts": 1360, "warm": 1361, "automatic": 1362, "roughly": 1363, "paper": 1364, "excluding": 1365, "20000": 1366, "min": 1367, "256": 1368, "details": 1369, "max_ngram": 1370, "collector": 1371, "modelconfig": 1372, "facebook": 1373, "opt": 1374, "125m": 1375, "task": 1376, "num_token": 1377, "num_spec_token": 1378, "dtype": 1379, "proposer": 1380, "ngramproposer": 1381, "vllm_config": 1382, "vllmconfig": 1383, "speculative_config": 1384, "speculativeconfig": 1385, "prompt_lookup_min": 1386, "min_ngram": 1387, "prompt_lookup_max": 1388, "num_speculative_tokens": 1389, "ngram": 1390, "propose": 1391, "20": 1392, "num_req": 1393, "gram": 1394, "speculative": 1395, "drafting": 1396, "1500": 1397, "minimum": 1398, "15": 1399, "test_prefix": 1400, "cost": 1401, "sample_tokens": 1402, "vocab": 1403, "get_vocab": 1404, "all_special_ids": 1405, "sample_requests_from_dataset": 1406, "input_length_range": 1407, "fixed_output_len": 1408, "too": 1409, "small": 1410, "out": 1411, "max_len": 1412, "short": 1413, "filtered_requests": 1414, "completion_token_ids": 1415, "sample_requests_from_random": 1416, "unique_part_token_ids": 1417, "repeat_and_sort_requests": 1418, "sort": 1419, "repeated_requests": 1420, "map": 1421, "num_prompts": 1422, "helpful": 1423, "stats": 1424, "prompt_lens": 1425, "p50": 1426, "sorted": 1427, "filtered": 1428, "generati": 1429, "specifies": 1430, "added": 1431, "subtract": 1432, "filtering": 1433, "get_random_flag": 1434, "filtered_dataset": 1435, "prune": 1436, "priority": 1437, "run_vllm": 1438, "_priority": 1439, "synthesize": 1440, "backend": 1441, "elapsed_time": 1442, "total_num_tokens": 1443, "throughput": 1444, "2f": 1445, "requests_per_second": 1446, "tokens_per_second": 1447, "hf": 1448, "overrides": 1449, "calculate_metrics": 1450, "input_requests": 1451, "dur_s": 1452, "selected_percentile_metrics": 1453, "selected_percentiles": 1454, "goodput_config_dict": 1455, "benchmarkmetrics": 1456, "actual_output_lens": 1457, "total_input": 1458, "completed": 1459, "good_completed": 1460, "itls": 1461, "tpots": 1462, "all_tpots": 1463, "ttfts": 1464, "e2els": 1465, "serving": 1466, "backends": 1467, "instead": 1468, "looking": 1469, "bundled": 1470, "together": 1471, "inflate": 1472, "slightly": 1473, "tpot": 1474, "latency_minus_ttft": 1475, "regard": 1476, "goodput": 1477, "valid_metrics": 1478, "slo_values": 1479, "tt": 1480, "milliseconds_to_seconds_conversion": 1481, "e2el": 1482, "req_metric": 1483, "is_good_req": 1484, "warnings": 1485, "warn": 1486, "likely": 1487, "misconfiguration": 1488, "arguments": 1489, "stacklevel": 1490, "total_output": 1491, "request_throughput": 1492, "request_goodput": 1493, "output_throughput": 1494, "total_token_throughput": 1495, "mean_ttft_ms": 1496, "std_ttft_ms": 1497, "std": 1498, "median_ttft_ms": 1499, "median": 1500, "percentiles_ttft_ms": 1501, "r_s": 1502, "mean_tpot_ms": 1503, "std_tpot_ms": 1504, "median_tpot_ms": 1505, "percentiles_tpot_ms": 1506, "mean_itl_ms": 1507, "std_itl_ms": 1508, "median_itl_ms": 1509, "percentiles_itl_ms": 1510, "mean_e2el_ms": 1511, "std_e2el_ms": 1512, "median_e2el_ms": 1513, "percentiles_e2el_ms": 1514, "base_url": 1515, "request_rate": 1516, "burstiness": 1517, "disable_tqdm": 1518, "max_concurrency": 1519, "lora_modules": 1520, "iterable": 1521, "ramp_up_strategy": 1522, "literal": 1523, "linear": 1524, "exponential": 1525, "ramp_up_start_rps": 1526, "ramp_up_end_rps": 1527, "async_request_funcs": 1528, "request_func": 1529, "starting": 1530, "initial": 1531, "test_prompt": 1532, "test_prompt_len": 1533, "test_output_len": 1534, "test_mm_content": 1535, "test_input": 1536, "test_output": 1537, "correctly": 1538, "choose": 1539, "iter": 1540, "choice": 1541, "profiler": 1542, "profile_input": 1543, "profile_output": 1544, "started": 1545, "distribution": 1546, "poisson": 1547, "gamma": 1548, "traffic": 1549, "ramp": 1550, "strategy": 1551, "increase": 1552, "rps": 1553, "over": 1554, "rate": 1555, "factor": 1556, "concurrency": 1557, "once": 1558, "simplify": 1559, "limited_request_func": 1560, "semaphore": 1561, "asyncio": 1562, "contextlib": 1563, "nullcontext": 1564, "benchmark_start_time": 1565, "tasks": 1566, "rps_change_events": 1567, "last_int_rps": 1568, "datetime": 1569, "now": 1570, "isoformat": 1571, "current_request_rate": 1572, "get_request": 1573, "current_int_rps": 1574, "rps_val": 1575, "int_rps": 1576, "req_model_id": 1577, "req_model_name": 1578, "req_lora_module": 1579, "create_task": 1580, "gather": 1581, "close": 1582, "benchmark_duration": 1583, "result": 1584, "40": 1585, "successful": 1586, "lected_percentiles": 1587, "inf": 1588, "tok": 1589, "total_input_tokens": 1590, "total_output_tokens": 1591, "outp": 1592, "generated_texts": 1593, "process_one_metric": 1594, "metric_attribute_name": 1595, "metric_name": 1596, "metric_header": 1597, "adds": 1598, "statistics": 1599, "metric": 1600, "ms": 1601, "getattr": 1602, "mean_": 1603, "_ms": 1604, "median_": 1605, "std_": 1606, "percentiles_": 1607, "p_word": 1608, "ibute_name": 1609, "excl": 1610, "1st": 1611, "inter": 1612, "stopping": 1613, "stopped": 1614, "check_goodput_args": 1615, "valid_names": 1616, "parse_goodput": 1617, "slo_name": 1618, "slo_val": 1619, "service": 1620, "objective": 1621, "one": 1622, "negative": 1623, "slo_pairs": 1624, "slo_pair": 1625, "argumenttypeerror": 1626, "objectives": 1627, "specify": 1628, "pairs": 1629, "milliseconds": 1630, "file_name": 1631, "p99_ttft_ms": 1632, "p99_tpot_ms": 1633, "p99_itl_ms": 1634, "useful": 1635, "rather": 1636, "big": 1637, "later": 1638, "needed": 1639, "ignored_metrics": 1640, "don": 1641, "suffix": 1642, "served_model_name": 1643, "tokenizer_id": 1644, "controlled": 1645, "argument": 1646, "both": 1647, "endpoint": 1648, "host": 1649, "port": 1650, "dataset_name": 1651, "corresponding": 1652, "custom": 1653, "custom_output_len": 1654, "custom_skip_chat_template": 1655, "sonnet": 1656, "formatting": 1657, "sonnet_input_len": 1658, "sonnet_output_len": 1659, "sonnet_prefix_len": 1660, "chat_template": 1661, "default_chat_template": 1662, "dataset_class": 1663, "visionarenad": 1664, "hf_split": 1665, "train": 1666, "hf_subset": 1667, "noqa": 1668, "e501": 1669, "supported_datasets": 1670, "cls": 1671, "__subclasses__": 1672, "consider": 1673, "contributing": 1674, "would": 1675, "like": 1676, "is_multimod": 1677, "is_multimodal": 1678, "multi": 1679, "modal": 1680, "hf_output_len": 1681, "follow": 1682, "similar": 1683, "structure": 1684, "dataset_mapping": 1685, "sharegpt": 1686, "sharegpt_output_len": 1687, "burstgpt": 1688, "random_prefix_len": 1689, "random_input_len": 1690, "random_output_len": 1691, "random_range_ra": 1692, "keyerror": 1693, "top_k": 1694, "min_p": 1695, "openai_compatible_backends": 1696, "greedy": 1697, "llama": 1698, "cache_prompt": 1699, "static": 1700, "pause": 1701, "freeze": 1702, "benchmark_result": 1703, "percentile_metrics": 1704, "metric_percentiles": 1705, "config": 1706, "save_result": 1707, "append_result": 1708, "result_json": 1709, "current_dt": 1710, "strftime": 1711, "date": 1712, "metadata": 1713, "kvstring": 1714, "ramp_up_stra": 1715, "save_detailed": 1716, "fields": 1717, "points": 1718, "field": 1719, "del": 1720, "base_model_id": 1721, "max_concurrency_str": 1722, "qps": 1723, "result_filename": 1724, "result_dir": 1725, "outfile": 1726, "newline": 1727, "tell": 1728, "online": 1729, "keys": 1730, "server": 1731, "127": 1732, "localhost": 1733, "ipv4": 1734, "8000": 1735, "concurrent": 1736, "simulate": 1737, "enforcing": 1738, "controls": 1739, "initiated": 1740, "control": 1741, "allowed": 1742, "means": 1743, "combination": 1744, "ile": 1745, "enough": 1746, "compute": 1747, "part": 1748, "unspecified": 1749, "disabled": 1750, "dummy": 1751, "logprob": 1752, "returned": 1753, "sent": 1754, "arrival": 1755, "take": 1756, "effect": 1757, "whic": 1758, "follows": 1759, "intervals": 1760, "bursty": 1761, "uniform": 1762, "trust": 1763, "progress": 1764, "bar": 1765, "launched": 1766, "detailed": 1767, "saving": 1768, "whether": 1769, "information": 1770, "ttfs": 1771, "etc": 1772, "metavar": 1773, "tp": 1774, "record": 1775, "keeping": 1776, "purposes": 1777, "dir": 1778, "ignore": 1779, "eos": 1780, "flag": 1781, "sending": 1782, "deepspeed_mii": 1783, "comma": 1784, "separated": 1785, "report": 1786, "percentils": 1787, "names": 1788, "th": 1789, "centiles": 1790, "spaces": 1791, "definition": 1792, "refer": 1793, "distserve": 1794, "arxiv": 1795, "org": 1796, "pdf": 1797, "2401": 1798, "09670": 1799, "blog": 1800, "hao": 1801, "ai": 1802, "lab": 1803, "blogs": 1804, "custom_group": 1805, "add_argument_group": 1806, "options": 1807, "applying": 1808, "sonnet_group": 1809, "550": 1810, "150": 1811, "sharegpt_group": 1812, "add_": 1813, "random_group": 1814, "ratio": 1815, "define": 1816, "symmetric": 1817, "fixed": 1818, "hf_group": 1819, "subset": 1820, "t_len": 1821, "sampling_group": 1822, "top": 1823, "always": 1824, "mistral_common": 1825, "ustom": 1826, "preregistered": 1827, "served": 1828, "passed": 1829, "launching": 1830, "script": 1831, "chooses": 1832, "needs": 1833, "ending": 1834, "unique": 1835, "json_schema_path": 1836, "dir_path": 1837, "realpath": 1838, "__file__": 1839, "structured_schemas": 1840, "structured_schema_1": 1841, "json_schemas": 1842, "schema": 1843, "deepcopy": 1844, "properties": 1845, "__optional_field_": 1846, "uuid": 1847, "uuid4": 1848, "schemas": 1849, "gen_prompt": 1850, "brief": 1851, "dumps": 1852, "get_schema": 1853, "structure_type": 1854, "grammar": 1855, "select_statement": 1856, "table": 1857, "condition": 1858, "col_1": 1859, "col_2": 1860, "ture_type": 1861, "table_1": 1862, "table_2": 1863, "sql": 1864, "query": 1865, "username": 1866, "email": 1867, "users": 1868, "regex": 1869, "address": 1870, "alan": 1871, "turing": 1872, "who": 1873, "works": 1874, "enigma": 1875, "positive": 1876, "classify": 1877, "sentiment": 1878, "wonderful": 1879, "um_prompts": 1880, "xgrammar_bench": 1881, "nousresearch": 1882, "eval": 1883, "full_dataset_len": 1884, "_filter_func": 1885, "has_xgrammar_unsupported_json_features": 1886, "num_filtered_out": 1887, "features": 1888, "len_dataset": 1889, "data_point_idx": 1890, "idx": 1891, "asyncgenerator": 1892, "asynchronously": 1893, "generates": 1894, "represented": 1895, "takes": 1896, "scale": 1897, "theta": 1898, "maintain": 1899, "enumerate": 1900, "yield": 1901, "infinity": 1902, "wait": 1903, "interval": 1904, "shape": 1905, "sleep": 1906, "std_tpot_": 1907, "kend": 1908, "structured_output_ratio": 1909, "prepare_extra_body": 1910, "structured_output_req_idx": 1911, "test_request": 1912, "test_req_extra_body": 1913, "prepare_extra_": 1914, "ttft_description": 1915, "series": 1916, "describe": 1917, "tpot_description": 1918, "ret": 1919, "gt": 1920, "l_output_lens": 1921, "evaluate": 1922, "_eval_correctness_json": 1923, "_eval_correctness_choice": 1924, "_eval_correctness_regex": 1925, "_eval_correctness": 1926, "guided_json": 1927, "guided_regex": 1928, "guided_choice": 1929, "scores": 1930, "res": 1931, "score": 1932, "correctness": 1933, "not_none_scores": 1934, "guided_grammar": 1935, "no_structured_output": 1936, "save_results": 1937, "result_file_name": 1938, "guided": 1939, "_out": 1940, "ackend": 1941, "correct_rate": 1942, "uest": 1943, "pa": 1944, "add_argum": 1945, "structured": 1946, "requestoutput": 1947, "textprompt": 1948, "tokensprompt": 1949, "lora_requests": 1950, "enable_lora": 1951, "beamsearch": 1952, "promp": 1953, "run_vllm_chat": 1954, "recommended": 1955, "benchmarking": 1956, "properly": 1957, "handles": 1958, "run_vllm_async": 1959, "asyncengineargs": 1960, "disable_frontend_multiprocessing": 1961, "build_async_engine_client_from_engine_args": 1962, "get_model_config": 1963, "generators": 1964, "sp": 1965, "lr": 1966, "_tokens": 1967, "generator": 1968, "request_id": 1969, "all_gens": 1970, "merge_async_iterators": 1971, "run_hf": 1972, "max_batch_size": 1973, "automodelforcausallm": 1974, "torch_dtype": 1975, "float16": 1976, "model_type": 1977, "padding": 1978, "pad_token": 1979, "eos_token": 1980, "max_output_len": 1981, "next_prompt_len": 1982, "next_output_len": 1983, "return_tensors": 1984, "llm_outputs": 1985, "num_return_sequences": 1986, "use_cache": 1987, "batch_": 1988, "batch_decode": 1989, "skip_special_tokens": 1990, "clear": 1991, "run_mii": 1992, "tensor_parallel_size": 1993, "client": 1994, "serve": 1995, "tensor_parallel": 1996, "terminate_server": 1997, "get_requests": 1998, "common_kwargs": 1999, "sample_kwargs": 2000, "dataset_cls": 2001, "da": 2002, "uctcoderdataset": 2003, "is_multi_modal": 2004, "request_outputs": 2005, "async_engine": 2006, "uvloop": 2007, "hf_max_batch_size": 2008, "total_prompt_tokens": 2009, "tot": 2010, "gs": 2011, "ro": 2012, "033": 2013, "91mwarning": 2014, "0m": 2015, "detected": 2016, "counted": 2017, "issues": 2018, "9778": 2019, "counts": 2020, "total_n": 2021, "validate_args": 2022, "deprecation": 2023, "defaulting": 2024, "deprecated": 2025, "validation": 2026, "valid_backends": 2027, "configuration": 2028, "checks": 2029, "ignored": 2030, "settings": 2031, "validations": 2032, "quantization": 2033, "parallel": 2034, "currently": 2035, "16222": 2036, "data_parallel_size": 2037, "offline": 2038, "prompt_or_response": 2039, "frontend": 2040, "multiprocessing": 2041, "decoupled": 2042, "adapters": 2043, "relative": 2044, "hugging": 2045, "face": 2046, "much": 2047, "versus": 2048, "remains": 2049, "approximately": 2050, "defaul": 2051, "_len": 2052, "dtaset": 2053, "oss": 2054, "wiki": 2055, "integrate": 2056, "database": 2057, "records": 2058, "benchmark_values": 2059, "vars": 2060, "infencoder": 2061, "clear_inf": 2062, "math": 2063, "isinf": 2064, "iterencode": 2065, "serializable": 2066, "_sum": 2067, "_max": 2068, "monotonic_ns": 2069, "__enter__": 2070, "__exit__": 2071, "exc_type": 2072, "baseexception": 2073, "exc_value": 2074, "exc_traceback": 2075, "tracebacktype": 2076, "argumentparser": 2077, "disaggregation": 2078, "proxy": 2079, "300": 2080, "services": 2081, "queue": 2082, "limit": 2083, "prefill": 2084, "8100": 2085, "8200": 2086, "clienttimeout": 2087, "max_concurrent_requests": 2088, "max_concurrent": 2089, "request_queue_size": 2090, "queue_size": 2091, "rate_limit": 2092, "prefill_service_url": 2093, "prefill_url": 2094, "decode_service_url": 2095, "decode_url": 2096, "app": 2097, "quart": 2098, "limiter": 2099, "rate_limiter": 2100, "ratelimiter": 2101, "request_queue": 2102, "requestqueue": 2103, "attach": 2104, "instance": 2105, "startup": 2106, "before_serving": 2107, "starts": 2108, "forward_request": 2109, "forward": 2110, "limiting": 2111, "handling": 2112, "manager": 2113, "chunks": 2114, "iter_chunked": 2115, "handle": 2116, "error_text": 2117, "clienterror": 2118, "connection": 2119, "unavailable": 2120, "timeouterror": 2121, "connecting": 2122, "process_request": 2123, "through": 2124, "stages": 2125, "original_request_data": 2126, "get_json": 2127, "prefill_request": 2128, "stage": 2129, "make_response": 2130, "reque": 2131, "orward_request": 2132, "internal": 2133, "route": 2134, "methods": 2135, "handle_request": 2136, "incoming": 2137, "enqueue": 2138, "reject": 2139, "full": 2140, "busy": 2141, "503": 2142, "cancellederror": 2143, "cancellation": 2144, "cancelled": 2145, "bucket": 2146, "num_available_tokens": 2147, "last_refill": 2148, "monotonic": 2149, "refill": 2150, "synchronization": 2151, "acquire": 2152, "current_time": 2153, "elapsed": 2154, "wait_time": 2155, "__aenter__": 2156, "enter": 2157, "__aexit__": 2158, "cleanup": 2159, "collections": 2160, "deque": 2161, "max_queue_size": 2162, "sync": 2163, "queued": 2164, "popleft": 2165, "event": 2166, "loop": 2167, "itertools": 2168, "web": 2169, "roundrobinproxy": 2170, "target_ports": 2171, "port_cycle": 2172, "cycle": 2173, "target_port": 2174, "target_url": 2175, "path_qs": 2176, "resp": 2177, "streamresponse": 2178, "iter_any": 2179, "write_eof": 2180, "router": 2181, "add_route": 2182, "runner": 2183, "apprunner": 2184, "site": 2185, "tcpsite": 2186, "running": 2187, "matplotlib": 2188, "pyplot": 2189, "plt": 2190, "pandas": 2191, "disagg_prefill": 2192, "chunked_prefill": 2193, "from_dict": 2194, "dis_df": 2195, "chu_df": 2196, "style": 2197, "bmh": 2198, "rcparams": 2199, "font": 2200, "fig": 2201, "ax": 2202, "subplots": 2203, "figsize": 2204, "plot": 2205, "label": 2206, "linewidth": 2207, "legend": 2208, "set_xlabel": 2209, "set_ylabel": 2210, "set_ylim": 2211, "bottom": 2212, "savefig": 2213, "png": 2214, "bench_fn": 2215, "sub_label": 2216, "tmeasurement": 2217, "min_run_time": 2218, "globals": 2219, "tbenchmark": 2220, "timer": 2221, "stmt": 2222, "blocked_autorange": 2223, "bench_int8": 2224, "int8": 2225, "b_compressed": 2226, "make_rand_sparse_tensors": 2227, "scale_a": 2228, "tensor": 2229, "device": 2230, "float32": 2231, "scale_b": 2232, "bias": 2233, "zeros": 2234, "bfloat16": 2235, "ops": 2236, "cutlass_scaled_sparse_mm": 2237, "out_ref": 2238, "cutlass_scaled_mm": 2239, "allclose": 2240, "incorrect": 2241, "correct": 2242, "timers": 2243, "impl": 2244, "pytorch_bf16_bf16_bf16_matmul": 2245, "scales": 2246, "mm": 2247, "pytorch_fp16_fp16_fp16_matmul": 2248, "cutlass": 2249, "cutlass_i8_i8_bf16_scaled_mm": 2250, "cutlass_i8_i8_bf16_scaled_mm_bias": 2251, "ers": 2252, "sparse": 2253, "cutlass_i8_i8_bf16_scaled_sparse_mm": 2254, "cutlass_i8_i8_bf16_scaled_sparse_mm_bias": 2255, "bench_fp8": 2256, "float8_e4m3fn": 2257, "bf16": 2258, "fp8": 2259, "accum": 2260, "pytorch_fp8_fp8_bf16_scaled_mm": 2261, "_scaled_mm": 2262, "out_dtype": 2263, "pytorch_fp8_fp8_bf16_scaled_mm_fast_accum": 2264, "use_fast_accum": 2265, "fp16": 2266, "pytorch_fp8_fp8_fp16_scaled_mm": 2267, "pytorch_fp8_fp8_fp16_scaled_mm_fast_accum": 2268, "cutlass_fp8_fp8_bf16_scaled_mm": 2269, "cutlass_fp8_fp8_bf16_scaled_sparse_mm": 2270, "cutlass_fp8_fp8_fp16_scaled_sparse_mm": 2271, "cutlass_fp8_fp8_bf16_scaled_sparse_mm_bias": 2272, "cutlass_fp8_fp8_fp16_scaled_sparse_mm_bias": 2273, "bench": 2274, "print_timers": 2275, "compare": 2276, "mkns": 2277, "scaled": 2278, "gemm": 2279, "mkn": 2280, "make_output": 2281, "base_description": 2282, "pickle": 2283, "pkl": 2284, "run_square_bench": 2285, "dim_sizes": 2286, "dim_start": 2287, "dim_end": 2288, "dim_increment": 2289, "square_bench": 2290, "run_range_bench": 2291, "m_constant": 2292, "ks": 2293, "k_constant": 2294, "ns": 2295, "n_constant": 2296, "range_bench": 2297, "run_model_bench": 2298, "model_shapes": 2299, "tp_size": 2300, "kns": 2301, "kn": 2302, "tp_split_dim": 2303, "weight_shapes": 2304, "model_bench_data": 2305, "models_tps": 2306, "product": 2307, "tp_sizes": 2308, "batch_sizes": 2309, "model_tp": 2310, "all_data": 2311, "model_bench": 2312, "to_fp8": 2313, "finfo": 2314, "clamp": 2315, "to_int8": 2316, "to_bf16": 2317, "to_fp16": 2318, "make_rand_tensors": 2319, "randn": 2320, "prune_to_2_4": 2321, "reshape": 2322, "groups": 2323, "original_shape": 2324, "reshaped": 2325, "indices": 2326, "topk": 2327, "abs": 2328, "dim": 2329, "binary": 2330, "mask": 2331, "zeros_like": 2332, "scatter_": 2333, "ones_like": 2334, "pruned": 2335, "turn": 2336, "cutlass_sparse_compress": 2337, "compressed": 2338, "make_n_rand_sparse_tensors": 2339, "num_tensors": 2340, "b_comp": 2341, "bcomps": 2342, "es": 2343, "bs": 2344, "bench_kernels": 2345, "kernels": 2346, "azp": 2347, "int32": 2348, "azp_adj": 2349, "bench_fns": 2350, "cutlass_i8_i8_bf16_scaled_mm_azp": 2351, "cutlass_scaled_mm_azp": 2352, "cutlass_i8_i8_bf16_scaled_mm_azp_bias": 2353, "cutlass_i8_i8_bf16_scaled_mm_azp_pt": 2354, "cutlass_i8_i8_bf16_scaled_mm_azp_pt_bias": 2355, "matches": 2356, "a_cont": 2357, "contiguous": 2358, "block_scale_a": 2359, "rand": 2360, "cdiv": 2361, "block_scale_b": 2362, "block_scale_a_m_major": 2363, "block_scale_b_k_major": 2364, "fp8_bf16_scaled_mm_fast_accum": 2365, "cutlass_fp8_fp8_fp16_scaled_mm": 2366, "cutlass_fp8_fp8_bf16_scaled_mm_bias": 2367, "cutlass_fp8_fp8_fp16_scaled_mm_bias": 2368, "triton_fp8_fp8_fp16_scaled_mm_blockwise": 2369, "w8a8_block_fp8_matmul": 2370, "cutlass_fp8_fp8_fp16_scaled_mm_blockwise": 2371, "weight": 2372, "shapes": 2373, "14336": 2374, "4096": 2375, "tp1": 2376, "tp2": 2377, "7168": 2378, "6144": 2379, "tp4": 2380, "1536": 2381, "mistralai": 2382, "7b": 2383, "v0": 2384, "28672": 2385, "meta": 2386, "12288": 2387, "22016": 2388, "11008": 2389, "8b": 2390, "13b": 2391, "5120": 2392, "15360": 2393, "27648": 2394, "13824": 2395, "70b": 2396, "8192": 2397, "10240": 2398, "57344": 2399, "enforce_eager": 2400, "cprofile": 2401, "long_prompt": 2402, "runctx": 2403, "locals": 2404, "analyze": 2405, "hashing": 2406, "pstats": 2407, "sort_stats": 2408, "cumulative": 2409, "total_time": 2410, "total_calls": 2411, "func": 2412, "hash_of_block": 2413, "total_tt": 2414, "took": 2415, "ndarray": 2416, "uniformdistribution": 2417, "min_val": 2418, "max_val": 2419, "is_integer": 2420, "__repr__": 2421, "constantdistribution": 2422, "fill_value": 2423, "constant": 2424, "zipfdistribution": 2425, "alpha": 2426, "zipf": 2427, "poissondistribution": 2428, "lognormaldistribution": 2429, "sigma": 2430, "lognormal": 2431, "astype": 2432, "verify_field_exists": 2433, "conf": 2434, "field_name": 2435, "section": 2436, "subsection": 2437, "get_random_distribution": 2438, "prompt_input": 2439, "prompt_output": 2440, "num_turns": 2441, "num_tokens": 2442, "prefix_num_tokens": 2443, "min_value": 2444, "max_value": 2445, "parse_input_json_file": 2446, "genconvargs": 2447, "required_fields": 2448, "num_conversations": 2449, "text_files": 2450, "generate_conversations": 2451, "larger": 2452, "zero": 2453, "workload": 2454, "input_num_turns": 2455, "input_num_tokens": 2456, "input_common_prefix_num_tokens": 2457, "common_prefix_num_tokens": 2458, "input_prefix_num_tokens": 2459, "output_num_tokens": 2460, "print_stats": 2461, "print_conv_stats": 2462, "conversationsmap": 2463, "conv_stats": 2464, "req_stats": 2465, "ncollecting": 2466, "dicts": 2467, "user_tokens": 2468, "assistant_tokens": 2469, "request_tokens": 2470, "req_tokens": 2471, "including": 2472, "assistant": 2473, "answer": 2474, "item_stats": 2475, "conversation_turns": 2476, "text_separator": 2477, "color": 2478, "yellow": 2479, "reset": 2480, "transpose": 2481, "appended": 2482, "base_prompt_text": 2483, "rewrite": 2484, "base_prompt_token_count": 2485, "purple": 2486, "list_of_tokens": 2487, "tokens_in_file": 2488, "conv_id": 2489, "every": 2490, "turn_count": 2491, "even": 2492, "conv_prefix_tokens": 2493, "shared": 2494, "jump": 2495, "sections": 2496, "common_prefix_text": 2497, "common_prefix_tokens": 2498, "separate": 2499, "sentences": 2500, "bas": 2501, "messageslist": 2502, "nturns": 2503, "input_token_count": 2504, "output_token_count": 2505, "user_turn": 2506, "turn_id": 2507, "nice": 2508, "left": 2509, "start_offset": 2510, "end_offset": 2511, "prefix_num_toke": 2512, "question": 2513, "answers": 2514, "min_tokens": 2515, "message": 2516, "conv_id_": 2517, "offset": 2518, "conversations_list_to_dict": 2519, "input_list": 2520, "sharegptconversations": 2521, "about": 2522, "conv_data": 2523, "999": 2524, "9999": 2525, "conversations_dict_to_list": 2526, "input_dict": 2527, "new_item": 2528, "enum": 2529, "red": 2530, "91m": 2531, "green": 2532, "92m": 2533, "blue": 2534, "94m": 2535, "95m": 2536, "cyan": 2537, "96m": 2538, "93m": 2539, "__str__": 2540, "basicconfig": 2541, "asctime": 2542, "levelname": 2543, "datefmt": 2544, "getlogger": 2545, "conversationsampling": 2546, "serverresponse": 2547, "ttft_ms": 2548, "tpot_ms": 2549, "latency_ms": 2550, "requeststats": 2551, "output_num_chunks": 2552, "output_num_first_chunk_tokens": 2553, "approx_cached_percent": 2554, "metricstats": 2555, "movingaverage": 2556, "window_size": 2557, "window": 2558, "new_value": 2559, "filling": 2560, "replacing": 2561, "old": 2562, "old_value": 2563, "debugstats": 2564, "moving_avg_ttft_ms": 2565, "moving_avg_tpot_ms": 2566, "kv_info": 2567, "remove_prefix": 2568, "nanosec_to_millisec": 2569, "1000000": 2570, "nanosec_to_sec": 2571, "1000000000": 2572, "send_request": 2573, "chat_url": 2574, "timeout_sec": 2575, "120": 2576, "200ms": 2577, "valid_response": 2578, "chunk_delay": 2579, "first_chunk": 2580, "perf_counter_ns": 2581, "http_status": 2582, "httpstatus": 2583, "ok": 2584, "messa": 2585, "first_token_time": 2586, "phrase": 2587, "num_chunks": 2588, "atency": 2589, "start_time_ms": 2590, "get_short_string": 2591, "400": 2592, "get_token_count": 2593, "get_messages_token_count": 2594, "token_count": 2595, "send_turn": 2596, "client_id": 2597, "conversation_messages": 2598, "messages_to_use": 2599, "req_args": 2600, "requestargs": 2601, "verify_output": 2602, "verify": 2603, "upper": 2604, "limit_min_tokens": 2605, "limit_max_tokens": 2606, "num_tokens_from_dataset": 2607, "assistant_answer": 2608, "answer_num_tokens": 2609, "num_tok": 2610, "sages_to_use": 2611, "question_num_tokens": 2612, "history_num_tokens": 2613, "first_chunk_tokens": 2614, "output_content": 2615, "approximated": 2616, "percent": 2617, "decode_ms": 2618, "decode_num_tokens": 2619, "first_chunk_token": 2620, "case": 2621, "had": 2622, "adjust": 2623, "delta_ms": 2624, "rs": 2625, "conversation_id": 2626, "70": 2627, "answer_index": 2628, "orig_content": 2629, "debug_info": 2630, "new_answer": 2631, "poisson_sleep": 2632, "sleeping": 2633, "client_main": 2634, "clientargs": 2635, "stop_event": 2636, "mp": 2637, "task_queue": 2638, 