{"spdx": 0, "license": 1, "identifier": 2, "apache": 3, "filecopyrighttext": 4, "copyright": 5, "contributors": 6, "vllm": 7, "project": 8, "import": 9, "importlib": 10, "traceback": 11, "from": 12, "typing": 13, "callable": 14, "unittest": 15, "mock": 16, "patch": 17, "def": 18, "find_cuda_init": 19, "fn": 20, "object": 21, "none": 22, "helper": 23, "function": 24, "debug": 25, "cuda": 26, "re": 27, "initialization": 28, "errors": 29, "initializes": 30, "prints": 31, "stack": 32, "trace": 33, "how": 34, "happens": 35, "torch": 36, "_lazy_init": 37, "wrapper": 38, "nonlocal": 39, "extract_stack": 40, "return": 41, "print": 42, "initialized": 43, "join": 44, "format_list": 45, "strip": 46, "__name__": 47, "__main__": 48, "lambda": 49, "import_module": 50, "model_executor": 51, "models": 52, "llava": 53, "ctypes": 54, "util": 55, "json": 56, "logging": 57, "os": 58, "shutil": 59, "subprocess": 60, "sys": 61, "pathlib": 62, "path": 63, "which": 64, "packaging": 65, "version": 66, "parse": 67, "setuptools": 68, "extension": 69, "setup": 70, "command": 71, "build_ext": 72, "setuptools_scm": 73, "get_version": 74, "utils": 75, "cpp_extension": 76, "cuda_home": 77, "rocm_home": 78, "load_module_from_path": 79, "module_name": 80, "spec": 81, "spec_from_file_location": 82, "module": 83, "module_from_spec": 84, "modules": 85, "loader": 86, "exec_module": 87, "root_dir": 88, "__file__": 89, "parent": 90, "logger": 91, "getlogger": 92, "envs": 93, "py": 94, "vllm_target_device": 95, "main_cuda_version": 96, "12": 97, "is_sccache_available": 98, "bool": 99, "sccache": 100, "int": 101, "getenv": 102, "vllm_disable_sccache": 103, "is_ccache_available": 104, "ccache": 105, "is_ninja_available": 106, "ninja": 107, "is_url_available": 108, "url": 109, "str": 110, "urllib": 111, "request": 112, "urlopen": 113, "status": 114, "try": 115, "except": 116, "exception": 117, "false": 118, "200": 119, "class": 120, "cmakeextension": 121, "__init__": 122, "self": 123, "name": 124, "cmake_lists_dir": 125, "kwa": 126, "super": 127, "sources": 128, "py_limited_api": 129, "true": 130, "abspath": 131, "cmake_build_ext": 132, "dict": 133, "directories": 134, "have": 135, "been": 136, "configured": 137, "did_config": 138, "determine": 139, "number": 140, "compilation": 141, "jobs": 142, "optionally": 143, "nvcc": 144, "compile": 145, "threads": 146, "compute_num_jobs": 147, "num_jobs": 148, "either": 149, "value": 150, "max_jobs": 151, "environment": 152, "variable": 153, "defined": 154, "cpus": 155, "available": 156, "info": 157, "using": 158, "else": 159, "sched_getaffinity": 160, "isn": 161, "universally": 162, "so": 163, "fall": 164, "back": 165, "cpu_count": 166, "we": 167, "get": 168, "error": 169, "here": 170, "len": 171, "attributeerror": 172, "nvcc_threads": 173, "_is_cuda": 174, "get_nvcc_cuda_version": 175, "11": 176, "when": 177, "set": 178, "reduce": 179, "avoid": 180, "overloading": 181, "system": 182, "max": 183, "perform": 184, "cmake": 185, "configuration": 186, "single": 187, "configure": 188, "ext": 189, "ve": 190, "already": 191, "cmakelists": 192, "txt": 193, "exit": 194, "early": 195, "select": 196, "build": 197, "type": 198, "note": 199, "optimization": 200, "level": 201, "default_cfg": 202, "relwithdebinfo": 203, "cfg": 204, "cmake_build_type": 205, "cmake_args": 206, "dcmake_build_type": 207, "format": 208, "dvllm_target_device": 209, "verbose": 210, "dcmake_verbose_makefile": 211, "dcmake_c_compiler_launcher": 212, "dcmake_cxx_compiler_launcher": 213, "dcmake_cuda_compiler_launcher": 214, "dcmake_hip_compiler_launcher": 215, "elif": 216, "pass": 217, "python": 218, "executable": 219, "can": 220, "find": 221, "exact": 222, "match": 223, "dvllm_python_executable": 224, "reuse": 225, "dependencies": 226, "subsequent": 227, "calls": 228, "dvllm_python_path": 229, "override": 230, "base": 231, "directory": 232, "fetchcontent": 233, "downloads": 234, "root": 235, "deps": 236, "allows": 237, "sharing": 238, "between": 239, "profiles": 240, "plays": 241, "more": 242, "nicely": 243, "fetchcontent_base_dir": 244, "fc_base_dir": 245, "environ": 246, "dfetchcontent_base_dir": 247, "parallelism": 248, "tool": 249, "num_jo": 250, "obs": 251, "dnvcc_threads": 252, "build_tool": 253, "dcmake_job_pool_compile": 254, "string": 255, "dcmake_job_pools": 256, "default": 257, "whatever": 258, "picks": 259, "make": 260, "sure": 261, "use": 262, "dcmake_cuda_compiler": 263, "bin": 264, "check_call": 265, "cwd": 266, "build_temp": 267, "build_extensions": 268, "ensure": 269, "present": 270, "working": 271, "check_output": 272, "oserror": 273, "raise": 274, "runtimeerror": 275, "cannot": 276, "create": 277, "does": 278, "exist": 279, "exists": 280, "makedirs": 281, "targets": 282, "target_name": 283, "removeprefix": 284, "vllm_flash_attn": 285, "all": 286, "extensions": 287, "append": 288, "build_args": 289, "target": 290, "install": 291, "libraries": 292, "proper": 293, "location": 294, "outdir": 295, "get_ext_fullpath": 296, "absolute": 297, "skip": 298, "direc": 299, "ctory": 300, "same": 301, "continue": 302, "appends": 303, "prefix": 304, "contains": 305, "need": 306, "remove": 307, "range": 308, "count": 309, "should": 310, "actually": 311, "components": 312, "install_args": 313, "component": 314, "run": 315, "first": 316, "standard": 317, "copy": 318, "build_lib": 319, "current": 320, "included": 321, "editable": 322, "glob": 323, "files": 324, "recursive": 325, "file": 326, "dst_file": 327, "split": 328, "copying": 329, "dirname": 330, "exist_ok": 331, "copy_file": 332, "precompiled_build_ext": 333, "disables": 334, "building": 335, "precompiled": 336, "binaries": 337, "assert": 338, "vllm_use_precompiled": 339, "only": 340, "supported": 341, "builds": 342, "skipping": 343, "precompiled_wheel_utils": 344, "extracts": 345, "other": 346, "existing": 347, "wheel": 348, "staticmethod": 349, "extract_precompiled_and_patch_package": 350, "wheel_url_or_path": 351, "tempfile": 352, "zipfile": 353, "temp_dir": 354, "isfile": 355, "wheel_filename": 356, "mkdtemp": 357, "wheels": 358, "wheel_path": 359, "downloading": 360, "urlretrieve": 361, "filename": 362, "package_data_patch": 363, "files_to_copy": 364, "_c": 365, "abi3": 366, "_moe_c": 367, "_flashmla_c": 368, "_vllm_fa2_c": 369, "_vllm_fa3_c": 370, "cumem_allocator": 371, "compiled_regex": 372, "file_members": 373, "list": 374, "filter": 375, "filelist": 376, "extract": 377, "target_path": 378, "target_pa": 379, "ath": 380, "open": 381, "src": 382, "wb": 383, "dst": 384, "copyfileobj": 385, "pkg": 386, "replace": 387, "setdefault": 388, "basename": 389, "finally": 390, "removing": 391, "temporary": 392, "rmtree": 393, "get_base_commit_in_main_branch": 394, "force": 395, "nightly": 396, "mainly": 397, "used": 398, "ci": 399, "testing": 400, "vllm_test_use_precompiled_nightly_wheel": 401, "latest": 402, "commit": 403, "hash": 404, "upstream": 405, "main": 406, "branch": 407, "resp_json": 408, "curl": 409, "https": 410, "api": 411, "github": 412, "com": 413, "repos": 414, "commits": 415, "decode": 416, "utf": 417, "upstream_main_commit": 418, "loads": 419, "sha": 420, "docker": 421, "context": 422, "git": 423, "may": 424, "immutable": 425, "missing": 426, "vllm_docker_build_context": 427, "check": 428, "local": 429, "repo": 430, "cat": 431, "calledprocesserror": 432, "fetch": 433, "remote": 434, "repository": 435, "update": 436, "any": 437, "branches": 438, "ensures": 439, "ref": 440, "its": 441, "history": 442, "our": 443, "current_branch": 444, "show": 445, "base_commit": 446, "merge": 447, "valueerror": 448, "err": 449, "warning": 450, "failed": 451, "compatible": 452, "your": 453, "dev": 454, "_no_device": 455, "empty": 456, "has_cuda": 457, "_is_neuron": 458, "_is_tpu": 459, "_is_hip": 460, "rocm": 461, "hip": 462, "neuron": 463, "tpu": 464, "_is_cpu": 465, "cpu": 466, "_is_xpu": 467, "xpu": 468, "_build_custom_ops": 469, "get_rocm_version": 470, "librocm": 471, "core": 472, "see": 473, "blob": 474, "d11f5c20d500f729c393680a01fa902ebf92094b": 475, "rocm_version": 476, "cpp": 477, "l21": 478, "librocm_core_file": 479, "lib": 480, "is_file": 481, "librocm_core": 482, "cdll": 483, "vererrors": 484, "c_uint32": 485, "get_rocm_core_version": 486, "getrocmversion": 487, "restype": 488, "argtypes": 489, "pointer": 490, "major": 491, "minor": 492, "byref": 493, "get_neuronxcc_version": 494, "sysconfig": 495, "site_dir": 496, "get_paths": 497, "purelib": 498, "version_file": 499, "neuronxcc": 500, "executed": 501, "successfully": 502, "fp": 503, "content": 504, "read": 505, "regular": 506, "expression": 507, "search": 508, "__version__": 509, "group": 510, "could": 511, "output": 512, "adapted": 513, "nvidia": 514, "apex": 515, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 516, "nvcc_output": 517, "universal_newlines": 518, "release_idx": 519, "index": 520, "release": 521, "nvcc_cuda_version": 522, "get_gaudi_sw_version": 523, "returns": 524, "driver": 525, "enable": 526, "console": 527, "printing": 528, "hl": 529, "smi": 530, "shell": 531, "text": 532, "capture_output": 533, "env": 534, "enable_console": 535, "returncode": 536, "stdout": 537, "get_vllm_version": 538, "write_to": 539, "_version": 540, "sep": 541, "versions": 542, "might": 543, "contain": 544, "cuda_version": 545, "cuda_version_str": 546, "source": 547, "tarball": 548, "required": 549, "pypi": 550, "sdist": 551, "argv": 552, "cu": 553, "neuron_version": 554, "neuron_version_str": 555, "unknown": 556, "runtime": 557, "get_requirements": 558, "package": 559, "requirements": 560, "requirements_dir": 561, "_read_requirements": 562, "resolved_requirements": 563, "line": 564, "startswith": 565, "common": 566, "cuda_major": 567, "cuda_minor": 568, "modified_requirements": 569, "req": 570, "flash": 571, "attn": 572, "built": 573, "unsupported": 574, "platform": 575, "please": 576, "ext_modules": 577, "package_data": 578, "typed": 579, "layers": 580, "fused_moe": 581, "configs": 582, "quantization": 583, "requires_files": 584, "pyproject": 585, "toml": 586, "cleaning": 587, "lines": 588, "readlines": 589, "lower": 590, "removed": 591, "write": 592, "done": 593, "dataclasses": 594, "random": 595, "time": 596, "optional": 597, "transformers": 598, "pretrainedtokenizerbase": 599, "llm": 600, "samplingparams": 601, "engine": 602, "arg_utils": 603, "engineargs": 604, "flexibleargumentparser": 605, "prompt": 606, "you": 607, "helpful": 608, "assistant": 609, "recognizes": 610, "tables": 611, "markdown": 612, "table": 613, "fellows": 614, "answer": 615, "my": 616, "question": 617, "about": 618, "opening": 619, "sl": 620, "film": 621, "cast": 622, "director": 623, "music": 624, "notes": 625, "agni": 626, "pushpam": 627, "jayabharathi": 628, "kamalahasan": 629, "jeassy": 630, "arjunan": 631, "16": 632, "priyamvada": 633, "mohan": 634, "sharma": 635, "lakshmi": 636, "kpac": 637, "lalitha": 638, "sethumadhavan": 639, "dakshinamoorthy": 640, "23": 641, "yakshagaanam": 642, "madhu": 643, "sheela": 644, "viswanathan": 645, "30": 646, "paalkkadal": 647, "sharada": 648, "prasad": 649, "ummer": 650, "amma": 651, "srividya": 652, "krishnan": 653, "nair": 654, "13": 655, "appooppan": 656, "thikkurissi": 657, "sukumaran": 658, "kamal": 659, "haasan": 660, "bhaskaran": 661, "baburaj": 662, "20": 663, "srishti": 664, "chowalloor": 665, "krishnankutty": 666, "ravi": 667, "alummoodu": 668, "muhammad": 669, "vanadevatha": 670, "prem": 671, "nazir": 672, "madhubala": 673, "yusufali": 674, "kechery": 675, "devarajan": 676, "27": 677, "samasya": 678, "kamalahaasan": 679, "thankappan": 680, "shyam": 681, "10": 682, "yudhabhoomi": 683, "vidhubala": 684, "crossbelt": 685, "mani": 686, "shekhar": 687, "seemantha": 688, "puthran": 689, "raj": 690, "swapnadanam": 691, "rani": 692, "chandra": 693, "dr": 694, "mohandas": 695, "george": 696, "bhaskar": 697, "chandavarkar": 698, "19": 699, "thulavarsham": 700, "sreedevi": 701, "sudheer": 702, "sankaran": 703, "14": 704, "aruthu": 705, "kaviyoor": 706, "ponnamma": 707, "26": 708, "15": 709, "swimming": 710, "pool": 711, "soman": 712, "sasikumar": 713, "nwhat": 714, "cells": 715, "test_prefix": 716, "sampling_params": 717, "prompts": 718, "start_time": 719, "generate": 720, "end_time": 721, "cost": 722, "prompt_len": 723, "output_len": 724, "sample_tokens": 725, "tokenizer": 726, "length": 727, "vocab": 728, "get_vocab": 729, "all_special_ids": 730, "special": 731, "tokens": 732, "choices": 733, "items": 734, "sample_requests_from_dataset": 735, "dataset_path": 736, "num_requests": 737, "input_length_range": 738, "tuple": 739, "fixed_output_len": 740, "too": 741, "small": 742, "load": 743, "dataset": 744, "out": 745, "conversations": 746, "less": 747, "than": 748, "turns": 749, "data": 750, "keep": 751, "two": 752, "each": 753, "conversation": 754, "shuffle": 755, "min_len": 756, "max_len": 757, "sequences": 758, "long": 759, "short": 760, "filtered_requests": 761, "break": 762, "tokenize": 763, "completions": 764, "prompt_token_ids": 765, "input_ids": 766, "completion": 767, "completion_token_ids": 768, "sample_requests_from_random": 769, "prefix_len": 770, "requests": 771, "prefix_token_ids": 772, "unique_part_token_ids": 773, "randint": 774, "repeat_and_sort_requests": 775, "repeat_count": 776, "sort": 777, "repeated_requests": 778, "key": 779, "args": 780, "get_tokenizer": 781, "model": 782, "trust_remote_code": 783, "map": 784, "seed": 785, "provided": 786, "start": 787, "sample": 788, "num_prompts": 789, "some": 790, "stats": 791, "sampled": 792, "prompt_lens": 793, "average": 794, "input": 795, "sum": 796, "p50": 797, "sorted": 798, "min": 799, "engine_args": 800, "from_cli_args": 801, "asdict": 802, "temperature": 803, "max_tokens": 804, "detokenize": 805, "disable_detokenize": 806, "filtered": 807, "generating": 808, "test_": 809, "_prefix": 810, "create_argument_parser": 811, "parser": 812, "description": 813, "benchmark": 814, "performance": 815, "without": 816, "automatic": 817, "caching": 818, "add_argument": 819, "help": 820, "num": 821, "repeat": 822, "times": 823, "action": 824, "store_true": 825, "lengths": 826, "sampling": 827, "specified": 828, "128": 829, "256": 830, "specifies": 831, "added": 832, "subtract": 833, "filtering": 834, "disable": 835, "do": 836, "responses": 837, "include": 838, "detokenization": 839, "latency": 840, "measurement": 841, "add_cli_args": 842, "io": 843, "dataclass": 844, "field": 845, "union": 846, "aiohttp": 847, "huggingface_hub": 848, "constants": 849, "tqdm": 850, "asyncio": 851, "autotokenizer": 852, "pretrainedtokenizer": 853, "pretrainedtokenizerfast": 854, "aiohttp_timeout": 855, "clienttimeout": 856, "total": 857, "60": 858, "requestfuncinput": 859, "api_url": 860, "model_name": 861, "logprobs": 862, "extra_body": 863, "multi_modal_content": 864, "ignore_eos": 865, "language": 866, "requestfuncoutput": 867, "generated_text": 868, "success": 869, "float": 870, "output_tokens": 871, "ttft": 872, "token": 873, "itl": 874, "default_factory": 875, "inter": 876, "latencies": 877, "tpot": 878, "avg": 879, "next": 880, "get_model": 881, "pretrained_model_name_or_path": 882, "vllm_use_modelscope": 883, "modelscope": 884, "snapshot_download": 885, "model_loader": 886, "weight_utils": 887, "get_lock": 888, "lock": 889, "prevent": 890, "multiple": 891, "processes": 892, "weights": 893, "model_path": 894, "model_id": 895, "local_files_only": 896, "hf_hub_offline": 897, "ignore_file_pattern": 898, "pt": 899, "safetensors": 900, "tokenizer_mode": 901, "auto": 902, "kwargs": 903, "slow": 904, "use_fast": 905, "fast": 906, "mode": 907, "mistral": 908, "transformers_utils": 909, "mistraltokenizer": 910, "importerror": 911, "requires": 912, "pip": 913, "from_pretrained": 914, "async_request_funcs": 915, "tgi": 916, "async_request_tgi": 917, "async_request_openai_completions": 918, "lmdeploy": 919, "deepspeed": 920, "mii": 921, "async_request_deepspeed_mii": 922, "openai": 923, "chat": 924, "async_request_openai_chat_completions": 925, "audio": 926, "async_request_openai_audio": 927, "tensorrt": 928, "async_request_trt_llm": 929, "scalellm": 930, "sglang": 931, "llama": 932, "openai_compatible_backends": 933, "base64": 934, "abc": 935, "abstractmethod": 936, "collections": 937, "mapping": 938, "functools": 939, "cache": 940, "bytesio": 941, "numpy": 942, "np": 943, "pandas": 944, "pd": 945, "datasets": 946, "load_dataset": 947, "pil": 948, "image": 949, "lora": 950, "lorarequest": 951, "get_adapter_absolute_path": 952, "multimodal": 953, "multimodaldatadict": 954, "convert_image_mode": 955, "anytokenizer": 956, "get_lora_tokenizer": 957, "samplerequest": 958, "represents": 959, "inference": 960, "benchmarking": 961, "expected_output_len": 962, "multi_modal_data": 963, "lora_request": 964, "benchmarkdataset": 965, "default_seed": 966, "is_multimodal": 967, "random_seed": 968, "initialize": 969, "indicates": 970, "reproducible": 971, "shuffling": 972, "defaults": 973, "ensuring": 974, "replaced": 975, "apply_multimodal_chat_transformation": 976, "mm_content": 977, "transform": 978, "method": 979, "expect": 980, "specific": 981, "role": 982, "user": 983, "load_data": 984, "must": 985, "overridden": 986, "subclasses": 987, "since": 988, "vary": 989, "depending": 990, "raises": 991, "notimplementederror": 992, "subclass": 993, "implement": 994, "todo": 995, "jenniferzhao": 996, "add": 997, "support": 998, "implemented": 999, "get_random_lora_request": 1000, "max_loras": 1001, "option": 1002, "nal": 1003, "lora_path": 1004, "associated": 1005, "parameters": 1006, "randomly": 1007, "selects": 1008, "based": 1009, "retrieves": 1010, "cached": 1011, "otherwise": 1012, "selected": 1013, "maximum": 1014, "loras": 1015, "disk": 1016, "where": 1017, "element": 1018, "applicable": 1019, "second": 1020, "id": 1021, "lora_id": 1022, "lora_name": 1023, "lora_int_id": 1024, "lora_path_on_disk": 1025, "lora_tokenizer_cache": 1026, "abstract": 1027, "subc": 1028, "classes": 1029, "logic": 1030, "objects": 1031, "processing": 1032, "generated": 1033, "maybe_oversample_requests": 1034, "oversamples": 1035, "size": 1036, "desired": 1037, "additional": 1038, "extend": 1039, "oversampled": 1040, "reach": 1041, "samples": 1042, "is_valid_sequence": 1043, "max_prompt_len": 1044, "1024": 1045, "max_total_len": 1046, "2048": 1047, "skip_min_output_len_check": 1048, "validate": 1049, "sequence": 1050, "pruning": 1051, "criteria": 1052, "copied": 1053, "original": 1054, "sample_hf_requests": 1055, "sample_sharegpt_requests": 1056, "functions": 1057, "benchmark_serving": 1058, "well": 1059, "sample_requests": 1060, "benchmark_throughput": 1061, "invalid": 1062, "conditions": 1063, "prompt_too_short": 1064, "output_too_short": 1065, "prompt_too_long": 1066, "combined_too_long": 1067, "met": 1068, "process_image": 1069, "process": 1070, "multimedia": 1071, "dictionary": 1072, "supports": 1073, "three": 1074, "types": 1075, "raw": 1076, "bytes": 1077, "expects": 1078, "containing": 1079, "converts": 1080, "rgb": 1081, "saves": 1082, "jpeg": 1083, "memory": 1084, "encodes": 1085, "treats": 1086, "prepends": 1087, "doesn": 1088, "http": 1089, "isinstance": 1090, "image_data": 1091, "save": 1092, "image_base64": 1093, "b64encode": 1094, "getvalue": 1095, "image_url": 1096, "randomdataset": 1097, "values": 1098, "default_prefix_len": 1099, "default_range_ratio": 1100, "default_input_len": 1101, "default_output_len": 1102, "range_ratio": 1103, "input_len": 1104, "enforce": 1105, "random_range_ratio": 1106, "valid": 1107, "vocab_size": 1108, "num_special_tokens": 1109, "num_special_tokens_to_add": 1110, "real_input_len": 1111, "tolist": 1112, "new": 1113, "input_low": 1114, "input_high": 1115, "output_low": 1116, "bound": 1117, "least": 1118, "cause": 1119, "failures": 1120, "output_high": 1121, "debugging": 1122, "input_lens": 1123, "output_lens": 1124, "offsets": 1125, "inner_seq": 1126, "arange": 1127, "token_sequence": 1128, "after": 1129, "decoding": 1130, "encode": 1131, "again": 1132, "because": 1133, "cases": 1134, "consecutive": 1135, "give": 1136, "tokenized": 1137, "example": 1138, "gpt2tokenizer": 1139, "6880": 1140, "6881": 1141, "ġcalls": 1142, "1650": 1143, "939": 1144, "486": 1145, "ġcall": 1146, "sh": 1147, "ere": 1148, "uncontrolled": 1149, "change": 1150, "encoded": 1151, "truncated": 1152, "before": 1153, "being": 1154, "total_input_len": 1155, "re_encoded_sequence": 1156, "add_special_tokens": 1157, "sharegptdataset": 1158, "implements": 1159, "sharegpt": 1160, "generates": 1161, "loading": 1162, "encoding": 1163, "entries": 1164, "entry": 1165, "enable_multimodal_chat": 1166, "prompt_ids": 1167, "completion_ids": 1168, "new_output_len": 1169, "also": 1170, "sharegpt4video": 1171, "image_path": 1172, "customdataset": 1173, "custom": 1174, "jsonl": 1175, "what": 1176, "capital": 1177, "india": 1178, "iran": 1179, "china": 1180, "dictionaries": 1181, "standardized": 1182, "has": 1183, "convert": 1184, "filetype": 1185, "assume": 1186, "endswith": 1187, "jsonl_data": 1188, "read_json": 1189, "path_or_buf": 1190, "column": 1191, "columns": 1192, "row": 1193, "dataframe": 1194, "corresponds": 1195, "want": 1196, "iterrows": 1197, "to_dict": 1198, "skip_chat_template": 1199, "sampled_requests": 1200, "item": 1201, "apply": 1202, "template": 1203, "apply_chat_template": 1204, "add_generation_prompt": 1205, "sonnetdataset": 1206, "simplified": 1207, "implementation": 1208, "sonnet": 1209, "poem": 1210, "550": 1211, "150": 1212, "return_prompt_formatted": 1213, "calculate": 1214, "tokenized_lines": 1215, "avg_len": 1216, "base_prompt": 1217, "pick": 1218, "many": 1219, "base_msg": 1220, "base_fmt": 1221, "base_offset": 1222, "higher": 1223, "num_input_lines": 1224, "round": 1225, "num_prefix_lines": 1226, "prefix_lines": 1227, "while": 1228, "extra_lines": 1229, "msg": 1230, "prompt_formatted": 1231, "burstgptdataset": 1232, "burstgpt": 1233, "csv": 1234, "synthetic": 1235, "generation": 1236, "rows": 1237, "gpt": 1238, "positive": 1239, "response": 1240, "df": 1241, "read_csv": 1242, "gpt4_df": 1243, "_sample_loaded_data": 1244, "random_state": 1245, "lists": 1246, "lora_req": 1247, "ids": 1248, "computed": 1249, "modulo": 1250, "token_ids": 1251, "huggingfacedataset": 1252, "hosted": 1253, "huggingface": 1254, "supported_dataset_paths": 1255, "dataset_split": 1256, "no_stream": 1257, "dataset_subset": 1258, "load_stream": 1259, "streaming": 1260, "conversationdataset": 1261, "lmms": 1262, "lab": 1263, "onevision": 1264, "aeala": 1265, "sharegpt_vicuna_unfiltered": 1266, "examples": 1267, "filtered_data": 1268, "dynamic_output": 1269, "conv": 1270, "completion_len": 1271, "enabled": 1272, "longer": 1273, "accurate": 1274, "actual": 1275, "visionarenadataset": 1276, "vision": 1277, "arena": 1278, "lmarena": 1279, "ai": 1280, "visionarena": 1281, "bench": 1282, "v0": 1283, "parser_fn": 1284, "images": 1285, "instructcoderdataset": 1286, "instructcoder": 1287, "co": 1288, "likaixin": 1289, "designed": 1290, "general": 1291, "code": 1292, "editing": 1293, "consists": 1294, "114": 1295, "239": 1296, "instruction": 1297, "triplets": 1298, "covers": 1299, "distinct": 1300, "scenario": 1301, "just": 1302, "explanation": 1303, "mtbenchdataset": 1304, "mt": 1305, "philschmid": 1306, "turn": 1307, "similar": 1308, "9d98ab5ec": 1309, "offline_inference": 1310, "eagle": 1311, "l14": 1312, "l18": 1313, "noqa": 1314, "e501": 1315, "sd": 1316, "aimodataset": 1317, "aimo": 1318, "reasoning": 1319, "questions": 1320, "mo": 1321, "validation": 1322, "aime": 1323, "numinamath": 1324, "cot": 1325, "problem": 1326, "solution": 1327, "32000": 1328, "zeta_prompt": 1329, "task": 1330, "analyze": 1331, "edits": 1332, "rewrite": 1333, "excerpt": 1334, "provides": 1335, "suggesting": 1336, "appropriate": 1337, "within": 1338, "taking": 1339, "account": 1340, "cursor": 1341, "_format_zeta_prompt": 1342, "original_start_marker": 1343, "editable_region_start": 1344, "zeta": 1345, "edit": 1346, "prediction": 1347, "nep": 1348, "formats": 1349, "expected": 1350, "outputs": 1351, "further": 1352, "extended": 1353, "events": 1354, "inputs": 1355, "marker": 1356, "indicating": 1357, "region": 1358, "formatted": 1359, "following": 1360, "focused": 1361, "output_start_index": 1362, "output_focused_region": 1363, "expected_output": 1364, "nexteditpredictiondataset": 1365, "zed": 1366, "industries": 1367, "mapping_prompt_funcs": 1368, "formatting_prompt_func": 1369, "asrdataset": 1370, "asr": 1371, "transcription": 1372, "tested": 1373, "domain": 1374, "speaking": 1375, "style": 1376, "hf": 1377, "subset": 1378, "ted": 1379, "lium": 1380, "talks": 1381, "oratory": 1382, "release1": 1383, "release2": 1384, "release3": 1385, "speaker": 1386, "adaptation": 1387, "voxpopuli": 1388, "european": 1389, "parliament": 1390, "en": 1391, "de": 1392, "fr": 1393, "librispeech": 1394, "audiobook": 1395, "narrated": 1396, "tedlium": 1397, "gigaspeech": 1398, "podcast": 1399, "youtube": 1400, "spontaneous": 1401, "xs": 1402, "xl": 1403, "test": 1404, "spgispeech": 1405, "financial": 1406, "meetings": 1407, "ami": 1408, "ihm": 1409, "sdm": 1410, "openslr": 1411, "librispeech_asr": 1412, "facebook": 1413, "edinburghcstr": 1414, "speechcolab": 1415, "kensho": 1416, "whisper": 1417, "interface": 1418, "transcription_preamble": 1419, "startoftranscript": 1420, "transcribe": 1421, "notimestamps": 1422, "skip_long_audios": 1423, "librosa": 1424, "skipped": 1425, "sr": 1426, "array": 1427, "sampling_rate": 1428, "duration_s": 1429, "get_duration": 1430, "duration": 1431, "discarded": 1432, "due": 1433, "greater": 1434, "argparse": 1435, "get_random_flag": 1436, "filtered_dataset": 1437, "prune": 1438, "priority": 1439, "run_vllm": 1440, "llm_engine": 1441, "model_config": 1442, "max_model_len": 1443, "_priority": 1444, "top_p": 1445, "perf_counter": 1446, "use_tqdm": 1447, "end": 1448, "namespace": 1449, "synthesize": 1450, "given": 1451, "hi": 1452, "backend": 1453, "elapsed_time": 1454, "total_num_tokens": 1455, "throughput": 1456, "2f": 1457, "results": 1458, "output_json": 1459, "requests_per_second": 1460, "tokens_per_second": 1461, "dump": 1462, "indent": 1463, "overrides": 1464, "per": 1465, "gc": 1466, "warnings": 1467, "iterable": 1468, "datetime": 1469, "literal": 1470, "typing_extensions": 1471, "deprecated": 1472, "backend_request_func": 1473, "benchmark_dataset": 1474, "benchmark_utils": 1475, "convert_to_pytorch_benchmark_format": 1476, "write_to_json": 1477, "benchmarks": 1478, "serve": 1479, "get_request": 1480, "milliseconds_to_seconds_conversion": 1481, "1000": 1482, "benchmarkmetrics": 1483, "completed": 1484, "total_input": 1485, "total_output": 1486, "request_throughput": 1487, "request_goodput": 1488, "output_throughput": 1489, "total_token_throughput": 1490, "mean_ttft_ms": 1491, "median_ttft_ms": 1492, "std_ttft_ms": 1493, "percentiles_ttft_ms": 1494, "mean_tpot_ms": 1495, "median_tpot_ms": 1496, "std_tpot_ms": 1497, "percentiles_tpot_ms": 1498, "mean_itl_ms": 1499, "median_itl_ms": 1500, "std_itl_ms": 1501, "percentiles_itl_ms": 1502, "e2el": 1503, "stands": 1504, "taken": 1505, "client": 1506, "side": 1507, "sending": 1508, "receiving": 1509, "complete": 1510, "mean_e2el_ms": 1511, "median_e2el_ms": 1512, "std_e2el_ms": 1513, "percentiles_e2el_ms": 1514, "calculate_metrics": 1515, "input_requests": 1516, "dur_s": 1517, "selected_percentile_metrics": 1518, "selected_percentiles": 1519, "goodput_config_dict": 1520, "actual_output_lens": 1521, "good_completed": 1522, "itls": 1523, "tpots": 1524, "all_tpots": 1525, "ttfts": 1526, "e2els": 1527, "serving": 1528, "backends": 1529, "instead": 1530, "looking": 1531, "bundled": 1532, "together": 1533, "inflate": 1534, "slightly": 1535, "latency_minus_ttft": 1536, "regard": 1537, "goodput": 1538, "valid_metrics": 1539, "slo_values": 1540, "req_metric": 1541, "zip": 1542, "is_good_req": 1543, "warn": 1544, "likely": 1545, "misconfiguration": 1546, "arguments": 1547, "stacklevel": 1548, "metrics": 1549, "mean": 1550, "std": 1551, "median": 1552, "percentile": 1553, "check_goodput_args": 1554, "valid_names": 1555, "parse_goodput": 1556, "slo_name": 1557, "slo_val": 1558, "metric": 1559, "found": 1560, "service": 1561, "objective": 1562, "one": 1563, "non": 1564, "negative": 1565, "slo_pairs": 1566, "slo_pair": 1567, "argumenttypeerror": 1568, "objectives": 1569, "specify": 1570, "pairs": 1571, "milliseconds": 1572, "save_to_pytorch_benchmark_format": 1573, "file_name": 1574, "p99_ttft_ms": 1575, "p99_tpot_ms": 1576, "p99_itl_ms": 1577, "useful": 1578, "rather": 1579, "big": 1580, "later": 1581, "needed": 1582, "ignored_metrics": 1583, "generated_texts": 1584, "pt_records": 1585, "extra_info": 1586, "don": 1587, "suffix": 1588, "up": 1589, "pt_file": 1590, "splitext": 1591, "pytorch": 1592, "served_model_name": 1593, "tokenizer_id": 1594, "ramp": 1595, "ramp_up_strategy": 1596, "request_rate": 1597, "inf": 1598, "rate": 1599, "controlled": 1600, "argument": 1601, "ramp_up_start_rps": 1602, "ramp_up_end_rps": 1603, "strategy": 1604, "both": 1605, "rps": 1606, "exponential": 1607, "base_url": 1608, "endpoint": 1609, "host": 1610, "port": 1611, "dataset_name": 1612, "corresponding": 1613, "custom_output_len": 1614, "custom_skip_chat_template": 1615, "formatting": 1616, "depends": 1617, "sonnet_input_len": 1618, "sonnet_output_len": 1619, "sonnet_prefix_len": 1620, "chat_template": 1621, "default_chat_template": 1622, "dataset_class": 1623, "hf_split": 1624, "train": 1625, "hf_subset": 1626, "dataset_": 1627, "_class": 1628, "supported_datasets": 1629, "cls": 1630, "__subclasses__": 1631, "consider": 1632, "contributing": 1633, "would": 1634, "like": 1635, "multi": 1636, "modal": 1637, "tokeni": 1638, "izer": 1639, "hf_output_len": 1640, "follow": 1641, "structure": 1642, "dataset_mapping": 1643, "sharegpt_output_len": 1644, "random_prefix_len": 1645, "random_input_len": 1646, "random_output_len": 1647, "keyerror": 1648, "collect": 1649, "top_k": 1650, "min_p": 1651, "greedy": 1652, "arg": 1653, "gs": 1654, "cache_prompt": 1655, "static": 1656, "pause": 1657, "freeze": 1658, "benchmark_result": 1659, "burstiness": 1660, "disable_tqdm": 1661, "profile": 1662, "percentile_metrics": 1663, "metric_percentiles": 1664, "max_concurrency": 1665, "lora_modules": 1666, "config": 1667, "save_result": 1668, "append_result": 1669, "result_json": 1670, "current_dt": 1671, "now": 1672, "strftime": 1673, "date": 1674, "metadata": 1675, "kvstring": 1676, "val": 1677, "lueerror": 1678, "traffic": 1679, "result": 1680, "save_detailed": 1681, "fields": 1682, "points": 1683, "del": 1684, "base_model_id": 1685, "max_concurrency_str": 1686, "concurrency": 1687, "qps": 1688, "result_filename": 1689, "result_dir": 1690, "outfile": 1691, "newline": 1692, "tell": 1693, "online": 1694, "keys": 1695, "server": 1696, "127": 1697, "localhost": 1698, "ipv4": 1699, "8000": 1700, "v1": 1701, "stream": 1702, "concurrent": 1703, "simulate": 1704, "enforcing": 1705, "controls": 1706, "initiated": 1707, "control": 1708, "allowed": 1709, "execute": 1710, "means": 1711, "combination": 1712, "enough": 1713, "beam": 1714, "compute": 1715, "part": 1716, "unspecified": 1717, "disabled": 1718, "dummy": 1719, "logprob": 1720, "returned": 1721, "sent": 1722, "poisson": 1723, "gamma": 1724, "distribution": 1725, "arrival": 1726, "factor": 1727, "take": 1728, "effect": 1729, "follows": 1730, "intervals": 1731, "bursty": 1732, "uniform": 1733, "trust": 1734, "progress": 1735, "bar": 1736, "profiler": 1737, "launched": 1738, "vllm_torch_profiler_dir": 1739, "detailed": 1740, "saving": 1741, "whether": 1742, "information": 1743, "ttfs": 1744, "etc": 1745, "metavar": 1746, "nargs": 1747, "tp": 1748, "saved": 1749, "record": 1750, "keeping": 1751, "purposes": 1752, "dir": 1753, "ignore": 1754, "eos": 1755, "flag": 1756, "deepspeed_mii": 1757, "comma": 1758, "separated": 1759, "report": 1760, "percentils": 1761, "percentiles": 1762, "names": 1763, "99": 1764, "25": 1765, "th": 1766, "50": 1767, "75": 1768, "spaces": 1769, "definition": 1770, "refer": 1771, "distserve": 1772, "paper": 1773, "arxiv": 1774, "org": 1775, "pdf": 1776, "2401": 1777, "09670": 1778, "blog": 1779, "hao": 1780, "blogs": 1781, "custom_group": 1782, "add_argument_group": 1783, "options": 1784, "applying": 1785, "sonnet_group": 1786, "sharegpt_group": 1787, "random_group": 1788, "ratio": 1789, "define": 1790, "symmetric": 1791, "fixed": 1792, "ed": 1793, "hf_group": 1794, "sampling_group": 1795, "top": 1796, "parameter": 1797, "always": 1798, "mistral_common": 1799, "preregistered": 1800, "served": 1801, "passed": 1802, "launching": 1803, "script": 1804, "chooses": 1805, "linear": 1806, "initial": 1807, "final": 1808, "over": 1809, "starting": 1810, "needs": 1811, "ending": 1812, "math": 1813, "tracebacktype": 1814, "oss": 1815, "wiki": 1816, "integrate": 1817, "database": 1818, "records": 1819, "benchmark_values": 1820, "vars": 1821, "tensor_parallel_size": 1822, "infencoder": 1823, "jsonencoder": 1824, "clear_inf": 1825, "isinf": 1826, "iterencode": 1827, "serializable": 1828, "timecollector": 1829, "ns": 1830, "us": 1831, "ms": 1832, "scale": 1833, "cnt": 1834, "_sum": 1835, "_max": 1836, "monotonic_ns": 1837, "dump_avg_max": 1838, "__enter__": 1839, "__exit__": 1840, "exc_type": 1841, "baseexception": 1842, "exc_value": 1843, "exc_traceback": 1844, "prompttype": 1845, "beamsearchparams": 1846, "avg_latency": 1847, "woosuk": 1848, "processed": 1849, "batch": 1850, "automatically": 1851, "batches": 1852, "dummy_prompt_token_ids": 1853, "10000": 1854, "batch_size": 1855, "dummy_prompts": 1856, "llm_generate": 1857, "use_beam_search": 1858, "beam_search": 1859, "beam_width": 1860, "run_to_completion": 1861, "profile_dir": 1862, "start_profile": 1863, "stop_profile": 1864, "warming": 1865, "num_iters_warmup": 1866, "desc": 1867, "warmup": 1868, "iterations": 1869, "vllm_torc": 1870, "ch_profiler_dir": 1871, "profiling": 1872, "num_iters": 1873, "percentages": 1874, "90": 1875, "seconds": 1876, "percentage": 1877, "till": 1878, "32": 1879, "iters": 1880, "enables": 1881, "skews": 1882, "numbers": 1883, "set_defaults": 1884, "enable_prefix_caching": 1885, "uuid": 1886, "asyncgenerator": 1887, "structured_output": 1888, "backend_xgrammar": 1889, "has_xgrammar_unsupported_json_features": 1890, "representing": 1891, "attributes": 1892, "schema": 1893, "structure_type": 1894, "unique": 1895, "json_schema_path": 1896, "dir_path": 1897, "realpath": 1898, "structured_schemas": 1899, "structured_schema_1": 1900, "json_schemas": 1901, "deepcopy": 1902, "properties": 1903, "__optional_field_": 1904, "uuid4": 1905, "schemas": 1906, "gen_prompt": 1907, "brief": 1908, "dumps": 1909, "get_schema": 1910, "grammar": 1911, "select_statement": 1912, "condition": 1913, "col_1": 1914, "col_2": 1915, "table_1": 1916, "table_2": 1917, "sql": 1918, "query": 1919, "username": 1920, "email": 1921, "users": 1922, "regex": 1923, "address": 1924, "alan": 1925, "turing": 1926, "who": 1927, "works": 1928, "enigma": 1929, "choice": 1930, "classify": 1931, "sentiment": 1932, "wonderful": 1933, "aset": 1934, "xgrammar_bench": 1935, "nousresearch": 1936, "eval": 1937, "full_dataset_len": 1938, "_filter_func": 1939, "num_filtered_out": 1940, "features": 1941, "len_dataset": 1942, "data_point_idx": 1943, "idx": 1944, "mill": 1945, "liseconds_to_seconds_conversion": 1946, "pe": 1947, "ercentiles_itl_ms": 1948, "evaluate": 1949, "ret": 1950, "_eval_correctness_json": 1951, "_eval_correctness_choice": 1952, "_eval_correctness_regex": 1953, "_eval_correctness": 1954, "guided_json": 1955, "guided_regex": 1956, "guided_choice": 1957, "scores": 1958, "res": 1959, "score": 1960, "correctness": 1961, "not_none_scores": 1962, "100": 1963, "guided_grammar": 1964, "no_structured_output": 1965, "structured_output_ratio": 1966, "save_results": 1967, "result_file_name": 1968, "guided": 1969, "_out": 1970, "correct_rate": 1971, "structured": 1972, "tabulate": 1973, "modelconfig": 1974, "speculativeconfig": 1975, "vllmconfig": 1976, "spec_decode": 1977, "ngram_proposer": 1978, "ngramproposer": 1979, "max_ngram": 1980, "collector": 1981, "opt": 1982, "125m": 1983, "num_token": 1984, "num_spec_token": 1985, "dtype": 1986, "proposer": 1987, "vllm_config": 1988, "speculative_config": 1989, "prompt_lookup_min": 1990, "min_ngram": 1991, "prompt_lookup_max": 1992, "num_speculative_tokens": 1993, "ngram": 1994, "warm": 1995, "propose": 1996, "num_iteration": 1997, "num_req": 1998, "headers": 1999, "tablefmt": 2000, "grid": 2001, "floatfmt": 2002, "3f": 2003, "invoke_main": 2004, "gram": 2005, "speculative": 2006, "drafting": 2007, "iteration": 2008, "stablize": 2009, "readings": 2010, "1500": 2011, "minimum": 2012, "parse_args": 2013, "test_long_document_qa": 2014, "document": 2015, "qa": 2016, "spent": 2017, "strings": 2018, "4f": 2019, "secs": 2020, "repeat_prompts": 2021, "order": 2022, "repeated": 2023, "repetition": 2024, "modes": 2025, "tile": 2026, "entire": 2027, "interleave": 2028, "consecutively": 2029, "moving": 2030, "repeated_prompts": 2031, "shuffle_seed": 2032, "prepare": 2033, "beginning": 2034, "documents": 2035, "document_length": 2036, "num_documents": 2037, "repeat_mode": 2038, "warmup_prompts": 2039, "roughly": 2040, "excluding": 2041, "20000": 2042, "details": 2043, "block_pool": 2044, "blockpool": 2045, "allocate_block": 2046, "allocate_blocks": 2047, "ahead": 2048, "minimize": 2049, "impact": 2050, "among": 2051, "runs": 2052, "num_gpu_blocks": 2053, "enable_caching": 2054, "get_blocks_times": 2055, "free_blocks_times": 2056, "blocks": 2057, "get_new_blocks": 2058, "free_blocks": 2059, "nblocks": 2060, "allocated": 2061, "navg": 2062, "nmax": 2063, "free": 2064, "kv": 2065, "gpu": 2066, "100000": 2067, "allocate": 2068, "500": 2069, "uvloop": 2070, "automodelforcausallm": 2071, "asyncengineargs": 2072, "entrypoints": 2073, "api_server": 2074, "build_async_engine_client_from_engine_args": 2075, "textprompt": 2076, "tokensprompt": 2077, "requestoutput": 2078, "merge_async_iterators": 2079, "lora_requests": 2080, "enable_lora": 2081, "beamsearch": 2082, "ts": 2083, "run_vllm_chat": 2084, "recommended": 2085, "properly": 2086, "handles": 2087, "run_hf": 2088, "max_batch_size": 2089, "torch_dtype": 2090, "float16": 2091, "model_type": 2092, "padding": 2093, "pad_token": 2094, "eos_token": 2095, "pbar": 2096, "max_output_len": 2097, "next_prompt_len": 2098, "next_output_len": 2099, "return_tensors": 2100, "llm_outputs": 2101, "do_sample": 2102, "num_return_sequences": 2103, "use_cache": 2104, "max_new_tokens": 2105, "batch_decode": 2106, "sk": 2107, "kip_special_tokens": 2108, "clear": 2109, "run_mii": 2110, "tensor_parallel": 2111, "terminate_server": 2112, "get_requests": 2113, "common_kwargs": 2114, "sample_kwargs": 2115, "dataset_cls": 2116, "hf_sub": 2117, "bset": 2118, "is_multi_modal": 2119, "request_outputs": 2120, "async_engine": 2121, "run_vllm_async": 2122, "disable_frontend_multiprocessing": 2123, "hf_max_batch_size": 2124, "total_prompt_tokens": 2125, "total_output_tokens": 2126, "ro": 2127, "033": 2128, "91mwarning": 2129, "0m": 2130, "detected": 2131, "counted": 2132, "issues": 2133, "9778": 2134, "counts": 2135, "validate_args": 2136, "deprecation": 2137, "defaulting": 2138, "getattr": 2139, "valid_backends": 2140, "checks": 2141, "ignored": 2142, "vll": 2143, "lm": 2144, "settings": 2145, "validations": 2146, "parallel": 2147, "currently": 2148, "16222": 2149, "data_parallel_size": 2150, "offline": 2151, "form": 2152, "prompt_or_response": 2153, "sync": 2154, "async": 2155, "frontend": 2156, "multiprocessing": 2157, "decoupled": 2158, "adapters": 2159, "relative": 2160, "hugging": 2161, "face": 2162, "much": 2163, "versus": 2164, "remains": 2165, "approximately": 2166, "dtaset": 2167, "mp": 2168, "counter": 2169, "deque": 2170, "enum": 2171, "httpstatus": 2172, "statistics": 2173, "namedtuple": 2174, "bench_dataset": 2175, "conversationsmap": 2176, "convid": 2177, "genconvargs": 2178, "messageslist": 2179, "sharegptconversations": 2180, "conversations_dict_to_list": 2181, "conversations_list_to_dict": 2182, "generate_conversations": 2183, "parse_input_json_file": 2184, "bench_utils": 2185, "text_separator": 2186, "color": 2187, "num_tokens_from_dataset": 2188, "term_signal": 2189, "conversationsampling": 2190, "round_robin": 2191, "__str__": 2192, "clientargs": 2193, "max_num_requests": 2194, "skip_first_turn": 2195, "max_turns": 2196, "max_active_conversations": 2197, "print_content": 2198, "verify_output": 2199, "conversation_sampling": 2200, "requestargs": 2201, "chat_url": 2202, "limit_min_tokens": 2203, "limit": 2204, "limit_max_tokens": 2205, "benchmarkargs": 2206, "num_clients": 2207, "early_stop": 2208, "serverresponse": 2209, "ttft_ms": 2210, "chunk": 2211, "tpot_ms": 2212, "latency_ms": 2213, "start_time_ms": 2214, "first_chunk": 2215, "includes": 2216, "num_chunks": 2217, "requeststats": 2218, "input_num_turns": 2219, "input_num_tokens": 2220, "output_num_tokens": 2221, "output_num_chunks": 2222, "output_num_first_chunk_tokens": 2223, "approx_cached_percent": 2224, "conversation_id": 2225, "client_id": 2226, "chunks": 2227, "metricstats": 2228, "__repr__": 2229, "movingaverage": 2230, "window_size": 2231, "window": 2232, "zeros": 2233, "new_value": 2234, "filling": 2235, "full": 2236, "replacing": 2237, "old": 2238, "old_value": 2239, "debugstats": 2240, "moving_avg_ttft_ms": 2241, "moving_avg_tpot_ms": 2242, "kv_info": 2243, "remove_prefix": 2244, "nanosec_to_millisec": 2245, "1000000": 2246, "nanosec_to_sec": 2247, "1000000000": 2248, "get_short_string": 2249, "400": 2250, "get_token_count": 2251, "get_messages_token_count": 2252, "messages": 2253, "token_count": 2254, "worker_function": 2255, "client_args": 2256, "req_args": 2257, "stop_event": 2258, "event": 2259, "task_queue": 2260, "queue": 2261, "result_queue": 2262, "conv_queue": 2263, "client_main": 2264, "get_client_config": 2265, "input_conv": 2266, "clients": 2267, "equal": 2268, "larger": 2269, "max_req_per_client": 2270, "req_per_client": 2271, "active": 2272, "max_active_conv_per_client": 2273, "warmup_step": 2274, "verif": 2275, "fy_output": 2276, "limits": 2277, "get_filename_with_timestamp": 2278, "label": 2279, "time_now": 2280, "timestamp": 2281, "y_": 2282, "__": 2283, "process_statistics": 2284, "client_metrics": 2285, "warmup_percentages": 2286, "test_params": 2287, "gen_conv_args": 2288, "excel_output": 2289, "raw_data": 2290, "sort_values": 2291, "time_between_user_turns_sec": 2292, "groupby": 2293, "diff": 2294, "end_time_ms": 2295, "999": 2296, "9999": 2297, "precision": 2298, "dataframes": 2299, "set_option": 2300, "display": 2301, "exclude": 2302, "yellow": 2303, "reset": 2304, "gen_params": 2305, "text_files": 2306, "input_common_prefix_num_tokens": 2307, "input_prefix_num_tokens": 2308, "params_list": 2309, "df_list": 2310, "percent": 2311, "tail": 2312, "warmup_count": 2313, "tail_count": 2314, "reason": 2315, "zero": 2316, "last": 2317, "runtime_sec": 2318, "iloc": 2319, "requests_per_sec": 2320, "params": 2321, "summary": 2322, "relevant": 2323, "drop": 2324, "irrelevant": 2325, "describe": 2326, "transpose": 2327, "excel": 2328, "assuming": 2329, "statistics_": 2330, "_clients": 2331, "xlsx": 2332, "excelwriter": 2333, "xlsxwriter": 2334, "writer": 2335, "startrow": 2336, "test_params_df": 2337, "to_excel": 2338, "sheet_name": 2339, "gen_params_df": 2340, "df_stats": 2341, "df_params": 2342, "green": 2343, "exported": 2344, "ndarray": 2345, "uniformdistribution": 2346, "min_val": 2347, "max_val": 2348, "is_integer": 2349, "constantdistribution": 2350, "shape": 2351, "fill_value": 2352, "constant": 2353, "zipfdistribution": 2354, "alpha": 2355, "zipf": 2356, "poissondistribution": 2357, "lognormaldistribution": 2358, "sigma": 2359, "lognormal": 2360, "astype": 2361, "num_conversations": 2362, "print_stats": 2363, "verify_field_exists": 2364, "conf": 2365, "field_name": 2366, "section": 2367, "subsection": 2368, "get_random_distribution": 2369, "prompt_input": 2370, "prompt_output": 2371, "num_turns": 2372, "num_tokens": 2373, "prefix_num_tokens": 2374, "min_value": 2375, "max_value": 2376, "required_fields": 2377, "workload": 2378, "common_prefix_num_tokens": 2379, "print_conv_stats": 2380, "conv_stats": 2381, "req_stats": 2382, "ncollecting": 2383, "dicts": 2384, "user_tokens": 2385, "assistant_tokens": 2386, "request_tokens": 2387, "req_tokens": 2388, "including": 2389, "item_stats": 2390, "conversation_turns": 2391, "appended": 2392, "base_prompt_text": 2393, "base_prompt_token_count": 2394, "purple": 2395, "list_of_tokens": 2396, "tokens_in_file": 2397, "conv_id": 2398, "every": 2399, "turn_count": 2400, "even": 2401, "conv_prefix_tokens": 2402, "shared": 2403, "jump": 2404, "sections": 2405, "common_prefix_text": 2406, "common_prefix_tokens": 2407, "separate": 2408, "sentences": 2409, "nturns": 2410, "input_token_count": 2411, "output_token_count": 2412, "user_turn": 2413, "turn_id": 2414, "nice": 2415, "left": 2416, "start_offset": 2417, "end_offset": 2418, "ecode": 2419, "answers": 2420, "min_tokens": 2421, "message": 2422, "conv_id_": 2423, "increase": 2424, "offset": 2425, "input_list": 2426, "once": 2427, "conv_data": 2428, "input_dict": 2429, "new_item": 2430, "has_non_english_chars": 2431, "isascii": 2432, "content_is_valid": 2433, "min_content_len": 2434, "max_content_len": 2435, "user_turns": 2436, "assistant_turns": 2437, "user_words": 2438, "assistant_words": 2439, "conv_chars": 2440, "content_num_words": 2441, "conv_words": 2442, "conv_turns": 2443, "conv_characters": 2444, "nstatistics": 2445, "convert_sharegpt_to_openai": 2446, "input_file": 2447, "output_file": 2448, "max_items": 2449, "min_turns": 2450, "verify": 2451, "were": 2452, "reading": 2453, "sharegpt_data": 2454, "conversation_parts": 2455, "hiwplmd": 2456, "session": 2457, "new_turns": 2458, "conv_": 2459, "_id": 2460, "prev_turns": 2461, "parts": 2462, "conv_parts": 2463, "conv_part": 2464, "final_openai_dataset": 2465, "enumerate": 2466, "turn_from": 2467, "human": 2468, "bing": 2469, "chatgpt": 2470, "bard": 2471, "previous": 2472, "converted": 2473, "valid_messages": 2474, "alternate": 2475, "print_stats_again": 2476, "nsampling": 2477, "changed": 2478, "final_size": 2479, "ntotal": 2480, "nwriting": 2481, "ensure_ascii": 2482, "argumentparser": 2483, "generators": 2484, "characters": 2485, "red": 2486, "91m": 2487, "92m": 2488, "blue": 2489, "94m": 2490, "95m": 2491, "cyan": 2492, "96m": 2493, "93m": 2494, "basicconfig": 2495, "asctime": 2496, "levelname": 2497, "datefmt": 2498, "cprofile": 2499, "pstats": 2500, "long_prompt": 2501, "expert": 2502, "large": 2503, "aren": 2504, "enforce_eager": 2505, "runctx": 2506, "globals": 2507, "locals": 2508, "hashing": 2509, "sort_stats": 2510, "cumulative": 2511, "total_time": 2512, "total_calls": 2513, "func": 2514, "hash_of_block": 2515, "total_tt": 2516, "took": 2517, "typeddict": 2518, "ray": 2519, "autoconfig": 2520, "moe_permute_unpermute": 2521, "_moe_permute": 2522, "_moe_unpermute_and_reduce": 2523, "moe_permute": 2524, "moe_unpermute": 2525, "_fp8_quantize": 2526, "platforms": 2527, "current_platform": 2528, "fp8_dtype": 2529, "benchmarkconfig": 2530, "block_size_m": 2531, "block_size_n": 2532, "block_size_k": 2533, "group_size_m": 2534, "num_warps": 2535, "num_stages": 2536, "benchmark_permute": 2537, "num_experts": 2538, "hidden_size": 2539, "topk": 2540, "use_fp8_w8a8": 2541, "use_int8_w8a16": 2542, "use_customized_permute": 2543, "init_dtype": 2544, "hidden_states": 2545, "randn": 2546, "output_hidden_states": 2547, "empty_like": 2548, "align_block_size": 2549, "deepgemm": 2550, "aligned": 2551, "block": 2552, "qhidden_states": 2553, "gating_output": 2554, "float32": 2555, "input_gating": 2556, "topk_weights": 2557, "topk_ids": 2558, "token_expert_indices": 2559, "fused_topk": 2560, "copy_": 2561, "permuted_hidden_states": 2562, "a1q_scale": 2563, "first_token_off": 2564, "inv_perm_idx": 2565, "m_indices": 2566, "n_expert": 2567, "expert_map": 2568, "sorted_token_ids": 2569, "expert_ids": 2570, "inv_perm": 2571, "jit": 2572, "synchronize": 2573, "capture": 2574, "invocations": 2575, "graph": 2576, "cudagraph": 2577, "replay": 2578, "start_event": 2579, "enable_timing": 2580, "end_event": 2581, "benchmark_unpermute": 2582, "fp16": 2583, "bf16": 2584, "gemm": 2585, "permuted_qhidden_states": 2586, "benchmarkworker": 2587, "set_default_device": 2588, "seed_everything": 2589, "device": 2590, "tensors": 2591, "kernels": 2592, "respective": 2593, "work": 2594, "correctly": 2595, "tuning": 2596, "device_id": 2597, "get_gpu_ids": 2598, "permute_time": 2599, "unpermute_time": 2600, "get_weight_block_size_safety": 2601, "default_value": 2602, "quantization_config": 2603, "weight_block_size": 2604, "architectures": 2605, "dbrxforcausallm": 2606, "ffn_config": 2607, "moe_num_experts": 2608, "moe_top_k": 2609, "jambaforcausallm": 2610, "num_experts_per_tok": 2611, "deepseekv3forcausallm": 2612, "deepseekv2forcausallm": 2613, "glm4moeforcausallm": 2614, "n_routed_experts": 2615, "qwen2moeforcausallm": 2616, "qwen3moeforcausallm": 2617, "llama4": 2618, "get_text_config": 2619, "mixtral": 2620, "num_local_experts": 2621, "is_rocm": 2622, "fp8_w8a8": 2623, "int8_w8a16": 2624, "batch_sizes": 2625, "24": 2626, "48": 2627, "64": 2628, "96": 2629, "512": 2630, "1536": 2631, "3072": 2632, "4096": 2633, "init": 2634, "num_gpus": 2635, "available_resources": 2636, "workers": 2637, "_distribute": 2638, "worker_idx": 2639, "fo": 2640, "input_args": 2641, "worker": 2642, "worker_method": 2643, "permute": 2644, "unpermute": 2645, "benchmark_shapes": 2646, "weight_shapes": 2647, "_custom_ops": 2648, "ops": 2649, "gptq_marlin_24": 2650, "gptq_marlin_24_max_parallel": 2651, "gptq_marlin_24_min_thread_n": 2652, "gptq_marlin_24_supported_group_sizes": 2653, "gptq_marlin_24_supported_quant_types": 2654, "allspark_utils": 2655, "allspark_ampere_m_cublas_threshold": 2656, "allspark_supported_quant_types": 2657, "marlin_utils": 2658, 