{"spdx": 0, "license": 1, "identifier": 2, "apache": 3, "filecopyrighttext": 4, "copyright": 5, "contributors": 6, "vllm": 7, "project": 8, "import": 9, "importlib": 10, "traceback": 11, "from": 12, "typing": 13, "callable": 14, "unittest": 15, "mock": 16, "patch": 17, "def": 18, "find_cuda_init": 19, "fn": 20, "object": 21, "none": 22, "helper": 23, "function": 24, "debug": 25, "cuda": 26, "re": 27, "initialization": 28, "errors": 29, "initializes": 30, "prints": 31, "stack": 32, "trace": 33, "how": 34, "happens": 35, "torch": 36, "_lazy_init": 37, "wrapper": 38, "nonlocal": 39, "extract_stack": 40, "return": 41, "print": 42, "initialized": 43, "join": 44, "format_list": 45, "strip": 46, "__name__": 47, "__main__": 48, "lambda": 49, "import_module": 50, "model_executor": 51, "models": 52, "llava": 53, "ctypes": 54, "util": 55, "json": 56, "logging": 57, "os": 58, "shutil": 59, "subprocess": 60, "sys": 61, "pathlib": 62, "path": 63, "which": 64, "packaging": 65, "version": 66, "parse": 67, "setuptools": 68, "extension": 69, "setup": 70, "command": 71, "build_ext": 72, "setuptools_scm": 73, "get_version": 74, "utils": 75, "cpp_extension": 76, "cuda_home": 77, "rocm_home": 78, "load_module_from_path": 79, "module_name": 80, "spec": 81, "spec_from_file_location": 82, "module": 83, "module_from_spec": 84, "modules": 85, "loader": 86, "exec_module": 87, "root_dir": 88, "__file__": 89, "parent": 90, "logger": 91, "getlogger": 92, "envs": 93, "py": 94, "vllm_target_device": 95, "main_cuda_version": 96, "12": 97, "is_sccache_available": 98, "bool": 99, "sccache": 100, "int": 101, "getenv": 102, "vllm_disable_sccache": 103, "is_ccache_available": 104, "ccache": 105, "is_ninja_available": 106, "ninja": 107, "is_url_available": 108, "url": 109, "str": 110, "urllib": 111, "request": 112, "urlopen": 113, "status": 114, "try": 115, "except": 116, "exception": 117, "false": 118, "200": 119, "class": 120, "cmakeextension": 121, "__init__": 122, "self": 123, "name": 124, "cmake_lists_dir": 125, "kwa": 126, "super": 127, "sources": 128, "py_limited_api": 129, "true": 130, "abspath": 131, "cmake_build_ext": 132, "dict": 133, "directories": 134, "have": 135, "been": 136, "configured": 137, "did_config": 138, "determine": 139, "number": 140, "compilation": 141, "jobs": 142, "optionally": 143, "nvcc": 144, "compile": 145, "threads": 146, "compute_num_jobs": 147, "num_jobs": 148, "either": 149, "value": 150, "max_jobs": 151, "environment": 152, "variable": 153, "defined": 154, "cpus": 155, "available": 156, "info": 157, "using": 158, "else": 159, "sched_getaffinity": 160, "isn": 161, "universally": 162, "so": 163, "fall": 164, "back": 165, "cpu_count": 166, "we": 167, "get": 168, "error": 169, "here": 170, "len": 171, "attributeerror": 172, "nvcc_threads": 173, "_is_cuda": 174, "get_nvcc_cuda_version": 175, "11": 176, "when": 177, "set": 178, "reduce": 179, "avoid": 180, "overloading": 181, "system": 182, "max": 183, "perform": 184, "cmake": 185, "configuration": 186, "single": 187, "configure": 188, "ext": 189, "ve": 190, "already": 191, "cmakelists": 192, "txt": 193, "exit": 194, "early": 195, "select": 196, "build": 197, "type": 198, "note": 199, "optimization": 200, "level": 201, "default_cfg": 202, "relwithdebinfo": 203, "cfg": 204, "cmake_build_type": 205, "cmake_args": 206, "dcmake_build_type": 207, "format": 208, "dvllm_target_device": 209, "verbose": 210, "dcmake_verbose_makefile": 211, "dcmake_c_compiler_launcher": 212, "dcmake_cxx_compiler_launcher": 213, "dcmake_cuda_compiler_launcher": 214, "dcmake_hip_compiler_launcher": 215, "elif": 216, "pass": 217, "python": 218, "executable": 219, "can": 220, "find": 221, "exact": 222, "match": 223, "dvllm_python_executable": 224, "reuse": 225, "dependencies": 226, "subsequent": 227, "calls": 228, "dvllm_python_path": 229, "override": 230, "base": 231, "directory": 232, "fetchcontent": 233, "downloads": 234, "root": 235, "deps": 236, "allows": 237, "sharing": 238, "between": 239, "profiles": 240, "plays": 241, "more": 242, "nicely": 243, "fetchcontent_base_dir": 244, "fc_base_dir": 245, "environ": 246, "dfetchcontent_base_dir": 247, "parallelism": 248, "tool": 249, "num_jo": 250, "obs": 251, "dnvcc_threads": 252, "build_tool": 253, "dcmake_job_pool_compile": 254, "string": 255, "dcmake_job_pools": 256, "default": 257, "whatever": 258, "picks": 259, "make": 260, "sure": 261, "use": 262, "dcmake_cuda_compiler": 263, "bin": 264, "check_call": 265, "cwd": 266, "build_temp": 267, "build_extensions": 268, "ensure": 269, "present": 270, "working": 271, "check_output": 272, "oserror": 273, "raise": 274, "runtimeerror": 275, "cannot": 276, "create": 277, "does": 278, "exist": 279, "exists": 280, "makedirs": 281, "targets": 282, "target_name": 283, "removeprefix": 284, "vllm_flash_attn": 285, "all": 286, "extensions": 287, "append": 288, "build_args": 289, "target": 290, "install": 291, "libraries": 292, "proper": 293, "location": 294, "outdir": 295, "get_ext_fullpath": 296, "absolute": 297, "skip": 298, "direc": 299, "ctory": 300, "same": 301, "continue": 302, "appends": 303, "prefix": 304, "contains": 305, "need": 306, "remove": 307, "range": 308, "count": 309, "should": 310, "actually": 311, "components": 312, "install_args": 313, "component": 314, "run": 315, "first": 316, "standard": 317, "copy": 318, "build_lib": 319, "current": 320, "included": 321, "editable": 322, "glob": 323, "files": 324, "recursive": 325, "file": 326, "dst_file": 327, "split": 328, "copying": 329, "dirname": 330, "exist_ok": 331, "copy_file": 332, "precompiled_build_ext": 333, "disables": 334, "building": 335, "precompiled": 336, "binaries": 337, "assert": 338, "vllm_use_precompiled": 339, "only": 340, "supported": 341, "builds": 342, "skipping": 343, "precompiled_wheel_utils": 344, "extracts": 345, "other": 346, "existing": 347, "wheel": 348, "staticmethod": 349, "extract_precompiled_and_patch_package": 350, "wheel_url_or_path": 351, "tempfile": 352, "zipfile": 353, "temp_dir": 354, "isfile": 355, "wheel_filename": 356, "mkdtemp": 357, "wheels": 358, "wheel_path": 359, "downloading": 360, "urlretrieve": 361, "filename": 362, "package_data_patch": 363, "files_to_copy": 364, "_c": 365, "abi3": 366, "_moe_c": 367, "_flashmla_c": 368, "_vllm_fa2_c": 369, "_vllm_fa3_c": 370, "cumem_allocator": 371, "compiled_regex": 372, "file_members": 373, "list": 374, "filter": 375, "filelist": 376, "extract": 377, "target_path": 378, "target_pa": 379, "ath": 380, "open": 381, "src": 382, "wb": 383, "dst": 384, "copyfileobj": 385, "pkg": 386, "replace": 387, "setdefault": 388, "basename": 389, "finally": 390, "removing": 391, "temporary": 392, "rmtree": 393, "get_base_commit_in_main_branch": 394, "force": 395, "nightly": 396, "mainly": 397, "used": 398, "ci": 399, "testing": 400, "vllm_test_use_precompiled_nightly_wheel": 401, "latest": 402, "commit": 403, "hash": 404, "upstream": 405, "main": 406, "branch": 407, "resp_json": 408, "curl": 409, "https": 410, "api": 411, "github": 412, "com": 413, "repos": 414, "commits": 415, "decode": 416, "utf": 417, "upstream_main_commit": 418, "loads": 419, "sha": 420, "docker": 421, "context": 422, "git": 423, "may": 424, "immutable": 425, "missing": 426, "vllm_docker_build_context": 427, "check": 428, "local": 429, "repo": 430, "cat": 431, "calledprocesserror": 432, "fetch": 433, "remote": 434, "repository": 435, "update": 436, "any": 437, "branches": 438, "ensures": 439, "ref": 440, "its": 441, "history": 442, "our": 443, "current_branch": 444, "show": 445, "base_commit": 446, "merge": 447, "valueerror": 448, "err": 449, "warning": 450, "failed": 451, "compatible": 452, "your": 453, "dev": 454, "_no_device": 455, "empty": 456, "has_cuda": 457, "_is_neuron": 458, "_is_tpu": 459, "_is_hip": 460, "rocm": 461, "hip": 462, "neuron": 463, "tpu": 464, "_is_cpu": 465, "cpu": 466, "_is_xpu": 467, "xpu": 468, "_build_custom_ops": 469, "get_rocm_version": 470, "librocm": 471, "core": 472, "see": 473, "blob": 474, "d11f5c20d500f729c393680a01fa902ebf92094b": 475, "rocm_version": 476, "cpp": 477, "l21": 478, "librocm_core_file": 479, "lib": 480, "is_file": 481, "librocm_core": 482, "cdll": 483, "vererrors": 484, "c_uint32": 485, "get_rocm_core_version": 486, "getrocmversion": 487, "restype": 488, "argtypes": 489, "pointer": 490, "major": 491, "minor": 492, "byref": 493, "get_neuronxcc_version": 494, "sysconfig": 495, "site_dir": 496, "get_paths": 497, "purelib": 498, "version_file": 499, "neuronxcc": 500, "executed": 501, "successfully": 502, "fp": 503, "content": 504, "read": 505, "regular": 506, "expression": 507, "search": 508, "__version__": 509, "group": 510, "could": 511, "output": 512, "adapted": 513, "nvidia": 514, "apex": 515, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 516, "nvcc_output": 517, "universal_newlines": 518, "release_idx": 519, "index": 520, "release": 521, "nvcc_cuda_version": 522, "get_gaudi_sw_version": 523, "returns": 524, "driver": 525, "enable": 526, "console": 527, "printing": 528, "hl": 529, "smi": 530, "shell": 531, "text": 532, "capture_output": 533, "env": 534, "enable_console": 535, "returncode": 536, "stdout": 537, "get_vllm_version": 538, "write_to": 539, "_version": 540, "sep": 541, "versions": 542, "might": 543, "contain": 544, "cuda_version": 545, "cuda_version_str": 546, "source": 547, "tarball": 548, "required": 549, "pypi": 550, "sdist": 551, "argv": 552, "cu": 553, "neuron_version": 554, "neuron_version_str": 555, "unknown": 556, "runtime": 557, "get_requirements": 558, "package": 559, "requirements": 560, "requirements_dir": 561, "_read_requirements": 562, "resolved_requirements": 563, "line": 564, "startswith": 565, "common": 566, "cuda_major": 567, "cuda_minor": 568, "modified_requirements": 569, "req": 570, "flash": 571, "attn": 572, "built": 573, "unsupported": 574, "platform": 575, "please": 576, "ext_modules": 577, "package_data": 578, "typed": 579, "layers": 580, "fused_moe": 581, "configs": 582, "quantization": 583, "requires_files": 584, "pyproject": 585, "toml": 586, "cleaning": 587, "lines": 588, "readlines": 589, "lower": 590, "removed": 591, "write": 592, "done": 593, "__version_tuple__": 594, "env_override": 595, "module_attrs": 596, "asyncengineargs": 597, "engine": 598, "arg_utils": 599, "engineargs": 600, "asyncllmengine": 601, "async_llm_engine": 602, "llmengine": 603, "llm_engine": 604, "llm": 605, "entrypoints": 606, "initialize_ray_cluster": 607, "executor": 608, "ray_utils": 609, "prompttype": 610, "inputs": 611, "textprompt": 612, "tokensprompt": 613, "modelregistry": 614, "samplingparams": 615, "sampling_params": 616, "poolingparams": 617, "pooling_params": 618, "classificationoutput": 619, "outputs": 620, "classificationrequestoutput": 621, "completionoutput": 622, "embeddingoutput": 623, "embeddingrequestoutput": 624, "poolingoutput": 625, "poolingrequestoutput": 626, "requestoutput": 627, "scoringoutput": 628, "scoringrequestoutput": 629, "__all__": 630, "contextlib": 631, "type_checking": 632, "optional": 633, "union": 634, "init_logger": 635, "platforms": 636, "current_platform": 637, "scalar_type": 638, "scalartype": 639, "supports_moe_ops": 640, "paged_attention_v1": 641, "out": 642, "tensor": 643, "query": 644, "key_cache": 645, "value_cache": 646, "num_kv_heads": 647, "scale": 648, "float": 649, "block_tables": 650, "seq_lens": 651, "block_size": 652, "max_seq_len": 653, "alibi_slopes": 654, "kv_cache_dtype": 655, "k_scale": 656, "v_scale": 657, "tp_rank": 658, "blocksparse_local_blocks": 659, "blocksparse_vert_stride": 660, "blocksparse_block_size": 661, "64": 662, "blocksparse_head_sliding_step": 663, "ops": 664, "paged_attention_v2": 665, "exp_sum": 666, "max_logits": 667, "tmp_out": 668, "paged_attention_rocm": 669, "query_start_loc": 670, "fp8_out_scale": 671, "_rocm_c": 672, "paged_attention": 673, "mla_decode_kvcache_cpu": 674, "kv_cache": 675, "_c_cpu": 676, "mla_decode_kvcache": 677, "merge_attn_states": 678, "prefix_output": 679, "prefix_lse": 680, "suffix_output": 681, "suffix_lse": 682, "output_lse": 683, "convert_vertical_slash_indexes": 684, "q_seqlens": 685, "batch": 686, "kv_seqlens": 687, "vertical_indexes": 688, "n_heads": 689, "nnz_v": 690, "slash_indexes": 691, "nnz_s": 692, "context_size": 693, "block_size_m": 694, "block_size_n": 695, "causal": 696, "tuple": 697, "batch_size": 698, "size": 699, "num_heads": 700, "nnz_slash": 701, "nnz_vertical": 702, "num_rows": 703, "block_count": 704, "zeros": 705, "dtype": 706, "device": 707, "block_offset": 708, "column_count": 709, "column_index": 710, "convert_vertical_slash_indexes_mergehead": 711, "different": 712, "head": 713, "indices": 714, "vertical_indices_count": 715, "slash_indices_count": 716, "rotary_embedding": 717, "positions": 718, "key": 719, "head_size": 720, "cos_sin_cache": 721, "is_neox": 722, "batched_rotary_embedding": 723, "rot_dim": 724, "cos_sin_cache_offsets": 725, "rms_norm": 726, "input": 727, "weight": 728, "epsilon": 729, "todo": 730, "contiguous": 731, "call": 732, "kernel": 733, "updated": 734, "support": 735, "non": 736, "input_contiguous": 737, "fused_add_rms_norm": 738, "residual": 739, "apply_repetition_penalties_torch": 740, "logits": 741, "prompt_mask": 742, "output_mask": 743, "repetition_penalties": 744, "unsqueeze": 745, "dim": 746, "repeat": 747, "token": 748, "appears": 749, "prompt": 750, "apply": 751, "otherwise": 752, "op": 753, "penalties": 754, "where": 755, "positive": 756, "divide": 757, "penalty": 758, "multiply": 759, "scaling": 760, "apply_repetition_penalties_cuda": 761, "apply_repetition_penalties_": 762, "apply_repetition_penalties": 763, "repetition": 764, "place": 765, "args": 766, "shape": 767, "num_seqs": 768, "vocab_size": 769, "boolean": 770, "indicating": 771, "tokens": 772, "appear": 773, "is_cuda": 774, "is_contiguous": 775, "rms_norm_dynamic_per_token_quant": 776, "quant_dtype": 777, "scale_ub": 778, "empty_like": 779, "scales": 780, "numel": 781, "float32": 782, "awq_dequantize": 783, "qweight": 784, "split_k_iters": 785, "thx": 786, "thy": 787, "vllm_use_triton_awq": 788, "awq_triton": 789, "awq_dequantize_triton": 790, "awq_gemm": 791, "qzeros": 792, "awq_gemm_triton": 793, "gptq_gemm": 794, "b_q_weight": 795, "b_gptq_qzeros": 796, "b_gptq_scales": 797, "b_g_idx": 798, "use_exllama": 799, "bit": 800, "gptq_shuffle": 801, "q_weight": 802, "q_perm": 803, "marlin_gemm": 804, "b_scales": 805, "workspace": 806, "size_m": 807, "size_n": 808, "size_k": 809, "gptq_marlin_24_gemm": 810, "b_meta": 811, "b_q_type": 812, "id": 813, "cutlass_scaled_mm_supports_fp4": 814, "cuda_device_capability": 815, "cutlass_blockwise_scaled_grouped_mm": 816, "scales_a": 817, "scales_b": 818, "problem_sizes": 819, "expert_offsets": 820, "cutlass_scaled_fp4_mm": 821, "block_scale_a": 822, "block_scale_b": 823, "alpha": 824, "out_dtype": 825, "ndim": 826, "cutlass_scaled_mm_supports_fp8": 827, "cutlass_scaled_mm_supports_block_fp8": 828, "cutlass_scaled_mm": 829, "scale_a": 830, "scale_b": 831, "bias": 832, "implements": 833, "fused": 834, "mm": 835, "implemented": 836, "numpy": 837, "style": 838, "broadcasting": 839, "order": 840, "blockwise": 841, "like": 842, "found": 843, "deepseek": 844, "v3": 845, "also": 846, "extended": 847, "broadcast": 848, "rules": 849, "extend": 850, "following": 851, "rule": 852, "extent": 853, "dimension": 854, "corresponding": 855, "each": 856, "element": 857, "along": 858, "src_shape": 859, "target_shape": 860, "times": 861, "consecutively": 862, "example": 863, "would": 864, "expand": 865, "currently": 866, "case": 867, "128": 868, "bfloat16": 869, "float16": 870, "massage": 871, "2d": 872, "view": 873, "cutlass_compatible_b": 874, "16": 875, "is_rocm": 876, "compressed_tensors": 877, "triton_scaled_mm": 878, "noqa": 879, "cutlass_scaled_mm_azp": 880, "azp_adj": 881, "azp": 882, "param": 883, "per": 884, "include": 885, "always": 886, "channel": 887, "cutlass_sparse_scaled_mm_supported": 888, "cutlass_group_gemm_supported": 889, "cutlass_sparse_compress": 890, "compresses": 891, "sparse": 892, "matrix": 893, "cutlass": 894, "operations": 895, "takes": 896, "dense": 897, "two": 898, "zero": 899, "elements": 900, "metadata": 901, "compressed": 902, "representation": 903, "kernels": 904, "must": 905, "one": 906, "data": 907, "types": 908, "int8": 909, "float8_e4m3fn": 910, "containing": 911, "a_nzs": 912, "a_meta": 913, "raises": 914, "compression": 915, "operation": 916, "fails": 917, "notes": 918, "has": 919, "uint8": 920, "encodes": 921, "sparsity": 922, "elemspermetaelem": 923, "dimensions": 924, "8b": 925, "2b_per_nz": 926, "cutlass_scaled_sparse_mm": 927, "bt_nzs": 928, "bt_meta": 929, "performs": 930, "scaled": 931, "multiplication": 932, "steps": 933, "randn": 934, "prune": 935, "specified": 936, "prune_to_2_4": 937, "compress": 938, "transposed": 939, "applying": 940, "factors": 941, "result": 942, "get_cutlass_moe_mm_data": 943, "topk_ids": 944, "problem_sizes1": 945, "problem_sizes2": 946, "input_permutation": 947, "output_permutation": 948, "num_experts": 949, "blockscale_offsets": 950, "prepare": 951, "necessary": 952, "grouped": 953, "multiplications": 954, "based": 955, "moe": 956, "expert": 957, "mapping": 958, "uses": 959, "compute": 960, "mark": 961, "begins": 962, "computation": 963, "after": 964, "sorted": 965, "computed": 966, "mxnxk": 967, "sizes": 968, "mms": 969, "permutation": 970, "shuffle": 971, "before": 972, "executing": 973, "argument": 974, "passed": 975, "fp4": 976, "block": 977, "rows": 978, "shuffle_rows": 979, "input_tensor": 980, "dst2src_map": 981, "according": 982, "store": 983, "output_tensor": 984, "permute": 985, "performing": 986, "num_tokens_permuted": 987, "get_cutlass_pplx_moe_mm_data": 988, "expert_num_tokens": 989, "num_local_experts": 990, "padded_m": 991, "non_zero_expert_idxs": 992, "consecutive": 993, "experts": 994, "counts": 995, "them": 996, "cutlass_moe_mm": 997, "out_tensors": 998, "a_tensors": 999, "b_tensors": 1000, "a_scales": 1001, "a_strides": 1002, "b_strides": 1003, "c_strides": 1004, "per_act_token": 1005, "per_out_ch": 1006, "executes": 1007, "fp8": 1008, "quantized": 1009, "ab": 1010, "strides": 1011, "cutlass_fp4_moe_mm": 1012, "alphas": 1013, "sf_offsets": 1014, "blockscaled": 1015, "gemm": 1016, "runs": 1017, "gemms": 1018, "combination": 1019, "problem": 1020, "during": 1021, "nvfp4": 1022, "fusedmoe": 1023, "forward": 1024, "a_ptrs": 1025, "b_ptrs": 1026, "tensors": 1027, "weights": 1028, "a_": 1029, "blockscales": 1030, "e4m3": 1031, "precision": 1032, "sf_size": 1033, "sf_offset": 1034, "cutlass_fp4_group_mm": 1035, "gptq_marlin_repack": 1036, "perm": 1037, "num_bits": 1038, "awq_marlin_repack": 1039, "gptq_marlin_moe_repack": 1040, "awq_marlin_moe_repack": 1041, "gptq_marlin_gemm": 1042, "b_bias": 1043, "global_scale": 1044, "b_zeros": 1045, "g_idx": 1046, "is_k_full": 1047, "use_atomic_add": 1048, "use_fp32_reduce": 1049, "is_zp_float": 1050, "machete_supported_schedules": 1051, "a_type": 1052, "b_type": 1053, "group_scales_type": 1054, "group_zeros_type": 1055, "channel_scales_type": 1056, "token_scales_type": 1057, "out_type": 1058, "machete_mm": 1059, "b_q": 1060, "returned": 1061, "machete_prepack_b": 1062, "b_group_scales": 1063, "b_group_zeros": 1064, "b_group_size": 1065, "b_channel_scales": 1066, "a_token_scales": 1067, "schedule": 1068, "permute_cols": 1069, "scaled_fp4_quant": 1070, "input_global_scale": 1071, "quantize": 1072, "quantizes": 1073, "last": 1074, "given": 1075, "every": 1076, "dynamically": 1077, "factor": 1078, "shared": 1079, "stored": 1080, "swizzled": 1081, "layout": 1082, "docs": 1083, "parallel": 1084, "thread": 1085, "execution": 1086, "tcgen05": 1087, "mma": 1088, "4x": 1089, "scalar": 1090, "entire": 1091, "values": 1092, "packed": 1093, "float8_e4m3": 1094, "sizzled": 1095, "needs": 1096, "got": 1097, "other_dims": 1098, "reshape": 1099, "multiple": 1100, "fp16": 1101, "bf16": 1102, "rounded": 1103, "due": 1104, "requirement": 1105, "minimum": 1106, "tile": 1107, "128x4": 1108, "pad": 1109, "multiples": 1110, "int32": 1111, "round_up": 1112, "rounded_m": 1113, "scale_n": 1114, "rounded_n": 1115, "output_scale": 1116, "scaled_fp4_experts_quant": 1117, "topk": 1118, "offsets": 1119, "blockscale": 1120, "output_scales": 1121, "control": 1122, "maximum": 1123, "prevent": 1124, "running": 1125, "memory": 1126, "increased": 1127, "larger": 1128, "max_tokens_per_expert": 1129, "vllm_max_tokens_per_expert_fp4_moe": 1130, "m_numtopk": 1131, "less": 1132, "than": 1133, "cutlass_moe_fp4": 1134, "observed": 1135, "scales_k": 1136, "padded_k": 1137, "orch": 1138, "scaled_fp8_quant": 1139, "num_token_padding": 1140, "use_per_token_if_dynamic": 1141, "supports": 1142, "both": 1143, "static": 1144, "dynamic": 1145, "you": 1146, "provide": 1147, "omit": 1148, "determined": 1149, "padding": 1150, "downstream": 1151, "benefit": 1152, "upper": 1153, "bound": 1154, "least": 1155, "whether": 1156, "do": 1157, "per_tensor": 1158, "per_token": 1159, "code": 1160, "assumes": 1161, "batch_dim": 1162, "num_tokens": 1163, "flattened": 1164, "mi300": 1165, "float_e3m3fnuz": 1166, "fp8_dtype": 1167, "ape": 1168, "dynamic_per_token_scaled_fp8_quant": 1169, "dynamic_scaled_fp8_quant": 1170, "static_scaled_fp8_quant": 1171, "allspark_repack_weight": 1172, "zero_point": 1173, "has_zp": 1174, "rearrange": 1175, "asymmetric": 1176, "n32k16": 1177, "ampere": 1178, "w8a16": 1179, "original": 1180, "provided": 1181, "symmetric": 1182, "rearranged": 1183, "n_32align": 1184, "32": 1185, "qweight_reorder": 1186, "scale_reorder": 1187, "zero_point_reorder": 1188, "rearrange_kn_weight_as_n32k16_order": 1189, "allspark_w8a16_gemm": 1190, "b_qweight": 1191, "b_qzeros": 1192, "group_size": 1193, "sm_count": 1194, "sm_version": 1195, "cublas_m_threshold": 1196, "n32k16_reorder": 1197, "scaled_int8_quant": 1198, "maybe": 1199, "invoke": 1200, "point": 1201, "ignored": 1202, "static_scaled_int8_quant": 1203, "input_scales": 1204, "input_azp": 1205, "dynamic_scaled_int8_quant": 1206, "marlin_qqq_gemm": 1207, "s_tok": 1208, "s_ch": 1209, "s_group": 1210, "ggml_dequantize": 1211, "quant_type": 1212, "ggml_mul_mat_vec_a8": 1213, "row": 1214, "ggml_mul_mat_a8": 1215, "ggml_moe_a8": 1216, "sorted_token_ids": 1217, "expert_ids": 1218, "num_tokens_post_padded": 1219, "top_k": 1220, "ggml_moe_a8_vec": 1221, "symint": 1222, "ggml_moe_get_block_size": 1223, "selective_scan_fwd": 1224, "delta": 1225, "d_": 1226, "z_": 1227, "delta_bias_": 1228, "delta_softplus": 1229, "cache_indices": 1230, "has_initial_state": 1231, "ssm_states": 1232, "pad_slot_id": 1233, "llmm1": 1234, "rows_per_block": 1235, "wvsplitk": 1236, "cu_count": 1237, "wvsplitkq": 1238, "moe_sum": 1239, "moe_align_block_size": 1240, "experts_ids": 1241, "num_tokens_post_pad": 1242, "moe_wna16_gemm": 1243, "topk_weights": 1244, "block_size_k": 1245, "notimplementederror": 1246, "optimized": 1247, "topk_softmax": 1248, "token_expert_indices": 1249, "gating_output": 1250, "moe_wna16_marlin_gemm": 1251, "num_tokens_past_padded": 1252, "moe_block_size": 1253, "mul_topk_weights": 1254, "is_ep": 1255, "reshape_and_cache": 1256, "slot_mapping": 1257, "_c_cache_ops": 1258, "reshape_and_cache_flash": 1259, "concat_and_cache_mla": 1260, "kv_c": 1261, "k_pe": 1262, "copy_blocks": 1263, "key_caches": 1264, "value_caches": 1265, "block_mapping": 1266, "copy_blocks_mla": 1267, "kv_caches": 1268, "swap_blocks": 1269, "convert_fp8": 1270, "kv_dtype": 1271, "gather_cache": 1272, "src_cache": 1273, "block_table": 1274, "cu_seq_lens": 1275, "seq_starts": 1276, "get_device_attribute": 1277, "attribute": 1278, "_c_cuda_utils": 1279, "get_max_shared_memory_per_block_device_attribute": 1280, "ruff": 1281, "e501": 1282, "init_custom_ar": 1283, "ipc_tensors": 1284, "rank_data": 1285, "rank": 1286, "fully_connected": 1287, "_c_custom_ar": 1288, "all_reduce": 1289, "fa": 1290, "inp": 1291, "reg_buffer": 1292, "reg_buffer_sz_bytes": 1293, "dispose": 1294, "meta_size": 1295, "register_buffer": 1296, "get_graph_buffer_ipc_meta": 1297, "register_graph_buffers": 1298, "handles": 1299, "allocate_shared_buffer_and_handle": 1300, "open_mem_handle": 1301, "mem_handle": 1302, "free_shared_buffer": 1303, "ptr": 1304, "init_custom_qr": 1305, "world_size": 1306, "qr_max_size": 1307, "qr_destroy": 1308, "qr_all_reduce": 1309, "quant_level": 1310, "cast_bf2half": 1311, "qr_get_handle": 1312, "qr_open_handles": 1313, "get_flash_mla_metadata": 1314, "cache_seqlens": 1315, "num_heads_per_head_k": 1316, "num_heads_k": 1317, "arguments": 1318, "equals": 1319, "seq_len_q": 1320, "num_heads_q": 1321, "tile_scheduler_metadata": 1322, "num_sm_parts": 1323, "tileschedulermetadatasize": 1324, "num_splits": 1325, "flash_mla_with_kvcache": 1326, "k_cache": 1327, "head_dim_v": 1328, "softmax_scale": 1329, "head_dim": 1330, "num_blocks": 1331, "page_block_size": 1332, "max_num_blocks_per_seq": 1333, "get_mla_metadata": 1334, "qk": 1335, "softmax": 1336, "sqrt": 1337, "attention": 1338, "mask": 1339, "softmax_lse": 1340, "flash_mla_fwd_kvcache": 1341, "cutlass_mla_decode": 1342, "q_nope": 1343, "q_pe": 1344, "kv_c_and_k_pe_cache": 1345, "page_table": 1346, "sm100_cutlass_mla_decode": 1347, "num_kv_splits": 1348, "sm100_cutlass_mla_get_workspace_size": 1349, "num_batches": 1350, "ipex_ops": 1351, "_reshape_activation_tensor": 1352, "num": 1353, "x1": 1354, "x2": 1355, "chunk": 1356, "chunks": 1357, "silu_and_mul": 1358, "ipex": 1359, "functional": 1360, "gelu_and_mul": 1361, "gelu_tanh_and_mul": 1362, "gelu_fast": 1363, "nn": 1364, "gelu": 1365, "gelu_new": 1366, "gelu_quick": 1367, "context_lens": 1368, "max_context_len": 1369, "auto": 1370, "num_queries_per_tokens": 1371, "pagedattention": 1372, "single_query_kv_attent": 1373, "tion": 1374, "view_as": 1375, "single_query_kv_attention": 1376, "seq_len": 1377, "cos_sin_dim": 1378, "rotary_embedding_batched": 1379, "tmp": 1380, "add_rms_norm": 1381, "copy_": 1382, "varlen_attention": 1383, "seqlen_q": 1384, "seqlen_k": 1385, "max_seqlen_q": 1386, "max_seqlen_k": 1387, "pdropout": 1388, "zero_tensors": 1389, "is_causal": 1390, "return_softmax": 1391, "gen_": 1392, "generator": 1393, "window_size_left": 1394, "window_size": 1395, "e_right": 1396, "logits_soft_cap": 1397, "endswith": 1398, "window_size_right": 1399, "e_cache": 1400, "k_scale_float": 1401, "v_scale_float": 1402, "kv": 1403, "cache": 1404, "flash_attn_varlen_func": 1405, "cu_seqlens_q": 1406, "seqused_k": 1407, "don": 1408, "softcap": 1409, "cu_seqlens_k": 1410, "parameters": 1411, "keep": 1412, "scheduler_metadata": 1413, "fa_version": 1414, "q_descale": 1415, "k_descale": 1416, "v_descale": 1417, "s_aux": 1418, "cumsum": 1419, "real_window_size": 1420, "get_scheduler_metadata": 1421, "num_heads_kv": 1422, "headdim": 1423, "qkv_dtype": 1424, "headdim_v": 1425, "cu_seqlens_k_new": 1426, "cache_leftpad": 1427, "page_size": 1428, "max_seqlen_k_new": 1429, "means": 1430, "infinite": 1431, "window": 1432, "has_softcap": 1433, "tuned": 1434, "speed": 1435, "pack_gqa": 1436, "sm_margin": 1437, "some": 1438, "sms": 1439, "communication": 1440, "warning_once": 1441, "returning": 1442, "ignore": 1443, "sw": 1444, "wap_blocks": 1445, "dataclasses": 1446, "dataclass": 1447, "lora": 1448, "lorarequest": 1449, "sequence": 1450, "logprob": 1451, "beamsearchsequence": 1452, "beam": 1453, "keeps": 1454, "track": 1455, "log": 1456, "probability": 1457, "field": 1458, "filled": 1459, "about": 1460, "user": 1461, "includes": 1462, "logprobs": 1463, "lora_request": 1464, "cum_logprob": 1465, "finish_reason": 1466, "stop_reason": 1467, "multi_modal_data": 1468, "multimodaldatadict": 1469, "mm_processor_kwargs": 1470, "beamsearchoutput": 1471, "best": 1472, "sequences": 1473, "length": 1474, "equal": 1475, "width": 1476, "beamsearchinstance": 1477, "prompt_tokens": 1478, "kwargs": 1479, "beams": 1480, "completed": 1481, "get_beam_search_score": 1482, "cumulative_logprob": 1483, "eos_token_id": 1484, "length_penalty": 1485, "calculate": 1486, "score": 1487, "huggingface": 1488, "transformers": 1489, "ccb92be23def445f2afdea94c31286f84b89eb5b": 1490, "generation": 1491, "beam_search": 1492, "l938": 1493, "create_sort_beams_key_function": 1494, "sort_beams_key": 1495, "datetime": 1496, "locale": 1497, "collections": 1498, "namedtuple": 1499, "regex": 1500, "environment_variables": 1501, "systemenv": 1502, "torch_version": 1503, "is_debug_build": 1504, "cuda_compiled_version": 1505, "gcc_version": 1506, "clang_version": 1507, "cmake_version": 1508, "libc_version": 1509, "python_version": 1510, "python_platform": 1511, "is_cuda_available": 1512, "cuda_runtime_version": 1513, "cuda_module_loading": 1514, "nvidia_driver_version": 1515, "nvidia_gpu_models": 1516, "cudnn_version": 1517, "pip_version": 1518, "pip": 1519, "pip3": 1520, "pip_packages": 1521, "conda_packages": 1522, "hip_compiled_version": 1523, "hip_runtime_version": 1524, "miopen_runtime_version": 1525, "caching_allocator_config": 1526, "is_xnnpack_available": 1527, "cpu_info": 1528, "specific": 1529, "neuron_sdk_version": 1530, "vllm_version": 1531, "vllm_build_flags": 1532, "gpu_topo": 1533, "env_vars": 1534, "default_conda_patterns": 1535, "cudatoolkit": 1536, "soumith": 1537, "mkl": 1538, "magma": 1539, "triton": 1540, "optree": 1541, "nccl": 1542, "zmq": 1543, "pynvml": 1544, "default_pip_patterns": 1545, "mypy": 1546, "flake8": 1547, "onnx": 1548, "stderr": 1549, "popen": 1550, "pipe": 1551, "raw_output": 1552, "raw_err": 1553, "communicate": 1554, "rc": 1555, "get_platform": 1556, "win32": 1557, "enc": 1558, "oem": 1559, "getpreferredencoding": 1560, "topo": 1561, "leading": 1562, "whitespace": 1563, "because": 1564, "meaningful": 1565, "rstrip": 1566, "filenotfounderror": 1567, "cmd_str": 1568, "isinstance": 1569, "127": 1570, "run_and_read_all": 1571, "run_lambda": 1572, "reads": 1573, "run_and_parse_first_match": 1574, "run_and_return_first_line": 1575, "get_conda_packages": 1576, "patterns": 1577, "conda": 1578, "conda_exe": 1579, "splitlines": 1580, "get_gcc_version": 1581, "gcc": 1582, "get_clang_version": 1583, "clang": 1584, "get_cmake_version": 1585, "get_nvidia_driver_version": 1586, "darwin": 1587, "cmd": 1588, "kextstat": 1589, "grep": 1590, "get_nvidia_smi": 1591, "get_gpu_info": 1592, "torch_available": 1593, "hasattr": 1594, "is_available": 1595, "prop": 1596, "get_device_properties": 1597, "gcnarchname": 1598, "gcnarch": 1599, "nogcnarchnameonoldpytorch": 1600, "get_device_name": 1601, "uuid_regex": 1602, "uuid": 1603, "anonymize": 1604, "gpus": 1605, "sub": 1606, "get_running_cuda_version": 1607, "get_cudnn_version": 1608, "libcudnn": 1609, "hard": 1610, "tell": 1611, "being": 1612, "system_root": 1613, "systemroot": 1614, "windows": 1615, "cuda_path": 1616, "where_cmd": 1617, "system32": 1618, "cudnn_cmd": 1619, "cudnn": 1620, "dll": 1621, "drivers": 1622, "usr": 1623, "installation": 1624, "guide": 1625, "mac": 1626, "html": 1627, "deeplearning": 1628, "sdk": 1629, "installmac": 1630, "cudnn_library": 1631, "library": 1632, "installed": 1633, "elsewhere": 1634, "ls": 1635, "ldconfig": 1636, "rev": 1637, "cut": 1638, "f1": 1639, "permission": 1640, "realpath": 1641, "files_set": 1642, "eliminate": 1643, "symbolic": 1644, "links": 1645, "add": 1646, "alphabetize": 1647, "deterministic": 1648, "probably": 1649, "linux": 1650, "program_files_root": 1651, "programfiles": 1652, "program": 1653, "legacy_path": 1654, "corporation": 1655, "nvsmi": 1656, "new_path": 1657, "smis": 1658, "candidate_smi": 1659, "break": 1660, "hipcc": 1661, "get_neuron_sdk_version": 1662, "script": 1663, "version_str": 1664, "changes": 1665, "git_sha": 1666, "date": 1667, "without": 1668, "summarize_vllm_build_flags": 1669, "method": 1670, "flags": 1671, "constant": 1672, "variables": 1673, "etc": 1674, "archs": 1675, "torch_cuda_arch_list": 1676, "enabled": 1677, "disabled": 1678, "neuron_cores": 1679, "get_gpu_topo": 1680, "showtopo": 1681, "get_cpu_info": 1682, "lscpu": 1683, "wmic": 1684, "manufacturer": 1685, "family": 1686, "architecture": 1687, "processortype": 1688, "deviceid": 1689, "currentclockspeed": 1690, "maxclockspeed": 1691, "l2cachesize": 1692, "l2cachespeed": 1693, "revision": 1694, "sysctl": 1695, "machdep": 1696, "brand_string": 1697, "cygwin": 1698, "get_mac_version": 1699, "sw_vers": 1700, "productversion": 1701, "get_windows_version": 1702, "wmic_cmd": 1703, "wbem": 1704, "findstr_cmd": 1705, "findstr": 1706, "caption": 1707, "get_lsb_version": 1708, "lsb_release": 1709, "description": 1710, "check_release_file": 1711, "pretty_name": 1712, "get_os": 1713, "machine": 1714, "macos": 1715, "ubuntu": 1716, "debian": 1717, "desc": 1718, "reading": 1719, "get_python_platform": 1720, "get_libc_version": 1721, "libc_ver": 1722, "get_pip_packages": 1723, "pytorch": 1724, "packages": 1725, "run_with_pip": 1726, "pip_spec": 1727, "find_spec": 1728, "pip_available": 1729, "importerror": 1730, "mpip": 1731, "freeze": 1732, "uv": 1733, "collect": 1734, "get_cachingallocator_config": 1735, "ca_config": 1736, "pytorch_cuda_alloc_conf": 1737, "get_cuda_module_loading_config": 1738, "init": 1739, "config": 1740, "backends": 1741, "xnnpack": 1742, "attr": 1743, "get_env_vars": 1744, "secret_terms": 1745, "secret": 1746, "access": 1747, "password": 1748, "report_prefix": 1749, "cublas": 1750, "omp_": 1751, "mkl_": 1752, "items": 1753, "term": 1754, "get_env_info": 1755, "pip_list_output": 1756, "debug_mode_str": 1757, "cuda_available_str": 1758, "get_version_or_na": 1759, "_lst": 1760, "rsplit": 1761, "_show_config": 1762, "miopen": 1763, "sys_version": 1764, "maxsize": 1765, "bit_length": 1766, "get_cud": 1767, "da_module_loading_config": 1768, "env_info_fmt": 1769, "libc": 1770, "gpu": 1771, "relevant": 1772, "pretty_str": 1773, "envinfo": 1774, "replace_nones": 1775, "dct": 1776, "replacement": 1777, "keys": 1778, "replace_bools": 1779, "yes": 1780, "prepend": 1781, "tag": 1782, "updated_lines": 1783, "replace_if_empty": 1784, "maybe_start_on_next_line": 1785, "multiline": 1786, "mutable_dict": 1787, "_asdict": 1788, "start": 1789, "next": 1790, "doesn": 1791, "report": 1792, "fields": 1793, "dynamic_cuda_fields": 1794, "all_cuda_fields": 1795, "all_dynamic_cuda_fields_missing": 1796, "objects": 1797, "were": 1798, "previously": 1799, "ll": 1800, "up": 1801, "ie": 1802, "get_pretty_env_info": 1803, "collecting": 1804, "information": 1805, "_crash_handler": 1806, "minidump_dir": 1807, "default_minidump_dir": 1808, "dumps": 1809, "dump": 1810, "listdir": 1811, "getctime": 1812, "ctime": 1813, "creation_time": 1814, "fromtimestamp": 1815, "strftime": 1816, "msg": 1817, "detected": 1818, "minidump": 1819, "created": 1820, "related": 1821, "bug": 1822, "abc": 1823, "mutablemapping": 1824, "urlparse": 1825, "aiohttp": 1826, "requests": 1827, "httpconnection": 1828, "send": 1829, "http": 1830, "reuse_client": 1831, "_sync_client": 1832, "session": 1833, "_async_client": 1834, "clientsession": 1835, "get_sync_client": 1836, "intentionally": 1837, "async": 1838, "even": 1839, "though": 1840, "client": 1841, "accessible": 1842, "inside": 1843, "event": 1844, "loop": 1845, "get_async_client": 1846, "trust_env": 1847, "_validate_http_url": 1848, "parsed_url": 1849, "scheme": 1850, "invalid": 1851, "valid": 1852, "_headers": 1853, "extras": 1854, "agent": 1855, "get_response": 1856, "stream": 1857, "timeout": 1858, "extra_headers": 1859, "headers": 1860, "get_async_response": 1861, "await": 1862, "get_bytes": 1863, "bytes": 1864, "raise_for_status": 1865, "async_get_bytes": 1866, "get_text": 1867, "async_get_text": 1868, "get_json": 1869, "async_get_json": 1870, "download_file": 1871, "save_path": 1872, "chunk_size": 1873, "save_pa": 1874, "iter_content": 1875, "async_download_file": 1876, "iter_chunked": 1877, "global_http_connection": 1878, "processes": 1879, "interact": 1880, "workers": 1881, "whenever": 1882, "called": 1883, "nccl_cumem_enable": 1884, "increase": 1885, "overhead": 1886, "cudagraph": 1887, "allreduce": 1888, "issues": 1889, "1234": 1890, "caps": 1891, "imex": 1892, "channels": 1893, "requires": 1894, "work": 1895, "multi": 1896, "node": 1897, "nvlink": 1898, "typically": 1899, "gb200": 1900, "nvl72": 1901, "systems": 1902, "ultimate": 1903, "way": 1904, "detect": 1905, "nvml": 1906, "apis": 1907, "too": 1908, "expensive": 1909, "approximation": 1910, "existence": 1911, "across": 1912, "nodes": 1913, "still": 1914, "cost": 1915, "worthwhile": 1916, "very": 1917, "fast": 1918, "cross": 1919, "bandwidth": 1920, "pull": 1921, "15951": 1922, "avoids": 1923, "unintentional": 1924, "pytorch_nvml_based_cuda_check": 1925, "10480": 1926, "torchinductor_compile_threads": 1927, "10619": 1928, "_inductor": 1929, "compile_threads": 1930, "hashlib": 1931, "get_default_cache_root": 1932, "xdg_cache_home": 1933, "expanduser": 1934, "get_default_config_root": 1935, "xdg_config_home": 1936, "maybe_convert_int": 1937, "maybe_convert_bool": 1938, "get_vllm_port": 1939, "port": 1940, "vllm_port": 1941, "integer": 1942, "uri": 1943, "suggest": 1944, "k8s": 1945, "service": 1946, "discovery": 1947, "issue": 1948, "parsed": 1949, "caused": 1950, "kubernetes": 1951, "ai": 1952, "en": 1953, "stable": 1954, "serving": 1955, "__getattr__": 1956, "lazy": 1957, "evaluation": 1958, "__dir__": 1959, "is_set": 1960, "explicitly": 1961, "set_vllm_use_v1": 1962, "use_v1": 1963, "vllm_use_v1": 1964, "compute_hash": 1965, "new": 1966, "added": 1967, "affects": 1968, "graph": 1969, "vllm_pp_layer_partition": 1970, "generate": 1971, "graphs": 1972, "vars": 1973, "affect": 1974, "choice": 1975, "deftruth": 1976, "factorize": 1977, "environment_variables_to_hash": 1978, "vllm_mla_disable": 1979, "vllm_use_triton_flash_attn": 1980, "vllm_dp_rank": 1981, "vllm_dp_size": 1982, "vllm_use_standalone_compile": 1983, "vllm_fused_moe_chunk_size": 1984, "vllm_flashinfer_moe_backend": 1985, "vllm_v1_use_prefill_decode_attention": 1986, "vllm_use_aiter_unified_attention": 1987, "vllm_attention_backend": 1988, "vllm_use_flashinfer_sampler": 1989, "vllm_flashinfer_force_tensor_cores": 1990, "vllm_disabled_kernels": 1991, "vllm_use_deep_gemm": 1992, "vllm_use_trtllm_fp4_gemm": 1993, "vllm_use_flashinfer_moe_fp8": 1994, "vllm_use_flashinfer_moe_fp4": 1995, "vllm_use_flashinfer_moe_mxfp4_mxfp8": 1996, "vllm_use_flashinfer_moe_mxfp4_bf16": 1997, "vllm_use_cudnn_prefill": 1998, "vllm_use_trtllm_attention": 1999, "vllm_rocm_use_aiter": 2000, "vllm_rocm_use_aiter_paged_attn": 2001, "vllm_rocm_use_aiter_linear": 2002, "vllm_rocm_use_aiter_moe": 2003, "vllm_rocm_use_aiter_rmsnorm": 2004, "vllm_rocm_use_aiter_mla": 2005, "vllm_rocm_use_aiter_mha": 2006, "vllm_rocm_use_skinny_gemm": 2007, "vllm_rocm_fp8_padding": 2008, "vllm_rocm_moe_padding": 2009, "vllm_rocm_custom_paged_attn": 2010, "vllm_rocm_quick_reduce_quantization": 2011, "vllm_rocm_quick_reduce_cast_bf16_to_fp16": 2012, "vllm_rocm_quick_reduce_max_size_bytes_mb": 2013, "goes": 2014, "sync": 2015, "hash_str": 2016, "md5": 2017, "encode": 2018, "usedforsecurity": 2019, "hexdigest": 2020, "time": 2021, "defaultdict": 2022, "contextmanager": 2023, "distributed": 2024, "dist": 2025, "cudagraphmode": 2026, "parallelconfig": 2027, "vllmconfig": 2028, "batchdescriptor": 2029, "descriptor": 2030, "dispatching": 2031, "minimal": 2032, "possible": 2033, "properly": 2034, "uniquely": 2035, "describe": 2036, "padded": 2037, "uniform_decode": 2038, "uniform": 2039, "dispatch": 2040, "supporting": 2041, "batches": 2042, "property": 2043, "non_uniform": 2044, "_compute_chunked_local_num_tokens": 2045, "num_tokens_across_dp_cpu": 2046, "max_num_tokens": 2047, "chunk_idx": 2048, "dp_size": 2049, "local_size": 2050, "dp_tokens": 2051, "min": 2052, "lockstep": 2053, "dpmetadata": 2054, "max_tokens_across_dp_cpu": 2055, "cu_tokens_across_dp_cpu": 2056, "local_sizes": 2057, "num_tokens_across_dp": 2058, "dp_rank": 2059, "gather": 2060, "dp": 2061, "ranks": 2062, "results": 2063, "num_tokens_tensor": 2064, "parallel_state": 2065, "get_dp_group": 2066, "cpu_group": 2067, "parallel_config": 2068, "attn_metadata": 2069, "data_parallel_size": 2070, "data_parallel_rank": 2071, "num_prefill_tokens": 2072, "v0": 2073, "batchsize": 2074, "num_decode_tokens": 2075, "v1": 2076, "chunked_sizes": 2077, "max_chunk_size_per_rank": 2078, "manager": 2079, "temporarily": 2080, "chunked": 2081, "designated": 2082, "portion": 2083, "others": 2084, "uneven": 2085, "total": 2086, "most": 2087, "sets": 2088, "process": 2089, "cumulative": 2090, "derive": 2091, "wise": 2092, "allowed": 2093, "cu_sizes": 2094, "item": 2095, "yield": 2096, "get_chunk_sizes_across_dp_rank": 2097, "forwardcontext": 2098, "vllm_config": 2099, "compilation_config": 2100, "static_forward_context": 2101, "no_compile_layers": 2102, "attentionmetadata": 2103, "map": 2104, "layer_name": 2105, "layer": 2106, "making": 2107, "virtual_engines": 2108, "share": 2109, "virtual_engine": 2110, "dp_metadata": 2111, "full": 2112, "piecewise": 2113, "cudagraph_runtime_mode": 2114, "batch_descriptor": 2115, "__post_init__": 2116, "mode": 2117, "get_forward_context": 2118, "_forward_context": 2119, "set_forward_context": 2120, "stores": 2121, "inject": 2122, "logic": 2123, "model": 2124, "global": 2125, "forward_start_time": 2126, "need_to_track_batchsize": 2127, "track_batchsize": 2128, "perf_counter": 2129, "prev_context": 2130, "last_logging_time": 2131, "batchsize_logging_interval": 2132, "synchronous": 2133, "scheduling": 2134, "right": 2135, "now": 2136, "adding": 2137, "synchronize": 2138, "measurement": 2139, "milliseconds": 2140, "batchsize_forward_time": 2141, "1000": 2142, "forward_stats": 2143, "bs": 2144, "profiling": 2145, "medium": 2146, "quantile": 2147, "round": 2148, "sort": 2149, "reverse": 2150, "stats": 2151, "median_time": 2152, "ms": 2153, "hashable": 2154, "functools": 2155, "lru_cache": 2156, "partial": 2157, "dictconfig": 2158, "methodtype": 2159, "cast": 2160, "vllm_configure_logging": 2161, "vllm_logging_config_path": 2162, "vllm_logging_level": 2163, "vllm_logging_prefix": 2164, "_format": 2165, "levelname": 2166, "asctime": 2167, "lineno": 2168, "message": 2169, "_date_format": 2170, "default_logging_config": 2171, "formatters": 2172, "logging_utils": 2173, "newlineformatter": 2174, "datefmt": 2175, "handlers": 2176, "streamhandler": 2177, "formatter": 2178, "loggers": 2179, "propagate": 2180, "disable_existing_loggers": 2181, "_print_debug_once": 2182, "stacklevel": 2183, "caller": 2184, "_print_info_once": 2185, "_print_warning_once": 2186, "_vllmlogger": 2187, "just": 2188, "methods": 2189, "directly": 2190, "instance": 2191, "conflicting": 2192, "intel_extension_for_pytorch": 2193, "_logger": 2194, "debug_once": 2195, "silently": 2196, "dropped": 2197, "info_once": 2198, "_methods_to_patch": 2199, "_configure_vllm_root_logger": 2200, "logging_config": 2201, "evaluated": 2202, "implies": 2203, "unset": 2204, "load": 2205, "encoding": 2206, "custom_config": 2207, "expected": 2208, "provides": 2209, "backwards": 2210, "compatibility": 2211, "10134": 2212, "purpose": 2213, "retrieved": 2214, "method_name": 2215, "setattr": 2216, "_trace_calls": 2217, "log_path": 2218, "frame": 2219, "arg": 2220, "f_code": 2221, "co_filename": 2222, "f_lineno": 2223, "func_name": 2224, "co_name": 2225, "functions": 2226, "last_frame": 2227, "f_back": 2228, "last_filename": 2229, "last_lineno": 2230, "last_func_name": 2231, "initial": 2232, "ts": 2233, "nameerror": 2234, "deleted": 2235, "shutdown": 2236, "enable_trace_function_call": 2237, "log_file_path": 2238, "tracing": 2239, "under": 2240, "useful": 2241, "debugging": 2242, "hangs": 2243, "crashes": 2244, "calling": 2245, "affected": 2246, "vllm_trace_function": 2247, "record": 2248, "slow": 2249, "down": 2250, "suggested": 2251, "hang": 2252, "saved": 2253, "settrace": 2254, "transformers_utils": 2255, "tokenizer": 2256, "anytokenizer": 2257, "logitsprocessor": 2258, "get_bad_words_logits_processors": 2259, "bad_words": 2260, "bad_words_ids": 2261, "bad_word": 2262, "prohibit": 2263, "words": 2264, "beginning": 2265, "middle": 2266, "add_prefix_space": 2267, "parameter": 2268, "lstrip": 2269, "prompt_token_ids": 2270, "add_special_tokens": 2271, "space": 2272, "produces": 2273, "word": 2274, "nobadwordslogitsprocessor": 2275, "_smallest_logit": 2276, "inf": 2277, "_neutral_logit": 2278, "word_bias": 2279, "floattensor": 2280, "__call__": 2281, "past_tokens_ids": 2282, "_init_word_bias": 2283, "last_token_bias": 2284, "zeros_like": 2285, "bad_word_ids": 2286, "processed": 2287, "prefix_length": 2288, "last_token_id": 2289, "actual_prefix": 2290, "expected_prefix": 2291, "is_match": 2292, "sequencebiaslogitsprocessor": 2293, "logits_process": 2294, "_check_token_ids_bounds": 2295, "bad_": 2296, "_word_id": 2297, "bad_word_id": 2298, "invalid_token_ids": 2299, "token_id": 2300, "vocabulary": 2301, "bad": 2302, "integers": 2303, "satisfying": 2304, "mutablesequence": 2305, "genericsequence": 2306, "generic": 2307, "typing_extensions": 2308, "typevar": 2309, "multimodal": 2310, "multimodalplaceholderdict": 2311, "requestoutputkind": 2312, "promptlogprobs": 2313, "requestmetrics": 2314, "samplelogprobs": 2315, "sequencegroup": 2316, "sequencegroupbase": 2317, "sequencestatus": 2318, "completion": 2319, "generated": 2320, "token_ids": 2321, "ids": 2322, "probabilities": 2323, "top": 2324, "position": 2325, "requested": 2326, "reason": 2327, "why": 2328, "finished": 2329, "stop": 2330, "including": 2331, "encountering": 2332, "eos": 2333, "__repr__": 2334, "pooling": 2335, "extracted": 2336, "hidden": 2337, "states": 2338, "__eq__": 2339, "__class__": 2340, "request_id": 2341, "unique": 2342, "encoder": 2343, "decoder": 2344, "prompt_logprobs": 2345, "whole": 2346, "metrics": 2347, "associated": 2348, "encoder_prompt": 2349, "encoder_prompt_token_ids": 2350, "num_cached_tokens": 2351, "hit": 2352, "kv_transfer_params": 2353, "params": 2354, "transfer": 2355, "multi_modal_placeholders": 2356, "older": 2357, "breaking": 2358, "ignoring": 2359, "extra": 2360, "next_output": 2361, "aggregate": 2362, "next_completion": 2363, "enumerate": 2364, "next_c": 2365, "classmethod": 2366, "from_seq_group": 2367, "cls": 2368, "seq_group": 2369, "use_cache": 2370, "seq_id_to_seq_group": 2371, "is_finished": 2372, "assembled_seq_group": 2373, "maybe_assemble_group": 2374, "finish_seq": 2375, "clear": 2376, "seq": 2377, "to_be_finished": 2378, "sub_request_id": 2379, "seq_id_to_index": 2380, "del": 2381, "sampling": 2382, "completionrequest": 2383, "output_kind": 2384, "final_only": 2385, "needed": 2386, "cached_request_output": 2387, "top_n_seqs": 2388, "get_seqs": 2389, "sampled": 2390, "include_logprobs": 2391, "text_buffer_length": 2392, "output_text_buffer_length": 2393, "include_prompt": 2394, "output_text": 2395, "get_output_text_to_return": 2396, "output_token_ids": 2397, "get_output_token_ids_to_return": 2398, "num_output_tokens": 2399, "get_num_cached_tokens": 2400, "output_logprobs": 2401, "slice": 2402, "applicable": 2403, "finishes": 2404, "get_output_len": 2405, "cached": 2406, "cached_outputs": 2407, "ed_request_output": 2408, "get_cumulative_logprob": 2409, "get_finished_reason": 2410, "encoder_pro": 2411, "ompt": 2412, "finished_time": 2413, "set_finished_time": 2414, "init_kwargs": 2415, "request_output": 2416, "_o": 2417, "flag": 2418, "pooled_data": 2419, "requestoutputfactory": 2420, "embedding": 2421, "vector": 2422, "floats": 2423, "depends": 2424, "from_base": 2425, "pooling_output": 2426, "tolist": 2427, "hidden_size": 2428, "classification": 2429, "probs": 2430, "classes": 2431, "num_classes": 2432, "scoring": 2433, "similarity": 2434, "classify": 2435, "task": 2436, "embed": 2437, "squeeze": 2438, "deepcopy": 2439, "msgspec": 2440, "tasks": 2441, "poolingtask": 2442, "struct": 2443, "omit_defaults": 2444, "array_like": 2445, "attributes": 2446, "normalize": 2447, "embeddings": 2448, "matryoshka": 2449, "activation": 2450, "reward": 2451, "step_tag_id": 2452, "returned_token_ids": 2453, "internal": 2454, "requires_token_ids": 2455, "extra_kwargs": 2456, "all_parameters": 2457, "valid_parameters": 2458, "clone": 2459, "deep": 2460, "verify": 2461, "model_config": 2462, "modelconfig": 2463, "overwrite": 2464, "validation": 2465, "against": 2466, "_merge_default_parameters": 2467, "_set_default_parameters": 2468, "_verify_valid_parameters": 2469, "pooler_config": 2470, "getattr": 2471, "is_matryoshka": 2472, "served_model_name": 2473, "changing": 2474, "lead": 2475, "poor": 2476, "mds": 2477, "matryoshka_dimensions": 2478, "greater": 2479, "invalid_parameters": 2480, "enum": 2481, "intenum": 2482, "cached_property": 2483, "annotated": 2484, "pydantic": 2485, "basemodel": 2486, "_sampling_eps": 2487, "1e": 2488, "_max_temp": 2489, "samplingtype": 2490, "greedy": 2491, "random": 2492, "random_seed": 2493, "guideddecodingparams": 2494, "logit": 2495, "processor": 2496, "grammar": 2497, "json_object": 2498, "options": 2499, "backend": 2500, "backend_was_auto": 2501, "disable_fallback": 2502, "disable_any_whitespace": 2503, "disable_additional_properties": 2504, "whitespace_pattern": 2505, "structural_tag": 2506, "from_optional": 2507, "schemas": 2508, "model_json_schema": 2509, "validate": 2510, "mutually": 2511, "exclusive": 2512, "guide_count": 2513, "sum": 2514, "kind": 2515, "guided": 2516, "decoding": 2517, "__dict__": 2518, "far": 2519, "deltas": 2520, "intermediate": 2521, "overall": 2522, "follow": 2523, "openai": 2524, "reference": 2525, "completions": 2526, "addition": 2527, "best_of": 2528, "_real_n": 2529, "presence_penalty": 2530, "penalizes": 2531, "encourage": 2532, "while": 2533, "frequency_penalty": 2534, "frequency": 2535, "repetition_penalty": 2536, "temperature": 2537, "controls": 2538, "randomness": 2539, "higher": 2540, "top_p": 2541, "consider": 2542, "min_p": 2543, "represents": 2544, "considered": 2545, "relative": 2546, "likely": 2547, "disable": 2548, "seed": 2549, "strings": 2550, "stop_token_ids": 2551, "unless": 2552, "special": 2553, "ignore_eos": 2554, "generating": 2555, "max_tokens": 2556, "min_tokens": 2557, 