{"spdx": 0, "license": 1, "identifier": 2, "apache": 3, "filecopyrighttext": 4, "copyright": 5, "contributors": 6, "vllm": 7, "project": 8, "import": 9, "importlib": 10, "traceback": 11, "from": 12, "typing": 13, "callable": 14, "unittest": 15, "mock": 16, "patch": 17, "def": 18, "find_cuda_init": 19, "fn": 20, "object": 21, "none": 22, "helper": 23, "function": 24, "debug": 25, "cuda": 26, "re": 27, "initialization": 28, "errors": 29, "initializes": 30, "prints": 31, "stack": 32, "trace": 33, "how": 34, "happens": 35, "torch": 36, "_lazy_init": 37, "wrapper": 38, "nonlocal": 39, "extract_stack": 40, "return": 41, "print": 42, "initialized": 43, "join": 44, "format_list": 45, "strip": 46, "__name__": 47, "__main__": 48, "lambda": 49, "import_module": 50, "model_executor": 51, "models": 52, "llava": 53, "ctypes": 54, "util": 55, "json": 56, "logging": 57, "os": 58, "shutil": 59, "subprocess": 60, "sys": 61, "pathlib": 62, "path": 63, "which": 64, "packaging": 65, "version": 66, "parse": 67, "setuptools": 68, "extension": 69, "setup": 70, "command": 71, "build_ext": 72, "setuptools_scm": 73, "get_version": 74, "utils": 75, "cpp_extension": 76, "cuda_home": 77, "rocm_home": 78, "load_module_from_path": 79, "module_name": 80, "spec": 81, "spec_from_file_location": 82, "module": 83, "module_from_spec": 84, "modules": 85, "loader": 86, "exec_module": 87, "root_dir": 88, "__file__": 89, "parent": 90, "logger": 91, "getlogger": 92, "cannot": 93, "envs": 94, "directly": 95, "because": 96, "depends": 97, "installed": 98, "yet": 99, "py": 100, "vllm_target_device": 101, "platform": 102, "startswith": 103, "darwin": 104, "cpu": 105, "warning": 106, "automatically": 107, "set": 108, "due": 109, "macos": 110, "elif": 111, "linux": 112, "only": 113, "supports": 114, "including": 115, "wsl": 116, "building": 117, "so": 118, "may": 119, "able": 120, "run": 121, "correctly": 122, "empty": 123, "getenv": 124, "hip": 125, "available": 126, "fallback": 127, "main_cuda_version": 128, "12": 129, "is_sccache_available": 130, "bool": 131, "sccache": 132, "int": 133, "vllm_disable_sccache": 134, "is_ccache_available": 135, "ccache": 136, "is_ninja_available": 137, "ninja": 138, "is_url_available": 139, "url": 140, "str": 141, "urllib": 142, "request": 143, "urlopen": 144, "status": 145, "try": 146, "except": 147, "exception": 148, "false": 149, "200": 150, "class": 151, "cmakeextension": 152, "__init__": 153, "self": 154, "name": 155, "cmake_lists_dir": 156, "kwa": 157, "super": 158, "sources": 159, "py_limited_api": 160, "true": 161, "abspath": 162, "cmake_build_ext": 163, "dict": 164, "directories": 165, "have": 166, "been": 167, "configured": 168, "did_config": 169, "determine": 170, "number": 171, "compilation": 172, "jobs": 173, "optionally": 174, "nvcc": 175, "compile": 176, "threads": 177, "compute_num_jobs": 178, "num_jobs": 179, "either": 180, "value": 181, "max_jobs": 182, "environment": 183, "variable": 184, "defined": 185, "cpus": 186, "info": 187, "using": 188, "else": 189, "sched_getaffinity": 190, "isn": 191, "universally": 192, "fall": 193, "back": 194, "cpu_count": 195, "we": 196, "get": 197, "error": 198, "here": 199, "len": 200, "attributeerror": 201, "nvcc_threads": 202, "_is_cuda": 203, "get_nvcc_cuda_version": 204, "11": 205, "when": 206, "reduce": 207, "avoid": 208, "overloading": 209, "system": 210, "max": 211, "perform": 212, "cmake": 213, "configuration": 214, "single": 215, "configure": 216, "ext": 217, "ve": 218, "already": 219, "cmakelists": 220, "txt": 221, "exit": 222, "early": 223, "select": 224, "build": 225, "type": 226, "note": 227, "optimization": 228, "level": 229, "default_cfg": 230, "relwithdebinfo": 231, "cfg": 232, "cmake_build_type": 233, "cmake_args": 234, "dcmake_build_type": 235, "format": 236, "dvllm_target_device": 237, "verbose": 238, "dcmake_verbose_makefile": 239, "dcmake_c_compiler_launcher": 240, "dcmake_cxx_compiler_launcher": 241, "dcmake_cuda_compiler_launcher": 242, "dcmake_hip_compiler_launcher": 243, "pass": 244, "python": 245, "executable": 246, "can": 247, "find": 248, "exact": 249, "match": 250, "dvllm_python_executable": 251, "reuse": 252, "dependencies": 253, "subsequent": 254, "calls": 255, "dvllm_python_path": 256, "override": 257, "base": 258, "directory": 259, "fetchcontent": 260, "downloads": 261, "root": 262, "deps": 263, "allows": 264, "sharing": 265, "between": 266, "profiles": 267, "plays": 268, "more": 269, "nicely": 270, "fetchcontent_base_dir": 271, "env": 272, "vironment": 273, "fc_base_dir": 274, "environ": 275, "dfetchcontent_base_dir": 276, "parallelism": 277, "tool": 278, "dnvcc_threads": 279, "build_tool": 280, "dcmake_job_pool_compile": 281, "string": 282, "dcmake_job_pools": 283, "default": 284, "whatever": 285, "picks": 286, "make": 287, "sure": 288, "use": 289, "dcmake_cuda_compiler": 290, "bin": 291, "check_call": 292, "cwd": 293, "build_temp": 294, "build_extensions": 295, "ensure": 296, "present": 297, "working": 298, "check_output": 299, "oserror": 300, "raise": 301, "runtimeerror": 302, "create": 303, "does": 304, "exist": 305, "exists": 306, "makedirs": 307, "targets": 308, "target_name": 309, "removeprefix": 310, "vllm_flash_attn": 311, "all": 312, "extensions": 313, "append": 314, "build_args": 315, "target": 316, "install": 317, "libraries": 318, "proper": 319, "location": 320, "outdir": 321, "get_ext_fullpath": 322, "absolute": 323, "skip": 324, "same": 325, "continue": 326, "appends": 327, "prefix": 328, "contains": 329, "need": 330, "remove": 331, "range": 332, "count": 333, "should": 334, "actually": 335, "components": 336, "install_args": 337, "component": 338, "first": 339, "standard": 340, "copy": 341, "build_lib": 342, "current": 343, "included": 344, "editable": 345, "glob": 346, "files": 347, "recursive": 348, "file": 349, "dst_file": 350, "split": 351, "copying": 352, "dirname": 353, "exist_ok": 354, "copy_file": 355, "precompiled_build_ext": 356, "disables": 357, "precompiled": 358, "binaries": 359, "assert": 360, "vllm_use_precompiled": 361, "supported": 362, "builds": 363, "skipping": 364, "precompiled_wheel_utils": 365, "extracts": 366, "other": 367, "existing": 368, "wheel": 369, "staticmethod": 370, "extract_precompiled_and_patch_package": 371, "wheel_url_or_path": 372, "tempfile": 373, "zipfile": 374, "temp_dir": 375, "isfile": 376, "wheel_filename": 377, "mkdtemp": 378, "wheels": 379, "wheel_path": 380, "downloading": 381, "urlretrieve": 382, "filename": 383, "package_data_patch": 384, "files_to_copy": 385, "_c": 386, "abi3": 387, "_moe_c": 388, "_flashmla_c": 389, "_vllm_fa2_c": 390, "_vllm_fa3_c": 391, "cumem_allocator": 392, "compiled_regex": 393, "file_members": 394, "list": 395, "filter": 396, "filelist": 397, "extract": 398, "target_path": 399, "open": 400, "src": 401, "target_pat": 402, "th": 403, "wb": 404, "dst": 405, "copyfileobj": 406, "pkg": 407, "replace": 408, "setdefault": 409, "basename": 410, "finally": 411, "removing": 412, "temporary": 413, "rmtree": 414, "get_base_commit_in_main_branch": 415, "force": 416, "nightly": 417, "mainly": 418, "used": 419, "ci": 420, "testing": 421, "vllm_test_use_precompiled_nightly_wheel": 422, "latest": 423, "commit": 424, "hash": 425, "upstream": 426, "main": 427, "branch": 428, "resp_json": 429, "curl": 430, "https": 431, "api": 432, "github": 433, "com": 434, "repos": 435, "commits": 436, "decode": 437, "utf": 438, "upstream_main_commit": 439, "loads": 440, "sha": 441, "docker": 442, "context": 443, "git": 444, "immutable": 445, "missing": 446, "vllm_docker_build_context": 447, "check": 448, "local": 449, "repo": 450, "cat": 451, "calledprocesserror": 452, "fetch": 453, "remote": 454, "repository": 455, "update": 456, "any": 457, "branches": 458, "ensures": 459, "ref": 460, "its": 461, "history": 462, "our": 463, "current_branch": 464, "show": 465, "base_commit": 466, "merge": 467, "valueerror": 468, "err": 469, "fa": 470, "ailed": 471, "compatible": 472, "your": 473, "dev": 474, "_no_device": 475, "has_cuda": 476, "_is_neuron": 477, "_is_tpu": 478, "_is_hip": 479, "rocm": 480, "neuron": 481, "tpu": 482, "_is_cpu": 483, "_is_xpu": 484, "xpu": 485, "_build_custom_ops": 486, "get_rocm_version": 487, "librocm": 488, "core": 489, "see": 490, "blob": 491, "d11f5c20d500f729c393680a01fa902ebf92094b": 492, "rocm_version": 493, "cpp": 494, "l21": 495, "librocm_core_file": 496, "lib": 497, "is_file": 498, "librocm_core": 499, "cdll": 500, "vererrors": 501, "c_uint32": 502, "get_rocm_core_version": 503, "getrocmversion": 504, "restype": 505, "argtypes": 506, "pointer": 507, "major": 508, "minor": 509, "byref": 510, "get_neuronxcc_version": 511, "sysconfig": 512, "site_dir": 513, "get_paths": 514, "purelib": 515, "version_file": 516, "neuronxcc": 517, "executed": 518, "successfully": 519, "fp": 520, "content": 521, "read": 522, "regular": 523, "expression": 524, "search": 525, "__version__": 526, "group": 527, "could": 528, "output": 529, "adapted": 530, "nvidia": 531, "apex": 532, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 533, "nvcc_output": 534, "universal_newlines": 535, "release_idx": 536, "index": 537, "release": 538, "nvcc_cuda_version": 539, "get_gaudi_sw_version": 540, "returns": 541, "driver": 542, "enable": 543, "console": 544, "printing": 545, "hl": 546, "smi": 547, "shell": 548, "text": 549, "capture_output": 550, "enable_console": 551, "returncode": 552, "stdout": 553, "get_vllm_version": 554, "write_to": 555, "_version": 556, "sep": 557, "versions": 558, "might": 559, "contain": 560, "cuda_version": 561, "cuda_version_str": 562, "source": 563, "tarball": 564, "required": 565, "pypi": 566, "sdist": 567, "argv": 568, "cu": 569, "neuron_version": 570, "neuron_version_str": 571, "unknown": 572, "runtime": 573, "get_requirements": 574, "package": 575, "requirements": 576, "requirements_dir": 577, "_read_requirements": 578, "resolved_requirements": 579, "line": 580, "common": 581, "cuda_major": 582, "cuda_minor": 583, "modified_requirements": 584, "req": 585, "flash": 586, "attn": 587, "built": 588, "unsupported": 589, "please": 590, "ext_modules": 591, "_rocm_c": 592, "fa3": 593, "requires": 594, "later": 595, "optional": 596, "since": 597, "doesn": 598, "produce": 599, "targeting": 600, "hopper": 601, "package_data": 602, "typed": 603, "layers": 604, "fused_moe": 605, "configs": 606, "quantization": 607, "advance": 608, "wheel_location": 609, "vllm_precompiled_wheel_location": 610, "wheel_url": 611, "ai": 612, "cp38": 613, "manylinux1_x86_64": 614, "whl": 615, "resp": 616, "warn": 617, "falling": 618, "items": 619, "extend": 620, "cmd": 621, "static": 622, "metadata": 623, "rather": 624, "go": 625, "pyproject": 626, "toml": 627, "install_requires": 628, "extras_require": 629, "bench": 630, "pandas": 631, "datasets": 632, "tensorizer": 633, "10": 634, "fastsafetensors": 635, "runai": 636, "model": 637, "streamer": 638, "13": 639, "s3": 640, "boto3": 641, "audio": 642, "librosa": 643, "soundfile": 644, "mistral_common": 645, "processing": 646, "video": 647, "kept": 648, "backwards": 649, "compatibility": 650, "flashinfer": 651, "updated": 652, "together": 653, "dockerfile": 654, "cmdclass": 655, "requires_files": 656, "cleaning": 657, "lines": 658, "readlines": 659, "lower": 660, "removed": 661, "write": 662, "done": 663, "load": 664, "llm": 665, "my": 666, "bucket": 667, "facebook": 668, "opt": 669, "125m": 670, "v1": 671, "load_format": 672, "serialized": 673, "during": 674, "loading": 675, "openai": 676, "inference": 677, "server": 678, "serve": 679, "order": 680, "arguments": 681, "usable": 682, "given": 683, "tensorizerconfig": 684, "examples": 685, "others": 686, "tensorize_vllm_model": 687, "deserialize": 688, "help": 689, "under": 690, "options": 691, "section": 692, "also": 693, "deserialization": 694, "example": 695, "script": 696, "although": 697, "uri": 698, "tensors": 699, "functionally": 700, "case": 701, "save": 702, "lora": 703, "adapters": 704, "adapter": 705, "hf": 706, "hub": 707, "passing": 708, "id": 709, "serialize": 710, "artifacts": 711, "you": 712, "instance": 713, "ensuring": 714, "specifying": 715, "get_parser": 716, "parser": 717, "flexibleargumentparser": 718, "description": 719, "loaded": 720, "gpu": 721, "extremely": 722, "quickly": 723, "tensor": 724, "encryption": 725, "decryption": 726, "libsodium": 727, "must": 728, "engineargs": 729, "add_cli_args": 730, "add_argument": 731, "along": 732, "deserialized": 733, "instantiating": 734, "creating": 735, "to_serializable": 736, "lorarequest": 737, "initializer": 738, "kwarg": 739, "tensorizer_config_dict": 740, "subparsers": 741, "add_subparsers": 742, "dest": 743, "serialize_parser": 744, "add_parser": 745, "suffix": 746, "construct": 747, "saved": 748, "eleutherai": 749, "gpt": 750, "6b": 751, "provided": 752, "random": 753, "uuid": 754, "where": 755, "combination": 756, "supplied": 757, "dir": 758, "reference": 759, "huggingface": 760, "serialization": 761, "kwargs": 762, "tensorizer_kwargs_arg": 763, "containing": 764, "additional": 765, "keyword": 766, "tensorserializer": 767, "keyfile": 768, "encrypt": 769, "weights": 770, "randomly": 771, "generated": 772, "binary": 773, "key": 774, "deserialize_parser": 775, "verify": 776, "assumes": 777, "therein": 778, "supersede": 779, "decrypt": 780, "tensordeserializer": 781, "tensorizerargs": 782, "merge_extra_config_with_tensorizer_config": 783, "extra_cfg": 784, "hasattr": 785, "setattr": 786, "updating": 787, "extra": 788, "config": 789, "args": 790, "tensorizer_config": 791, "lora_path": 792, "lora_dir": 793, "tensorizer_dir": 794, "tensor_parallel_size": 795, "model_loader_extra_config": 796, "enable_lora": 797, "sampling_params": 798, "samplingparams": 799, "temperature": 800, "max_tokens": 801, "256": 802, "stop": 803, "assistant": 804, "truncating": 805, "necessary": 806, "prompts": 807, "user": 808, "sql": 809, "query": 810, "answer": 811, "question": 812, "based": 813, "test": 814, "generate": 815, "lora_request": 816, "parse_args": 817, "s3_access_key_id": 818, "getattr": 819, "s3_secret_access_key": 820, "s3_endpoint": 821, "s3_endpoint_url": 822, "credentials": 823, "model_ref": 824, "extra_config": 825, "serialized_directory": 826, "tensorizer_uri": 827, "path_to_tensors": 828, "both": 829, "eng_args_dict": 830, "dataclasses": 831, "fields": 832, "engine_args": 833, "from_cli_args": 834, "argparse": 835, "namespace": 836, "input_dir": 837, "rstrip": 838, "uuid4": 839, "hex": 840, "base_path": 841, "model_path": 842, "base_": 843, "_path": 844, "rank": 845, "03d": 846, "encryption_keyfile": 847, "serialization_kwargs": 848, "tensorize_lora_adapter": 849, "deserialization_kwargs": 850, "specified": 851, "demonstrates": 852, "usage": 853, "offloading": 854, "lmcache": 855, "v0": 856, "specify": 857, "lmcacheconnector": 858, "mistralai": 859, "mistral": 860, "7b": 861, "instruct": 862, "includes": 863, "enable_chunked_prefill": 864, "lmcacheconnectorv1": 865, "meta": 866, "llama": 867, "8b": 868, "without": 869, "needed": 870, "docs": 871, "getting_started": 872, "installation": 873, "html": 874, "prerequisites": 875, "learn": 876, "about": 877, "refer": 878, "contextlib": 879, "time": 880, "asdict": 881, "integration": 882, "engine_name": 883, "cache_engine": 884, "lmcacheenginebuilder": 885, "kvtransferconfig": 886, "engine": 887, "arg_utils": 888, "setup_environment_variables": 889, "vllm_version": 890, "related": 891, "variables": 892, "experimental": 893, "features": 894, "lmcache_use_experimental": 895, "tokens": 896, "per": 897, "chunk": 898, "lmcache_chunk_size": 899, "backend": 900, "lmcache_local_cpu": 901, "memory": 902, "limit": 903, "gb": 904, "lmcache_max_local_cpu_size": 905, "vllm_use_v1": 906, "contextmanager": 907, "build_llm_with_lmcache": 908, "lmcache_connector": 909, "ktc": 910, "kv_connector": 911, "kv_role": 912, "kv_both": 913, "utilization": 914, "a40": 915, "40gb": 916, "has": 917, "less": 918, "chunked": 919, "prefill": 920, "14505": 921, "392": 922, "llm_args": 923, "kv_transfer_config": 924, "max_model_len": 925, "8000": 926, "gpu_memory_utilization": 927, "yield": 928, "clean": 929, "up": 930, "destroy": 931, "print_output": 932, "prompt": 933, "req_str": 934, "logs": 935, "like": 936, "following": 937, "storing": 938, "kv": 939, "cache": 940, "6006": 941, "out": 942, "indicates": 943, "stored": 944, "start": 945, "outputs": 946, "50": 947, "generated_text": 948, "generation": 949, "took": 950, "2f": 951, "seconds": 952, "argumentparser": 953, "choices": 954, "runs": 955, "two": 956, "requests": 957, "shared": 958, "define": 959, "specific": 960, "shared_prompt": 961, "hello": 962, "1000": 963, "first_prompt": 964, "second_prompt": 965, "tell": 966, "me": 967, "very": 968, "long": 969, "story": 970, "top_p": 971, "95": 972, "sleep": 973, "second": 974, "disaggregated": 975, "prefilling": 976, "launch": 977, "instances": 978, "transferred": 979, "manner": 980, "node": 981, "pip": 982, "multiprocessing": 983, "event": 984, "process": 985, "port": 986, "8100": 987, "disable": 988, "buffer": 989, "lmcache_remote_url": 990, "lm": 991, "localhost": 992, "serializer": 993, "deserializer": 994, "naive": 995, "raw": 996, "bytes": 997, "compression": 998, "lmcache_remote_serde": 999, "run_prefill": 1000, "prefill_done": 1001, "cuda_visible_devices": 1002, "kv_producer": 1003, "kv_rank": 1004, "kv_parallel_size": 1005, "enforce_eager": 1006, "finished": 1007, "run_decode": 1008, "timeout": 1009, "kv_consumer": 1010, "waiting": 1011, "finish": 1012, "wait": 1013, "run_lmcache_server": 1014, "server_proc": 1015, "popen": 1016, "prefill_process": 1017, "decode_process": 1018, "lmcache_server_process": 1019, "processes": 1020, "terminate": 1021, "store": 1022, "retrieve": 1023, "needs": 1024, "run_store": 1025, "store_done": 1026, "run_retrieve": 1027, "store_process": 1028, "retrieve_process": 1029, "asynccontextmanager": 1030, "httpx": 1031, "numpy": 1032, "np": 1033, "fastapi": 1034, "responses": 1035, "streamingresponse": 1036, "async": 1037, "lifespan": 1038, "app": 1039, "manager": 1040, "handle": 1041, "startup": 1042, "shutdown": 1043, "events": 1044, "initialize": 1045, "clients": 1046, "prefiller_base_url": 1047, "http": 1048, "global_args": 1049, "prefiller_host": 1050, "prefiller_port": 1051, "decoder_base_url": 1052, "decoder_host": 1053, "decoder_port": 1054, "state": 1055, "prefill_client": 1056, "asyncclient": 1057, "base_url": 1058, "decode_client": 1059, "close": 1060, "await": 1061, "aclose": 1062, "statscalculator": 1063, "_stats": 1064, "_last_log_time": 1065, "add": 1066, "_log_stats": 1067, "average": 1068, "median": 1069, "99th": 1070, "percentile": 1071, "np_arr": 1072, "array": 1073, "output_str": 1074, "nnum": 1075, "nprefill": 1076, "ttft": 1077, "stats": 1078, "ms": 1079, "mean": 1080, "99": 1081, "stats_calculator": 1082, "counter": 1083, "host": 1084, "prefiller": 1085, "decoder": 1086, "8200": 1087, "hold": 1088, "persistent": 1089, "send_request_to_service": 1090, "client": 1091, "endpoint": 1092, "req_data": 1093, "send": 1094, "service": 1095, "max_completion_tokens": 1096, "headers": 1097, "authorization": 1098, "bearer": 1099, "openai_api_key": 1100, "response": 1101, "post": 1102, "raise_for_status": 1103, "stream_service_response": 1104, "asynchronously": 1105, "stream": 1106, "aiter_bytes": 1107, "completions": 1108, "handle_completions": 1109, "global": 1110, "st": 1111, "ignore": 1112, "et": 1113, "generate_stream": 1114, "media_type": 1115, "exc_info": 1116, "occurred": 1117, "disagg": 1118, "proxy": 1119, "format_exception": 1120, "chat": 1121, "handle_chat_completions": 1122, "uvicorn": 1123, "simple": 1124, "demonstrating": 1125, "streaming": 1126, "offline": 1127, "asyncllm": 1128, "shows": 1129, "functionality": 1130, "token": 1131, "scenarios": 1132, "delta": 1133, "mode": 1134, "receive": 1135, "new": 1136, "offline_inference": 1137, "async_llm_streaming": 1138, "asyncio": 1139, "asyncengineargs": 1140, "requestoutputkind": 1141, "async_llm": 1142, "stream_response": 1143, "request_id": 1144, "display": 1145, "arrive": 1146, "pattern": 1147, "kind": 1148, "call": 1149, "iterate": 1150, "over": 1151, "generator": 1152, "flag": 1153, "know": 1154, "complete": 1155, "end": 1156, "flush": 1157, "sampling": 1158, "parameters": 1159, "100": 1160, "seed": 1161, "42": 1162, "reproducible": 1163, "results": 1164, "output_kind": 1165, "each": 1166, "iteration": 1167, "completion": 1168, "last": 1169, "new_text": 1170, "break": 1171, "initializing": 1172, "1b": 1173, "faster": 1174, "from_engine_args": 1175, "demonstrate": 1176, "future": 1177, "artificial": 1178, "intelligence": 1179, "galaxy": 1180, "far": 1181, "away": 1182, "happiness": 1183, "running": 1184, "enumerate": 1185, "60": 1186, "brief": 1187, "pause": 1188, "completed": 1189, "always": 1190, "shutting": 1191, "down": 1192, "keyboardinterrupt": 1193, "interrupted": 1194, "correct": 1195, "language": 1196, "most": 1197, "follow": 1198, "corresponding": 1199, "namedtuple": 1200, "huggingface_hub": 1201, "snapshot_download": 1202, "transformers": 1203, "autotokenizer": 1204, "assets": 1205, "audioasset": 1206, "audio_assets": 1207, "mary_had_lamb": 1208, "winning_call": 1209, "question_per_audio_count": 1210, "what": 1211, "recited": 1212, "sport": 1213, "nursery": 1214, "rhyme": 1215, "referenced": 1216, "modelrequestdata": 1217, "prompt_token_ids": 1218, "multi_modal_data": 1219, "stop_token_ids": 1220, "lora_requests": 1221, "max_num_seqs": 1222, "result": 1223, "oom": 1224, "gpus": 1225, "unless": 1226, "settings": 1227, "tested": 1228, "work": 1229, "l4": 1230, "voxtral": 1231, "run_voxtral": 1232, "audio_count": 1233, "protocol": 1234, "messages": 1235, "audiochunk": 1236, "rawaudio": 1237, "textchunk": 1238, "usermessage": 1239, "chatcompletionrequest": 1240, "tokenizers": 1241, "mistraltokenizer": 1242, "model_name": 1243, "mini": 1244, "3b": 1245, "2507": 1246, "tokenizer": 1247, "from_hf_hub": 1248, "8192": 1249, "limit_mm_per_prompt": 1250, "config_format": 1251, "tokenizer_mode": 1252, "text_chunk": 1253, "audios": 1254, "from_file": 1255, "get_local_path": 1256, "strict": 1257, "audio_chunks": 1258, "input_audio": 1259, "from_audio": 1260, "encode_chat_completion": 1261, "prompt_ids": 1262, "audios_and_sr": 1263, "au": 1264, "audio_array": 1265, "sampling_rate": 1266, "gemma3n": 1267, "run_gemma3n": 1268, "google": 1269, "gemma": 1270, "3n": 1271, "e2b": 1272, "2048": 1273, "max_num_batched_tokens": 1274, "start_of_turn": 1275, "audio_soft_token": 1276, "end_of_turn": 1277, "granite": 1278, "speech": 1279, "run_granite_speech": 1280, "setting": 1281, "somehat": 1282, "different": 1283, "than": 1284, "optimal": 1285, "generally": 1286, "recommended": 1287, "beam": 1288, "readme": 1289, "suggested": 1290, "co": 1291, "ibm": 1292, "trust_remote_code": 1293, "max_lora_rank": 1294, "64": 1295, "enabled": 1296, "whenever": 1297, "inputs": 1298, "speech_lora_path": 1299, "audio_placeholder": 1300, "start_of_role": 1301, "end_of_role": 1302, "knowledge": 1303, "cutoff": 1304, "date": 1305, "april": 1306, "2024": 1307, "ntoday": 1308, "december": 1309, "19": 1310, "nyou": 1311, "developed": 1312, "helpful": 1313, "end_of_text": 1314, "noqa": 1315, "e501": 1316, "minicpm": 1317, "run_minicpmo": 1318, "openbmb": 1319, "2_6": 1320, "from_pretrained": 1321, "4096": 1322, "stop_tokens": 1323, "im_end": 1324, "endoftext": 1325, "convert_tokens_to_ids": 1326, "audio_chat_template": 1327, "message": 1328, "im_start": 1329, "role": 1330, "endfor": 1331, "add_generation_prompt": 1332, "spk_bos": 1333, "spk": 1334, "spk_eos": 1335, "tts_bos": 1336, "endif": 1337, "apply_chat_template": 1338, "tokenize": 1339, "chat_template": 1340, "phi": 1341, "multimodal": 1342, "run_phi4mm": 1343, "image": 1344, "microsoft": 1345, "vision": 1346, "manually": 1347, "placeholders": 1348, "audio_": 1349, "12800": 1350, "320": 1351, "run_phi4_multimodal": 1352, "revision": 1353, "refs": 1354, "pr": 1355, "70": 1356, "qwen2": 1357, "run_qwen2_audio": 1358, "qwen": 1359, "audio_in_prompt": 1360, "idx": 1361, "audio_bos": 1362, "audio_eos": 1363, "omni": 1364, "run_qwen2_5_omni": 1365, "default_system": 1366, "virtual": 1367, "human": 1368, "team": 1369, "alibaba": 1370, "capable": 1371, "perceiving": 1372, "auditory": 1373, "visual": 1374, "well": 1375, "generating": 1376, "ultravox": 1377, "run_ultravox": 1378, "fixie": 1379, "v0_5": 1380, "3_2": 1381, "whisper": 1382, "run_whisper": 1383, "support": 1384, "input": 1385, "large": 1386, "v3": 1387, "turbo": 1388, "startoftranscript": 1389, "448": 1390, "model_example_map": 1391, "granite_speech": 1392, "minicpmo": 1393, "phi4_mm": 1394, "phi4_multimodal": 1395, "qwen2_audio": 1396, "qwen2_5_omni": 1397, "demo": 1398, "keys": 1399, "model_type": 1400, "num": 1401, "num_audios": 1402, "modalities": 1403, "default_limits": 1404, "even": 1405, "identical": 1406, "batch": 1407, "mm_data": 1408, "asset": 1409, "audio_and_sample_rate": 1410, "num_prompts": 1411, "applicable": 1412, "demonstration": 1413, "automatic": 1414, "caching": 1415, "apc": 1416, "cached": 1417, "pairs": 1418, "previous": 1419, "shares": 1420, "reduces": 1421, "redundant": 1422, "computation": 1423, "improves": 1424, "speed": 1425, "enable_prefix_caching": 1426, "uses": 1427, "markdown": 1428, "table": 1429, "compares": 1430, "queries": 1431, "share": 1432, "ask": 1433, "questions": 1434, "automatic_prefix_caching": 1435, "ruff": 1436, "long_prompt": 1437, "recognizes": 1438, "tables": 1439, "follows": 1440, "age": 1441, "occupation": 1442, "country": 1443, "email": 1444, "phone": 1445, "address": 1446, "john": 1447, "doe": 1448, "29": 1449, "engineer": 1450, "usa": 1451, "555": 1452, "1234": 1453, "123": 1454, "elm": 1455, "springfield": 1456, "il": 1457, "jane": 1458, "smith": 1459, "34": 1460, "doctor": 1461, "canada": 1462, "5678": 1463, "456": 1464, "oak": 1465, "toronto": 1466, "alice": 1467, "johnson": 1468, "27": 1469, "teacher": 1470, "uk": 1471, "8765": 1472, "789": 1473, "pine": 1474, "london": 1475, "bob": 1476, "brown": 1477, "45": 1478, "artist": 1479, "australia": 1480, "4321": 1481, "321": 1482, "maple": 1483, "sydney": 1484, "nsw": 1485, "carol": 1486, "white": 1487, "31": 1488, "scientist": 1489, "zealand": 1490, "6789": 1491, "654": 1492, "birch": 1493, "wellington": 1494, "nz": 1495, "dave": 1496, "gree": 1497, "en": 1498, "28": 1499, "lawyer": 1500, "ireland": 1501, "3456": 1502, "987": 1503, "cedar": 1504, "dublin": 1505, "ie": 1506, "emma": 1507, "black": 1508, "40": 1509, "musician": 1510, "1111": 1511, "246": 1512, "ash": 1513, "york": 1514, "ny": 1515, "frank": 1516, "blue": 1517, "37": 1518, "chef": 1519, "2222": 1520, "135": 1521, "spruce": 1522, "vancouver": 1523, "bc": 1524, "grace": 1525, "yellow": 1526, "3333": 1527, "864": 1528, "fir": 1529, "manchester": 1530, "henry": 1531, "violet": 1532, "32": 1533, "4444": 1534, "753": 1535, "willow": 1536, "melbourne": 1537, "vic": 1538, "irene": 1539, "orange": 1540, "26": 1541, "5555": 1542, "912": 1543, "poplar": 1544, "auckland": 1545, "jack": 1546, "indigo": 1547, "38": 1548, "6666": 1549, "159": 1550, "cork": 1551, "karen": 1552, "red": 1553, "41": 1554, "7777": 1555, "357": 1556, "boston": 1557, "ma": 1558, "14": 1559, "leo": 1560, "30": 1561, "8888": 1562, "calgary": 1563, "ab": 1564, "15": 1565, "mia": 1566, "green": 1567, "33": 1568, "9999": 1569, "975": 1570, "edinburgh": 1571, "16": 1572, "noah": 1573, "0000": 1574, "brisbane": 1575, "qld": 1576, "17": 1577, "olivia": 1578, "35": 1579, "1212": 1580, "hamilton": 1581, "18": 1582, "peter": 1583, "3434": 1584, "limerick": 1585, "quinn": 1586, "5656": 1587, "seattle": 1588, "wa": 1589, "20": 1590, "rachel": 1591, "7878": 1592, "ottawa": 1593, "21": 1594, "steve": 1595, "44": 1596, "9090": 1597, "birmingham": 1598, "22": 1599, "tina": 1600, "36": 1601, "1213": 1602, "perth": 1603, "23": 1604, "umar": 1605, "39": 1606, "3435": 1607, "christchurch": 1608, "24": 1609, "victor": 1610, "43": 1611, "5657": 1612, "galway": 1613, "25": 1614, "wendy": 1615, "7879": 1616, "denver": 1617, "xavier": 1618, "9091": 1619, "montreal": 1620, "qc": 1621, "yara": 1622, "1214": 1623, "leeds": 1624, "zack": 1625, "3436": 1626, "adelaide": 1627, "sa": 1628, "amy": 1629, "5658": 1630, "ben": 1631, "7870": 1632, "waterford": 1633, "get_generation_time": 1634, "start_time": 1635, "end_time": 1636, "lmsys": 1637, "longchat": 1638, "13b": 1639, "16k": 1640, "querying": 1641, "avoids": 1642, "computing": 1643, "again": 1644, "ray": 1645, "data": 1646, "parallel": 1647, "framework": 1648, "calling": 1649, "want": 1650, "code": 1651, "bash": 1652, "header": 1653, "application": 1654, "describe": 1655, "detail": 1656, "image_url": 1657, "amazonaws": 1658, "cms": 1659, "ipressroom": 1660, "338": 1661, "201808": 1662, "5b894ee1a138352221103195_a680": 1663, "7ejogging": 1664, "edit": 1665, "a680": 1666, "edit_hero": 1667, "jpg": 1668, "one": 1669, "french": 1670, "www": 1671, "wolframcloud": 1672, "obj": 1673, "resourcesystem": 1674, "images": 1675, "a0e": 1676, "a0ee3983": 1677, "46c6": 1678, "4c92": 1679, "b85d": 1680, "059044639928": 1681, "6af8cfb971db031b": 1682, "png": 1683, "advanced": 1684, "switch": 1685, "nemo": 1686, "2407": 1687, "ability": 1688, "generate_random_id": 1689, "length": 1690, "characters": 1691, "ascii_letters": 1692, "digits": 1693, "random_id": 1694, "choice": 1695, "simulate": 1696, "called": 1697, "get_current_weather": 1698, "city": 1699, "unit": 1700, "weather": 1701, "85": 1702, "degrees": 1703, "partly": 1704, "cloudly": 1705, "highs": 1706, "90": 1707, "tool_functions": 1708, "tools": 1709, "properties": 1710, "san": 1711, "francisco": 1712, "letter": 1713, "abbreviation": 1714, "ca": 1715, "would": 1716, "california": 1717, "enum": 1718, "celsius": 1719, "fahrenheit": 1720, "temperate": 1721, "dallas": 1722, "let": 1723, "now": 1724, "execute": 1725, "simulating": 1726, "above": 1727, "tool_calls": 1728, "tool_answers": 1729, "give": 1730, "tool_call_id": 1731, "yields": 1732, "tx": 1733, "yarn": 1734, "method": 1735, "rope_scaling": 1736, "context_extension": 1737, "create_llm": 1738, "rope_theta": 1739, "1000000": 1740, "original_max_position_embeddings": 1741, "32768": 1742, "factor": 1743, "hf_overrides": 1744, "rope_type": 1745, "qwen3": 1746, "run_llm_chat": 1747, "128": 1748, "conversation": 1749, "assist": 1750, "today": 1751, "use_tqdm": 1752, "print_outputs": 1753, "ngenerated": 1754, "80": 1755, "baai": 1756, "bge": 1757, "reranker": 1758, "v2": 1759, "caution": 1760, "yes": 1761, "convert_model_to_seq_cls": 1762, "classifier_from_tokens": 1763, "no_post_processing": 1764, "seq": 1765, "cls": 1766, "mxbai": 1767, "rerank": 1768, "mixedbread": 1769, "from_2_way_softmax": 1770, "causal_lm": 1771, "seq_cls_model": 1772, "device": 1773, "discussions": 1774, "lm_head_weights": 1775, "lm_head": 1776, "weight": 1777, "false_id": 1778, "true_id": 1779, "score_weight": 1780, "float32": 1781, "no_grad": 1782, "score": 1783, "copy_": 1784, "unsqueeze": 1785, "bias": 1786, "zero_": 1787, "token_ids": 1788, "method_map": 1789, "converting": 1790, "use_pad_token": 1791, "num_labels": 1792, "automodelforcausallm": 1793, "device_map": 1794, "automodelforsequenceclassification": 1795, "ignore_mismatched_sizes": 1796, "defaults": 1797, "pad_token": 1798, "pad_token_id": 1799, "save_pretrained": 1800, "forcausallm": 1801, "forsequenceclassification": 1802, "classifier": 1803, "pad": 1804, "action": 1805, "store_true": 1806, "whether": 1807, "converted": 1808, "data_parallel": 1809, "research": 1810, "powermoe": 1811, "dp": 1812, "size": 1813, "tp": 1814, "multi": 1815, "assume": 1816, "ip": 1817, "48": 1818, "master": 1819, "addr": 1820, "13345": 1821, "get_open_port": 1822, "total": 1823, "nodes": 1824, "enforce": 1825, "eager": 1826, "execution": 1827, "trust": 1828, "seqs": 1829, "maximum": 1830, "sequences": 1831, "processed": 1832, "300": 1833, "before": 1834, "unresponsive": 1835, "killed": 1836, "float": 1837, "fraction": 1838, "allowed": 1839, "allocate": 1840, "dp_size": 1841, "local_dp_rank": 1842, "global_dp_rank": 1843, "dp_master_ip": 1844, "dp_master_port": 1845, "gpus_per_dp_rank": 1846, "vllm_dp_rank": 1847, "vllm_dp_rank_local": 1848, "vllm_dp_size": 1849, "vllm_dp_master_ip": 1850, "vllm_dp_master_port": 1851, "inside": 1852, "sample": 1853, "president": 1854, "united": 1855, "states": 1856, "capital": 1857, "france": 1858, "usually": 1859, "ranks": 1860, "full": 1861, "dataset": 1862, "part": 1863, "floor": 1864, "remainder": 1865, "distribute": 1866, "groups": 1867, "min": 1868, "placeholder": 1869, "params": 1870, "doing": 1871, "every": 1872, "enable_expert_parallel": 1873, "engines": 1874, "loops": 1875, "exiting": 1876, "tp_size": 1877, "node_size": 1878, "node_rank": 1879, "127": 1880, "master_addr": 1881, "master_port": 1882, "dp_siz": 1883, "ze": 1884, "divisible": 1885, "dp_per_node": 1886, "procs": 1887, "proc": 1888, "exit_code": 1889, "exitcode": 1890, "killing": 1891, "pid": 1892, "didn": 1893, "within": 1894, "minutes": 1895, "kill": 1896, "transfer": 1897, "them": 1898, "receives": 1899, "while": 1900, "three": 1901, "do": 1902, "hi": 1903, "pyncclconnector": 1904, "transmit": 1905, "caches": 1906, "a6000": 1907, "adjust": 1908, "fit": 1909, "2000": 1910, "keep": 1911, "otherwise": 1912, "prematurely": 1913, "causing": 1914, "incomplete": 1915, "decoding": 1916, "stopped": 1917, "producer": 1918, "pipe": 1919, "point": 1920, "set_defaults": 1921, "jinaai": 1922, "jina": 1923, "embeddings": 1924, "runner": 1925, "pooling": 1926, "rabbit": 1927, "english": 1928, "sigue": 1929, "al": 1930, "conejo": 1931, "blanco": 1932, "spanish": 1933, "suis": 1934, "le": 1935, "lapin": 1936, "blanc": 1937, "跟着白兔走": 1938, "chinese": 1939, "اتبع": 1940, "الأرنب": 1941, "الأبيض": 1942, "arabic": 1943, "folge": 1944, "dem": 1945, "weißen": 1946, "kaninchen": 1947, "german": 1948, "embedding": 1949, "vars": 1950, "embeddingrequestoutputs": 1951, "matching": 1952, "task": 1953, "16120": 1954, "embed": 1955, "zip": 1956, "embeds": 1957, "embeds_trimmed": 1958, "poolingparams": 1959, "pooling_params": 1960, "dimensions": 1961, "nembeddings": 1962, "prompting": 1963, "encoder": 1964, "specifically": 1965, "bart": 1966, "mbart": 1967, "refactored": 1968, "allow": 1969, "selection": 1970, "via": 1971, "explicitencoderdecoderprompt": 1972, "textprompt": 1973, "tokensprompt": 1974, "zip_enc_dec_prompts": 1975, "holds": 1976, "model_id": 1977, "encoder_prompts": 1978, "decoder_prompts": 1979, "get_bart_config": 1980, "cnn": 1981, "cases": 1982, "original": 1983, "another": 1984, "get_mbart_config": 1985, "ro": 1986, "suitable": 1987, "romanian": 1988, "translation": 1989, "quick": 1990, "fox": 1991, "jumps": 1992, "lazy": 1993, "dog": 1994, "architectures": 1995, "mbartforconditionalgeneration": 1996, "model_getters": 1997, "create_all_prompt_types": 1998, "encoder_prompts_raw": 1999, "decoder_prompts_raw": 2000, "generates": 2001, "diverse": 2002, "types": 2003, "generic": 2004, "various": 2005, "objects": 2006, "text_prompt_raw": 2007, "text_prompt": 2008, "tokens_prompt": 2009, "encode": 2010, "decoder_tokens_prompt": 2011, "single_prompt_examples": 2012, "explicit_pair_examples": 2013, "encoder_prompt": 2014, "decoder_prompt": 2015, "zipped_prompt_list": 2016, "create_sampling_params": 2017, "min_tokens": 2018, "formats": 2019, "model_key": 2020, "config_getter": 2021, "model_config": 2022, "dtype": 2023, "llm_engine": 2024, "get_tokenizer_group": 2025, "flexible": 2026, "short": 2027, "explicit": 2028, "implicit": 2029, "enc": 2030, "dec": 2031, "lmms": 2032, "collections": 2033, "abc": 2034, "sequence": 2035, "prompttype": 2036, "imageasset": 2037, "run_florence2": 2038, "florence": 2039, "isotr0py": 2040, "half": 2041, "detailed_caption": 2042, "stop_sign": 2043, "pil_image": 2044, "shown": 2045, "cherry_blossom": 2046, "run_mllama": 2047, "11b": 2048, "begin_of_text": 2049, "florence2": 2050, "mllama": 2051, "skip_special_tokens": 2052, "requestoutput": 2053, "information": 2054, "duration": 2055, "rps": 2056, "llmengine": 2057, "create_test_prompts": 2058, "tuple": 2059, "robot": 2060, "injure": 2061, "being": 2062, "logprobs": 2063, "prompt_logprobs": 2064, "top_k": 2065, "presence_penalty": 2066, "meaning": 2067, "life": 2068, "frequency_penalty": 2069, "process_requests": 2070, "test_prompts": 2071, "continuously": 2072, "has_unfinished_requests": 2073, "pop": 2074, "add_request": 2075, "request_outputs": 2076, "step": 2077, "request_output": 2078, "initialize_engine": 2079, "sets": 2080, "validates": 2081, "sharded_state": 2082, "previously": 2083, "save_sharded_state": 2084, "deepspeedfp": 2085, "sharded": 2086, "modele": 2087, "load_sharded_state": 2088, "clarity": 2089, "validation": 2090, "world": 2091, "top": 2092, "parameter": 2093, "prepare": 2094, "nrunning": 2095, "custom": 2096, "logits": 2097, "processor": 2098, "basic": 2099, "implementing": 2100, "dummylogitsprocessor": 2101, "implementation": 2102, "test_utils": 2103, "purposes": 2104, "dummy": 2105, "employed": 2106, "target_token": 2107, "passed": 2108, "argument": 2109, "extra_args": 2110, "mask": 2111, "constructed": 2112, "expect": 2113, "decoded": 2114, "yielding": 2115, "similar": 2116, "below": 2117, "racist": 2118, "he": 2119, "nhe": 2120, "hands": 2121, "people": 2122, "nthe": 2123, "vllmconfig": 2124, "logits_processor": 2125, "batchupdate": 2126, "logitsprocessor": 2127, "movedirectionality": 2128, "hypothetical": 2129, "fake": 2130, "logit": 2131, "vllm_config": 2132, "is_pin_memory": 2133, "req_info": 2134, "is_argmax_invariant": 2135, "never": 2136, "impacts": 2137, "greedy": 2138, "update_state": 2139, "batch_update": 2140, "added": 2141, "moved": 2142, "unidirectional": 2143, "move": 2144, "swap": 2145, "adx": 2146, "bdx": 2147, "direct": 2148, "a_val": 2149, "b_val": 2150, "apply": 2151, "values": 2152, "modification": 2153, "rows_list": 2154, "cols": 2155, "rows": 2156, "values_to_keep": 2157, "clone": 2158, "inf": 2159, "mixture": 2160, "don": 2161, "utilize": 2162, "logitproc": 2163, "sampling_params_list": 2164, "67": 2165, "logits_processors": 2166, "texts": 2167, "techniques": 2168, "access": 2169, "gc": 2170, "next": 2171, "lora_repo": 2172, "max_loras": 2173, "test_configs": 2174, "qlora": 2175, "arxiv": 2176, "org": 2177, "abs": 2178, "2305": 2179, "14314": 2180, "qlora_inference_example": 2181, "huggyllama": 2182, "bitsandbytes": 2183, "timdettmers": 2184, "flan": 2185, "awq_inference_with_lora_example": 2186, "thebloke": 2187, "tinyllama": 2188, "awq": 2189, "jashing": 2190, "colorist": 2191, "gptq_inference_with_lora_example": 2192, "gptq": 2193, "test_config": 2194, "repo_id": 2195, "del": 2196, "collect": 2197, "empty_cache": 2198, "metrics": 2199, "reader": 2200, "gauge": 2201, "histogram": 2202, "vector": 2203, "disable_log_stats": 2204, "dump": 2205, "metric": 2206, "get_metrics": 2207, "isinstance": 2208, "sum": 2209, "bucket_le": 2210, "buckets": 2211, "small": 2212, "24b": 2213, "2503": 2214, "mm": 2215, "16384": 2216, "low": 2217, "vram": 2218, "scripts": 2219, "2x": 2220, "l40": 2221, "run_simple_demo": 2222, "auto": 2223, "mm_processor_cache_gb": 2224, "disable_mm_processor_cache": 2225, "sentence": 2226, "image_pil": 2227, "run_advanced_demo": 2228, "max_img_per_msg": 2229, "max_tokens_per_img": 2230, "url_1": 2231, "patrickvonplaten": 2232, "random_img": 2233, "resolve": 2234, "yosemite": 2235, "url_2": 2236, "picsum": 2237, "photos": 2238, "url_3": 2239, "512": 2240, "nature": 2241, "details": 2242, "modal": 2243, "comparing": 2244, "performance": 2245, "speculative": 2246, "still": 2247, "mlpspeculator": 2248, "time_generation": 2249, "title": 2250, "warmup": 2251, "template": 2252, "instruction": 2253, "describes": 2254, "appropriately": 2255, "completes": 2256, "speculation": 2257, "speculative_config": 2258, "accelerator": 2259, "llama2": 2260, "expectation": 2261, "ran": 2262, "after": 2263, "schema": 2264, "table_name_74": 2265, "icao": 2266, "varchar": 2267, "airport": 2268, "lilongwe": 2269, "international": 2270, "32003": 2271, "lora2": 2272, "controls": 2273, "loras": 2274, "larger": 2275, "numbers": 2276, "cause": 2277, "higher": 2278, "slot": 2279, "own": 2280, "preallocated": 2281, "possible": 2282, "max_cpu_loras": 2283, "yard1": 2284, "block_size": 2285, "currently": 2286, "known": 2287, "limitation": 2288, "continuous": 2289, "batching": 2290, "neuronx": 2291, "todo": 2292, "liangfu": 2293, "paged": 2294, "attention": 2295, "1024": 2296, "detected": 2297, "aws": 2298, "sdk": 2299, "unspecified": 2300, "automated": 2301, "detection": 2302, "explicitly": 2303, "assigned": 2304, "eagle": 2305, "draft": 2306, "fine": 2307, "tuned": 2308, "additionally": 2309, "nxd": 2310, "include": 2311, "head": 2312, "annapurna": 2313, "labs": 2314, "500": 2315, "ignore_eos": 2316, "home": 2317, "ubuntu": 2318, "model_hf": 2319, "70b": 2320, "num_speculative_tokens": 2321, "distributed": 2322, "override_neuron_config": 2323, "enable_eagle_speculation": 2324, "enable_fused_speculation": 2325, "creates": 2326, "xla": 2327, "hlo": 2328, "graphs": 2329, "neuron_context_length_buckets": 2330, "gen": 2331, "neuron_token_gen_buckets": 2332, "quantizes": 2333, "int8": 2334, "neuron_quant_dtype": 2335, "s8": 2336, "neuron_quant": 2337, "cast_logits_dtype": 2338, "bfloat16": 2339, "neuronx_distributed_inference": 2340, "add_instruct": 2341, "pil": 2342, "get_image": 2343, "recipe": 2344, "mayonnaise": 2345, "sentences": 2346, "italy": 2347, "famous": 2348, "pexels": 2349, "1108099": 2350, "photo": 2351, "jpeg": 2352, "compress": 2353, "cs": 2354, "tinysrgb": 2355, "dpr": 2356, "get_vllm_mllama_model_inputs": 2357, "single_image": 2358, "put": 2359, "compose": 2360, "input_image": 2361, "has_image": 2362, "numel": 2363, "instruct_prompt": 2364, "got": 2365, "sequence_parallel_enabled": 2366, "skip_warmup": 2367, "save_sharded_checkpoint": 2368, "on_device_sampling_config": 2369, "global_topk": 2370, "dynamic": 2371, "deterministic": 2372, "batched_inputs": 2373, "batched_sample_params": 2374, "pmpt": 2375, "img": 2376, "am": 2377, "config_buckets": 2378, "initialize_llm": 2379, "openlm": 2380, "open_llama_7b": 2381, "open_llama_3b": 2382, "cleanup_dist_env_and_memory": 2383, "just": 2384, "benchmarking": 2385, "purpose": 2386, "benchmarks": 2387, "benchmark_prefix_caching": 2388, "expert": 2389, "school": 2390, "principal": 2391, "skilled": 2392, "effectively": 2393, "managing": 2394, "faculty": 2395, "staff": 2396, "potential": 2397, "grade": 2398, "girls": 2399, "independent": 2400, "emphasizes": 2401, "community": 2402, "joyful": 2403, "discovery": 2404, "learning": 2405, "candidate": 2406, "coming": 2407, "round": 2408, "panel": 2409, "interview": 2410, "8th": 2411, "math": 2412, "teaching": 2413, "years": 2414, "experience": 2415, "ed": 2416, "public": 2417, "middle": 2418, "fulfill": 2419, "paragraph": 2420, "generating_prompts": 2421, "baseline": 2422, "regular_llm": 2423, "regular_generated_texts": 2424, "free": 2425, "prefix_cached_llm": 2426, "computed": 2427, "cached_generated_texts": 2428, "compare": 2429, "speedup": 2430, "generated_same": 2431, "gene": 2432, "erated": 2433, "answers": 2434, "datetime": 2435, "union": 2436, "albumentations": 2437, "rasterio": 2438, "regex": 2439, "einops": 2440, "rearrange": 2441, "terratorch": 2442, "datamodules": 2443, "sen1floods11nongeodatamodule": 2444, "set_default_dtype": 2445, "float16": 2446, "no_data": 2447, "no_data_float": 2448, "0001": 2449, "offset": 2450, "datamodule_config": 2451, "bands": 2452, "nir_narrow": 2453, "swir_1": 2454, "swir_2": 2455, "batch_size": 2456, "constant_scale": 2457, "data_root": 2458, "dccstor": 2459, "geofm": 2460, "finetuning": 2461, "sen1floods11": 2462, "drop_last": 2463, "no_data_replace": 2464, "no_label_replace": 2465, "num_workers": 2466, "test_transform": 2467, "resize": 2468, "always_apply": 2469, "height": 2470, "interpolation": 2471, "width": 2472, "pytorch": 2473, "totensorv2": 2474, "transpose_mask": 2475, "prithvimae": 2476, "skip_tokenizer_init": 2477, "input_data": 2478, "location_coords": 2479, "structure": 2480, "pixel_values": 2481, "generate_datamodule": 2482, "datamodule": 2483, "process_channel_group": 2484, "orig_img": 2485, "channels": 2486, "representing": 2487, "shape": 2488, "indices": 2489, "rgb": 2490, "num_channels": 2491, "valid_mask": 2492, "ones_like": 2493, "rescale": 2494, "enhancing": 2495, "contrast": 2496, "max_value": 2497, "3000": 2498, "min_value": 2499, "clamp": 2500, "zeros": 2501, "read_geotiff": 2502, "file_path": 2503, "ndarray": 2504, "coords": 2505, "lnglat": 2506, "save_geotiff": 2507, "output_path": 2508, "band": 2509, "geotiff": 2510, "_convert_np_uint8": 2511, "float_image": 2512, "255": 2513, "astype": 2514, "uint8": 2515, "load_example": 2516, "file_paths": 2517, "std": 2518, "paths": 2519, "created": 2520, "imgs": 2521, "metas": 2522, "temporal_coords": 2523, "rescaling": 2524, "normalize": 2525, "nodata": 2526, "moveaxis": 2527, "year": 2528, "julian_day": 2529, "strptime": 2530, "timetuple": 2531, "tm_yday": 2532, "timestamp": 2533, "axis": 2534, "num_frames": 2535, "expand_dims": 2536, "di": 2537, "run_model": 2538, "img_size": 2539, "lightning_model": 2540, "reflect": 2541, "original_h": 2542, "original_w": 2543, "pad_h": 2544, "pad_w": 2545, "sliding": 2546, "window": 2547, "windows": 2548, "unfold": 2549, "h1": 2550, "w1": 2551, "batches": 2552, "num_batches": 2553, "tensor_split": 2554, "dim": 2555, "prithvi": 2556, "eo": 2557, "300m": 2558, "tl": 2559, "pred_imgs": 2560, "standardization": 2561, "squeeze": 2562, "transpose": 2563, "aug": 2564, "pred": 2565, "y_hat": 2566, "argmax": 2567, "nn": 2568, "functional": 2569, "interpolate": 2570, "nearest": 2571, "concat": 2572, "patches": 2573, "cut": 2574, "padded": 2575, "area": 2576, "data_file": 2577, "output_dir": 2578, "rgb_outputs": 2579, "input_indices": 2580, "model_obj": 2581, "meta_data": 2582, "10000": 2583, "convert": 2584, "bgr": 2585, "lzw": 2586, "pred_file": 2587, "pred_": 2588, "splitext": 2589, "tiff": 2590, "scale": 2591, "rgb_orig": 2592, "nan": 2593, "img_pred": 2594, "isnan": 2595, "img_pred_file": 2596, "rgb_pred_": 2597, "name_suffix": 2598, "rgb_file": 2599, "output_": 2600, "_dir": 2601, "original_rgb_": 2602, "mae": 2603, "add_help": 2604, "india_900498_s2hand": 2605, "tif": 2606, "christian": 2607, "pinto": 2608, "checkpoint": 2609, "nargs": 2610, "six": 2611, "selected": 2612, "selects": 2613, "s2l1c": 2614, "inspect": 2615, "rawtexthelpformatter": 2616, "dataclass": 2617, "typealias": 2618, "tqdm": 2619, "profiler": 2620, "layerwise_profile": 2621, "batch_size_default": 2622, "prompt_len_default": 2623, "profilecontext": 2624, "prompt_len": 2625, "modes": 2626, "num_steps": 2627, "until": 2628, "complete_num_requests_per_step": 2629, "save_chrome_traces_folder": 2630, "get_dtype": 2631, "outputlen_numreqs_map": 2632, "compute_request_output_lengths": 2633, "step_requests": 2634, "lengths": 2635, "step_request": 2636, "honoured": 2637, "96": 2638, "submitted": 2639, "profile": 2640, "ith": 2641, "dictionary": 2642, "ol_nr": 2643, "num_reqs_assigned": 2644, "sanity": 2645, "begin": 2646, "assignments": 2647, "output_length": 2648, "num_requests_at_step": 2649, "reversed": 2650, "determined": 2651, "participate": 2652, "beyond": 2653, "num_reqs_unassigned_at_step": 2654, "m_reqs_unassigned_at_step": 2655, "checks": 2656, "assignment": 2657, "steps": 2658, "least": 2659, "ol": 2660, "determine_requests_per_step": 2661, "fewer": 2662, "big": 2663, "num_engine_steps": 2664, "implies": 2665, "equal": 2666, "expected": 2667, "positive": 2668, "instead": 2669, "dropping": 2670, "num_running_requests": 2671, "often": 2672, "useful": 2673, "run_profile": 2674, "csv_output": 2675, "json_output": 2676, "requests_per_step": 2677, "num_steps_to_profile": 2678, "max_output_len": 2679, "basis": 2680, "scheduler_config": 2681, "chosen": 2682, "therefore": 2683, "choose": 2684, "smaller": 2685, "increase": 2686, "batched": 2687, "add_requests": 2688, "get_output_len_generator": 2689, "output_len": 2690, "num_reqs": 2691, "output_len_generator": 2692, "randint": 2693, "get_tokenizer": 2694, "vocab_size": 2695, "tolist": 2696, "abort_requests": 2697, "abort_request": 2698, "warm": 2699, "prefill_prof": 2700, "decode_profs": 2701, "num_running_seqs": 2702, "scheduler": 2703, "get_num_unfinished_seq_groups": 2704, "decode_prof": 2705, "decode_results_list": 2706, "prof": 2707, "prefill_results": 2708, "has_decode": 2709, "line_width": 2710, "print_model_table": 2711, "summary": 2712, "print_summary_table": 2713, "csv_filename_base": 2714, "endswith": 2715, "csv": 2716, "export_model_stats_table_csv": 2717, "_prefill_model_table": 2718, "export_summary_stats_table_csv": 2719, "_prefill_summary_table": 2720, "_decode_model_table": 2721, "_decode_summary_table": 2722, "cuda_devices": 2723, "get_device_properties": 2724, "dev_idx": 2725, "device_count": 2726, "json_dict": 2727, "python_version": 2728, "torch_version": 2729, "torch_cuda_version": 2730, "convert_stats_to_dict": 2731, "dr": 2732, "decode_": 2733, "json_output_file": 2734, "indent": 2735, "export_chrome_trace": 2736, "traces": 2737, "decode_1": 2738, "etc": 2739, "folder": 2740, "profiling": 2741, "neuralmagic": 2742, "fp8": 2743, "8196": 2744, "llama31": 2745, "run_num_steps": 2746, "analyze": 2747, "terminal": 2748, "ascii": 2749, "print_layerwise_table": 2750, "phase": 2751, "matplotlib": 2752, "stacked": 2753, "bar": 2754, "charts": 2755, "visualize_layerwise_profile": 2756, "profile_breakdown": 2757, "plot": 2758, "pct_cuda_time": 2759, "formatter_class": 2760, "export": 2761, "multiple": 2762, "chrome": 2763, "run_num_steps_parser": 2764, "variation": 2765, "invocations": 2766, "1st": 2767, "2nd": 2768, "run_to_completion_parser": 2769, "run_to_completion": 2770, "exhausts": 2771, "respectively": 2772, "tack": 2773, "signature": 2774, "hugging": 2775, "face": 2776, "gated": 2777, "prompt_embed_inference": 2778, "pretrainedtokenizer": 2779, 